<?

		class PDF extends FPDF  
		{
			function Open()
			{
				// extend from function Open() 
				FPDF::Open();
				// Add fonts use in document
				if(FPDF_VERSION > '1.51'){
					$this->AddFont('angsab','','../../PDF/font/angsab.php');
					$this->AddFont('angsa','','../../PDF/font/angsa.php');
					$this->AddFont('cordia','','../../PDF/font/cordia.php');
					$this->AddFont('cordiab','','../../PDF/font/cordiab.php');
				}else{
					$this->AddFont('angsab','','../../PDF/font/angsab_old.php');
					$this->AddFont('angsa','','../../PDF/font/angsa_old.php');
					$this->AddFont('cordia','','../../PDF/font/cordia.php');
					$this->AddFont('cordiab','','../../PDF/font/cordiab.php');
				}
			}

			function Header()
			{
 				$this->SetTextColor(0,0,96);
 			    $this->SetFont('angsab','',14);

				if($this->report_title){		
					$t_title = explode("||",$this->report_title);
					if(count($t_title) == 1){      
						 //     มี heading report แค่ 1 line  -->  ชื่อรายงาน
//						if($this->company_name){ 
//			 			    $this->SetFont('angsa','',10);
//							$this->Cell(20,6,$this->company_name,0,0,'L');
//						} // end if
//						$this->x = $this->lMargin;
		 			    $this->SetFont('angsab','',14);
						$this->Cell(0,6,$t_title[0],0,1,'C');
//						$this->x = $this-> w -  55;
//						$this->Cell(50,6,$this->report_code,0,1,'R');
					}else{		
						//     มี heading report  > 1 line  -->  มีชื่อกรม ตามด้วย ชื่อรายงาน และ heading อื่น ๆ
						for($i=0; $i < count($t_title); $i++ ){
							if($i == (count($t_title) - 1)){		
//								if($this->company_name){ 
//					 			    $this->SetFont('angsa','',10);
//									$this->Cell(20,6,$this->company_name,0,0,'L');
//								} // end if
//								$this->x = $this->lMargin;
				 			    $this->SetFont('angsab','',14);
								$this->Cell(0,6,$t_title[$i],0,1,'C');
//								$this->x = $this-> w -  55;
//								$this->Cell(50,6,$this->report_code,0,1,'R');
							}else{		
//								$this->SetFont('angsab','',16);
//								$this->SetTextColor(98, 0, 0);
								$this->Cell(0,6,$t_title[$i],0,1,'C');
							} // end if
						} // end for
					} // end if
				
//					$this->SetTextColor(108);
					$this->SetTextColor(0,0,0);
	 			    $this->SetFont('angsa','',10);
					$this->Cell(0,5, $this->company_name,0,1,'L');
//					$this->line($this->lMargin,$this->y,$this->w - $this->rMargin ,$this->y);
				}   //  			if      ($this->report_title)
				
//				if   ($this->heading)
//				{
//						$this->SetTextColor(0, 0, 0);
//						$this->ReportHeader($this->heading,$this->heading_width,$this->heading_align,$this->heading_border);
//						$this->SetTextColor(108);
//						$this->line($this->lMargin,$this->y,$this->w - $this->rMargin ,$this->y);
//					}
				$this->SetTextColor(0, 0, 0);
				$this->flag_new_page = 'Y';
			}

			function Footer()
			{	if      ($this->report_title   ||  $this->footer)
					{

					$MONTH_TH[] = "เดือน";
					$MONTH_TH[] = "ม.ค.";		$MONTH_TH[] = "ก.พ.";
					$MONTH_TH[] = "มี.ค.";		$MONTH_TH[] = "เม.ย.";
					$MONTH_TH[] = "พ.ค";		$MONTH_TH[] = "มิ.ย.";
					$MONTH_TH[] = "ก.ค.";		$MONTH_TH[] = "ส.ค.";
					$MONTH_TH[] = "ก.ย.";		$MONTH_TH[] = "ต.ค.";
					$MONTH_TH[] = "พ.ย";		$MONTH_TH[] = "ธ.ค.";

					$MONTH_EN[] = "Month";
					$MONTH_EN[] = "Jan";		$MONTH_EN[] = "Feb";
					$MONTH_EN[] = "Mar";		$MONTH_EN[] = "Apr";
					$MONTH_EN[] = "May";		$MONTH_EN[] = "Jun";
					$MONTH_EN[] = "Jul";		$MONTH_EN[] = "Aug";
					$MONTH_EN[] = "Sep";		$MONTH_EN[] = "Oct";
					$MONTH_EN[] = "Nov";		$MONTH_EN[] = "Dec";

					$today = getdate(); 
					$year = $today['year'];
					if  ($this->lang_code == "TH")
							{		$year = $year + 543; 
									$month = $MONTH_TH[$today['mon']]; 
							}
					else
							{		$month = $MONTH_EN[$today['mon']]; 
							}
					$mday = $today['mday']; 
					$time = date('H:i:s');
					//Position at 1.0 cm from bottom
					$this->SetY(-10);
					$this->SetTextColor(0,0,0);
					$this->SetFont('angsa','',10);
					$this->line($this->lMargin,$this->y,$this->w - $this->rMargin ,$this->y);
					$this->Cell(100,6,($this->report_code?("รายงาน : ".$this->report_code):""),0,0,"L");		
					$this->x = ($this->w / 2) - 10;
					$this->Cell(10,6,"หน้าที่ : " . $this->PageNo()." / {nb} ",0,0,'C');
					$this->x = $this->w - 30;
					$this->Cell(25,6,"วันที่พิมพ์ : ". $mday . " " . $month . " " . $year . " " . $time,0,0,"R");
				}   //	if      ($this->report_title)
			}		

		function Text_print_optimize($text , $width)	
		{	
				while   ($this->GetStringWidth($text)  >  $width)  :
					  {   
							 $text = substr($text,0,strlen($text) -1 );
					   }
				endwhile;
				return $text;
		}

		function MultiCellThaiCut($w,$h,$txt,$border=0,$align='J',$fill=0)
		{
			//Output text with automatic or explicit line breaks
			$cw=&$this->CurrentFont['cw'];
			if($w==0)
				$w=$this->w-$this->rMargin-$this->x;
			$wmax=($w-2*$this->cMargin)*1000/$this->FontSize;
			$s=str_replace("\r",'',$txt);
			$nb=strlen($s);
			if($nb>0 && $s[$nb-1]=="\n")
				$nb--;
			$b=0;
			if($border)
			{
				if($border==1)
				{
					$border='LTRB';
					$b='LRT';
					$b2='LR';
				}
				else
				{
					$b2='';
					if(strpos($border,'L')!==false)
						$b2.='L';
					if(strpos($border,'R')!==false)
						$b2.='R';
					$b=(strpos($border,'T')!==false) ? $b2.'T' : $b2;
				}
			}
			$s = $this->thaiCutLinePDF($s, $w, "\n");
//			echo "***$s<br>";
			$sub_s = explode("\n", $s);
			for($ii = 0; $ii < count($sub_s); $ii++) {
//				echo "$ii-$sub_s[$ii]<br>";
				if($border && $ii==1)
					$b=$b2;
				if($border && $ii == (count($sub_s)-1) && strpos($border,'B')!==false)
					$b.='B';	
				$this->Cell($w,$h,$sub_s[$ii],$b,2,$align,$fill);
			}
			$this->x=$this->lMargin;
		} // end function

		// ตัดบรรทัดคำไทย
		function thaiWrapPDF($dataIn, $delim){
			$specword = array("ราชการ", "รัฐบาล", "อธิบดี", "คณะบดี", "ตำแหน่ง", "อำเภอ","จังหวัด","ปกครอง","ปฏิบัติ","สัญญา","เจ้าหน้าที่", "อยู่", "และ", "เกียรติยศ","บรรจุ", "ดำรง", "บำเหน็ด", "โรงเรียน", "มหาบัณทิต", "บัณฑิต", "บริหาร", "ชำนาญ"); // เพิ่มคำเฉพาะได้ที่นี่
			$pvword = array("กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น", "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่", "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์", "นนทบุรี", "นราธิวาส", "น่าน", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์", "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร", "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเก็ต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน", "ยโสธร", "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ", "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสงคราม", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี", "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง", "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี");
			$amword = array("มายอ", "ทุ่งยางแดง", "สายบุรี", "ดงเจริญ", "วชิรบารมี", "ชนแดน", "หล่มสัก", "หล่มเก่า", "วิเชียรบุรี", "ศรีเทพ", "หนองไผ่", "บึงสามพัน", "น้ำหนาว", "วังโป่ง", "เขาค้อ", "จอมบึง", "สวนผึ้ง", "ดำเนินสะดวก", "บ้านโป่ง", "บางแพ", "โพธาราม", "ปากท่อ", "วัดเพลง", "บ้านคา", "ไทรโยค", "บ่อพลอย", "ศรีสวัสดิ์", "ท่ามะกา", "ท่าม่วง", "ทองผาภูมิ", "สังขละบุรี", "พนมทวน", "เลาขวัญ", "ด่านมะขามเตี้ย", "หนองปรือ", "ห้วยกระเจา", "ท่ากระดาน", "บ้านทวน", "เดิมบางนางบวช", "ด่านช้าง", "บางปลาม้า", "ศรีประจันต์", "ดอนเจดีย์", "สองพี่น้อง", "สามชุก", "อู่ทอง", "หนองหญ้าไซ", "กำแพงแสน", "นครชัยศรี", "ดอนตูม", "บางเลน", "สามพราน", "พุทธมณฑล", "กระทุ่มแบน", "บ้านแพ้ว", "บางคนที", "อัมพวา", "เขาย้อย", "หนองหญ้าปล้อง", "ชะอำ", "ท่ายาง", "บ้านลาด", "บ้านแหลม", "แก่งกระจาน", "กุยบุรี", "ทับสะแก", "บางสะพาน", "บางสะพานน้อย", "ปราณบุรี", "หัวหิน", "สามร้อยยอด", "พรหมคีรี", "ลานสกา", "ลานสะกา", "ฉวาง", "พิปูน", "เชียรใหญ่", "ชะอวด", "ท่าศาลา", "ทุ่งสง", "นาบอน", "ทุ่งใหญ่", "ปากพนัง", "ร่อนพิบูลย์", "สิชล", "ขนอม", "หัวไทร", "บางขัน", "ถ้ำพรรณรา", "จุฬาภรณ์", "พระพรหม", "นบพิต้า", "ช้างกลาง", "เฉลิมพระเกียรติ", "เสือหึง", "สวนหลวง", "หินตก", "ดวนชะลิก", "กะปาง", "เขาพนม", "เกาะลันตา", "คลองท่อม", "อ่าวลึก", "จุน", "เชียงคำ", "เชียงม่วน", "ดอกคำใต้", "ปง", "แม่ใจ", "ภูซาง", "ภูกามยาว", "เวียงชัย", "ย่านตาขาว", "ปะเหลียน", "สิเกา", "ห้วยยอด", "วังวิเศษ", "นาโยง", "รัษฎา", "หาดสำราญ", "กงหรา", "เขาชัยสน", "ตะโหมด", "ควนขนุน", "ปากพะยูน", "ศรีบรรพต", "กิ่งศลีบรรพต", "ป่าบอน", "บางแก้ว", "ป่าพะยอม", "ศรีนครินทร์", "โคกโพธิ์", "หนองจิก", "ปะนาเระ", "เชียงของ", "เทิง", "พาน", "ป่าแดด", "แม่จัน", "เชียงแสน", "แม่สาย", "แม่สรวย", "เวียงป่าเป้า", "พญาเม็งราย", "เวียงแก่น", "ขุนตาล", "แม่ฟ้าหลวง", "แม่ลาว", "เวียงเชียงรุ้ง", "ดอยหลวง", "ขุนยวม", "ปาย", "แม่สะเรียง", "แม่ลาน้อย", "สบเมย", "ปางมะผ้า", "ม่วยต่อ", "โกรกพระ", "ชุมแสง", "หนองบัว ", "บรรพตพิสัย", "เก้าเลี้ยว", "ตาคลี", "ท่าตะโก", "ไพศาลี", "พยุหะคีรี", "ลาดยาว", "ตากฟ้า", "แม่วงก์", "แม่เปิน", "ชุมตาบง", "ห้วยน้ำหอม", "ชุมต", "แม่เล่ย์", "ทัพทัน", "สว่างอารมณ์", "หนองฉาง", "หนองขาหย่าง", "บ้านไร่", "ลานสัก", "ห้วยคด", "ไทรงาม", "คลองลาน", "ขาณุวรลักษบุรี", "คลองขลุง", "พรานกระต่าย", "ลานกระบือ", "ทรายทองวัฒนา", "ปางศิลาทอง", "บึงสามัคคี", "โกสัมพีนคร", "บ้านตาก", "สามเงา", "แม่ระมาด", "ท่าสองยาง", "แม่สอด", "พบพระ", "อุ้มผาง", "วังเจ้า", "ท่าปุย", "บ้านด่านลานหอย", "คีรีมาศ", "กงไกรลาศ", "ศรีสัชนาลัย", "ศรีสำโรง", "สวรรคโลก", "ศรีนคร", "ทุ่งเสลี่ยม", "นครไทย", "ชาติตระการ", "บางระกำ", "บางกระทุ่ม", "พรหมพิราม", "วัดโบสถ์", "วังทอง", "เนินมะปราง", "วังทรายพูน", "โพธิ์ประทับช้าง", "ตะพานหิน", "บางมูลนาก", "โพทะเล", "สามง่าม", "ทับคล้อ", "สากเหล็ก", "บึงนาราง", "สว่างแดนดิน", "ส่องดาว", "เต่างอย", "โคกศรีสุพรรณ", "เจริญศิลป์", "โพนนาแก้ว", "ภูพาน", "วานรนิวาส", "กุดเรือคำ", "บ้านหัน", "ปลาปาก", "ท่าอุเทน", "บ้านแพง", "ธาตุพนม", "นาแก", "เรณูนคร", "ศรีสงคราม", "นาหว้า", "โพนสวรรค์", "นาทม", "วังยาง", "นิคมคำสร้อย", "ดอนตาล", "ดงหลวง", "คำชะอี", "หว้านใหญ่", "หนองสูง", "จอมทอง", "แม่แจ่ม", "เชียงดาว", "ดอยสะเก็ด", "แม่แตง", "แม่ริม", "สะเมิง", "ฝาง", "แม่อาย", "พร้าว", "สันป่าตอง", "สันกำแพง", "สันทราย", "หางดง", "ฮอด", "ดอยเต่า", "อมก๋อย", "สารภี", "เวียงแหง", "เวียงแห", "ไชยปราการ", "แม่วาง", "แม่ออน", "ดอยหล่อ", "นครเชียงใหม่", "แขวงกา", "แขวงศร", "เม็งรา", "แม่ทา", "บ้านโฮ่ง", "ลี้", "ทุ่งหัวช้าง", "ป่าซาง", "บ้านธิ", "เวียงหนองล่อง", "แม่เมาะ", "เกาะคา", "เสริมงาม", "งาว", "แจ้ห่ม", "วังเหนือ", "เถิน", "แม่พริก", "แม่ทะ", "สบปราบ", "ห้างฉัตร", "ตรอน", "ท่าปลา", "น้ำปาด", "ไม้แก่น", "ไทรทอง", "ยะหริ่ง", "ยะรัง", "กะพ้อ", "แม่ลาน", "เบตง", "บันนังสตา", "ธารโต", "กิ่งธารโต", "ยะหา", "รามัน", "กรงปินัง", "ตากใบ", "บาเจาะ", "ยี่งอ", "ระแงะ", "รือเสาะ", "ศรีสาคร", "แว้ง", "สุคิริน", "สุไหงโก-ลก", "สุไหงปาดี", "จะแนะ", "เจาะไอร้อง", "บางนรา", "พระนคร", "ดุสิต", "หนองจอก", "บางรัก", "บางเขน", "บางกะปิ", "ปทุมวัน", "ป้อมปราบศัตรูพ่าย", "พระโขนง", "มีนบุรี", "ลาดกระบัง", "ยานนาวา", "สัมพันธวงศ์", "พญาไท", "ธนบุรี", "บางกอกใหญ่", "ห้วยขวาง", "คลองสาน", "ตลิ่งชัน", "บางกอกน้อย", "บางขุนเทียน", "ภาษีเจริญ", "หนองแขม", "ราษฎร์บูรณะ", "บางพลัด", "ดินแดง", "บึงกุ่ม", "สาธร", "บางซื่อ", "จตุจักร", "บางคอแหลม", "ประเวศ", "คลองเตย", "ราชเทวี", "ลาดพร้าว", "วัฒนา", "บางแค", "หลักสี่", "สายไหม", "คันนายาว", "สะพานสูง", "วังทองหลาง", "คลองสามวา", "บางนา", "ทวีวัฒนา", "ทุ่งครุ", "บางบอน", "บ้านทะวาย", "บางบ่อ", "บางพลี", "พระประแดง", "พระสมุทรเจดีย์", "บางเสาธง", "บางกรวย", "บางใหญ่", "บางบัวทอง", "ไทรน้อย", "ปากเกร็ด", "นครนนทบุรี", "แขวงท่าท", "คลองหลวง", "ธัญบุรี", "หนองเสือ", "ลาดหลุมแก้ว", "ลำลูกกา", "สามโคก", "คูคต", "ท่าเรือ", "นครหลวง", "บางไทร", "บางบาล", "บางปะอิน", "บางปะหัน", "ปางปะหัน", "ผักไห่", "ภาชี", "ลาดบัวหลวง", "วังน้อย", "เสนา", "บางซ้าย", "อุทัย", "มหาราช", "บ้านแพรก", "ไชโย", "ป่าโมก", "โพธิ์ทอง", "แสวงหา", "วิเศษชัยชาญ", "สามโก้", "พัฒนานิคม", "โคกสำโรง", "ชัยบาดาล", "ท่าวุ้ง", "บ้านหมี่", "ท่าหลวง", "สระโบสถ์", "โคกเจริญ", "ลำสนธิ", "หนองม่วง", "บ้านเช่า", "บางระจัน", "ค่ายบางระจัน", "พรหมบุรี", "ปลายพระยา", "ลำพัด", "ลำทับ", "เหนือคลอง", "เกาะยาว", "กะปง", "ตะกั่วทุ่ง", "ตะกั่วป่า", "คุระบุรี", "ทับปุด", "ท้ายเหมือง", "กะทู้", "ถลาง", "ทุ่งคา", "กาญจนดิษฐ์", "ดอนสัก", "เกาะสมุย", "เกาะพะงัน", "ไชยา", "ท่าชนะ", "คีรีรัฐนิคม", "บ้านตาขุน", "พนม", "ท่าฉาง", "บ้านนาสาร", "บ้านนาเดิม", "เคียนซา", "เวียงสระ", "พระแสง", "พุนพิน", "ชัยบุรี", "วิภาวดี", "เกาะพงัน", "เกาะเต่า", "บ้านดอน", "ละอุ่น", "กะเปอร์", "กระบุรี", "สุขสำราญ", "ท่าแซะ", "ปะทิว", "หลังสวน", "ละแม", "พะโต๊ะ", "ทพะโต๊ะ", "สวี", "ทุ่งตะโก", "สทิงพระ", "จะนะ", "นาทวี", "เทพา", "สะบ้าย้อย", "ระโนด", "กระแสสินธ์", "กระแสสินธุ์", "รัตภูมิ", "สะเดา", "หาดใหญ่", "นาหม่อม", "ควนเนียง", "บางกล่ำ", "สิงหนคร", "คลองหอยโข่ง", "บ้านพรุ", "ควนโดน", "กิ่งควนโดน", "ควนกาหลง", "กิ่งท่าแพ", "ท่าแพ", "ละงู", "ทุ่งหว้า", "มะนัง", "กันตัง", "นาดี", "สระแก้ว", "วังน้ำเย็น", "บ้านสร้าง", "ประจันตคาม", "ศรีมหาโพธิ", "ศรีมโหสถ", "โคกปีบ", "อรัญประเทศ", "ตาพระยา", "วัฒนานคร", "คลองหาด", "ปากพลี", "บ้านนา", "องครักษ์", "เขาฉกรรจ์", "โคกสูง", "วังสมบูรณ์", "ครบุรี", "เสิงสาง", "คง", "บ้านเหลื่อม", "ฟากท่า", "บ้านโคก", "พิชัย", "ลับแล", "ทองแสนขัน", "ร้องกวาง", "ลอง", "สูงเม่น", "เด่นชัย", "สอง", "วังชิ้น", "หนองม่วงไข่", "แม่จริม", "บ้านหลวง", "นาน้อย", "บัว", "ปัว", "ท่าวังผา", "สา", "เวียงสา", "ทุ่งช้าง", "เชียงกลาง", "นาหมื่น", "สันติสุข", "บ่อเกลือ", "สองแคว", "ภูเพียง", "ศรีบุญเรือง", "นากลาง", "สุวรรณคูหา", "โนนสัง", "บ้านผือ", "น้ำโสม", "เพ็ญ", "สร้างคอม", "หนองแสง", "นายูง", "พิบูลย์รักษ์", "กู่แก้ว", "ประจักษ์ศิลปาคม", "นาด้วง", "เชียงคาน", "ปากชม", "ด่านซ้าย", "นาแห้ว", "ภูเรือ", "ท่าลี่", "วังสะพุง", "ภูกระดึง", "ภูหลวง", "ผาขาว", "เอราวัณ", "หนองหิน", "ท่าบ่อ", "บึงกาฬ", "พรเจริญ", "โพนพิสัย", "โซ่พิสัย", "ศรีเชียงใหม่", "สังคม", "เซกา", "ปากคาด", "บึงโขงหลง", "ศรีวิไล", "บุ่งคล้า", "สระใคร", "เฝ้าไร่", "รัตนวาปี", "โพธิ์ตาก", "แกดำ", "โกสุมพิสัย", "กันทรวิชัย", "เชียงยืน", "บรบือ", "นาเชือก", "พยัคฆภูมิพิสัย", "วาปีปทุม", "นาดูน", "ยางสีสุราช", "กุดรัง", "ชื่นชม", "หลุบ", "เกษตรวิสัย", "ปทุมรัตต์", "จตุรพักตรพิมาน", "ธวัชบุรี", "พนมไพร", "โพนทอง", "โพธิ์ชัย", "หนองพอก", "เสลภูมิ", "สุวรรณภูมิ", "โพนทราย", "อาจสามารถ", "เมยวดี", "ศรีสมเด็จ", "จังหาร", "เชียงขวัญ", "หนองฮี", "ทุ่งเขาหลวง", "นามน", "กมลาไสย", "ร่องคำ", "กุฉินารายณ์", "เขาวง", "ยางตลาด", "ห้วยเม็ก", "สหัสขันธ์", "คำม่วง", "ท่าคันโท", "หนองกุงศรี", "สมเด็จ", "ห้วยผึ้ง", "สามชัย", "นาดู", "ดอนจาน", "ฆ้องชัย", "กุสุมาลย์", "กุดบาก", "พรรณานิคม", "พังโคน", "วาริชภูมิ", "นิคมน้ำอูน", "น้ำอูน", "คำตากล้า", "บ้านม่วง", "อากาศอำนวย", "พนา", "ม่วงสามสิบ", "วารินชำราบ", "อำนาจเจริญ", "เสนางคนิคม", "หัวตะพาน", "พิบูลมังสาหาร", "ตาลสุม", "โพธิ์ไทร", "สำโรง", "ดอนมดแดง", "สิรินธร", "ทุ่งศรีอุดม", "ปทุมราชวงศา", "ศรีหลักชัย", "นาเยีย", "นาตาล", "เหล่าเสือโก้ก", "สว่างวีระวงศ์", "น้ำขุ่น", "สุวรรณวารี", "ทรายมูล", "กุดชุม", "คำเขื่อนแก้ว", "ป่าติ้ว", "มหาชนะชัย", "ค้อวัง", "เลิงนกทา", "ไทยเจริญ", "บ้านเขว้า", "คอนสวรรค์", "เกษตรสมบูรณ์", "หนองบัวแดง", "จัตุรัส", "บำเหน็จณรงค์", "หนองบัวระเหว", "เทพสถิต", "ภูเขียว", "บ้านแท่น", "แก้งคร้อ", "คอนสาร", "ภักดีชุมพล", "เนินสง่า", "ซับใหญ่", "กัลยาณิวัฒนา", "บ้านหว่าเฒ่า", "วังชมภู", "ซับใ", "โคกเพชร", "นายางกลัก", "บ้านเต่า", "ท่ามะไฟหวาน", "ดนนคูณ", "ชานุมาน", "ลืออำนาจ", "นาวัง", "บ้านฝาง", "พระยืน", "หนองเรือ", "ชุมแพ", "สีชมพู", "น้ำพอง", "อุบลรัตน์", "กระนวน", "บ้านไผ่", "เปือยน้อย", "พล", "แวงใหญ่", "แวงน้อย", "หนองสองห้อง", "ภูเวียง", "มัญจาคีรี", "ชนบท", "เขาสวนกวาง", "ภูผาม่าน", "ซำสูง", "โคกโพธิ์ไชย", "หนองนาคำ", "บ้านแฮด", "โนนศิลา", "กุดจับ", "หนองวัวซอ", "กุมภวาปี", "โนนสะอาด", "หนองหาน", "ทุ่งฝน", "ไชยวาน", "ศรีธาตุ", "วังสามหมอ", "บ้านดุง", "หนองบัวลำภู", "จักราช", "โชคชัย", "ด่านขุนทด", "โนนไทย", "โนนสูง", "ขามสะแกแสง", "บัวใหญ่", "ประทาย", "ปักธงชัย", "พิมาย", "ห้วยแถลง", "ชุมพวง", "สูงเนิน", "ขามทะเลสอ", "สีคิ้ว", "ปากช่อง", "หนองบุญนาก", "แก้งสนามนาง", "โนนแดง", "วังน้ำเขียว", "เทพารักษ์", "พระทองคำ", "ลำทะเมนชัย", "บัวลาย", "สีดา", "มะค่า-พลสงคราม", "โนนลาว", "กระสัง", "นางรอง", "หนองกี่", "ละหานทราย", "ประโคนชัย", "บ้านกรวด", "พุทไธสง", "ลำปลายมาศ", "สตึก", "ปะคำ", "นาโพธิ์", "หนองหงส์", "พลับพลาชัย", "ห้วยราช", "โนนสุวรรณ", "ชำนิ", "บ้านใหม่ไชยพจน์", "โนนดินแดง", "บ้านด่าน", "แคนดง", "ชุมพลบุรี", "ท่าตูม", "จอมพระ", "ปราสาท", "กาบเชิง", "รัตนบุรี", "สนม", "ศีขรภูมิ", "สังขะ", "ลำดวน", "สำโรงทาบ", "บัวเชด", "พนมดงรัก", "ศรีณรงค์", "เขวาสินรินทร์", "โนนนารายณ์", "ยางชุมน้อย", "กันทรารมย์", "กันทรลักษ์", "ขุขันธ์", "ไพรบึง", "ปรางค์กู่", "ขุนหาญ", "ราษีไศล", "อุทุมพรพิสัย", "บึงบูรพ์", "ห้วยทับทัน", "โนนคูณ", "โนนคูน", "ศรีรัตนะ", "น้ำเกลี้ยง", "วังหิน", "ภูสิงห์", "เบญจลักษ์", "พยุห์", "โพธิ์ศรีสุวรรณ", "ศิลาลาด", "โขงเจียม", "เขื่องใน", "เขมราฐ", "เดชอุดม", "นาจะหลวย", "น้ำยืน", "บุณฑริก", "ตระการพืชผล", "กุดข้าวปุ้น", "ท่าช้าง", "อินทร์บุรี", "มโนรมย์", "วัดสิงห์", "สรรพยา", "สรรคบุรี", "หันคา", "หนองมะโมง", "เนินขาม", "แก่งคอย", "หนองแค", "วิหารแดง", "หนองแซง", "บ้านหมอ", "ดอนพุด", "หนองโดน", "พระพุทธบาท", "เสาไห้", "มวกเหล็ก", "วังม่วง", "บ้านบึง", "หนองใหญ่", "บางละมุง", "พานทอง", "พนัสนิคม", "ศรีราชา", "เกาะสีชัง", "สัตหีบ", "บ่อทอง", "เกาะจันทร์", "บางเสร่", "แหลมฉบัง", "บ้างฉาง", "บ้านฉาง", "แกลง", "วังจันทร์", "บ้านค่าย", "ปลวกแดง", "เขาชะเมา", "นิคมพัฒนา", "มาบข่า", "ขลุง", "ท่าใหม่", "โป่งน้ำร้อน", "มะขาม", "แหลมสิงห์", "สอยดาว", "แก่งหางแมว", "นายายอาม", "เขาคิชฌกูฏ", "กำพุธ", "คลองใหญ่", "เขาสมิง", "บ่อไร่", "แหลมงอบ", "เกาะกูด", "เกาะช้าง", "บางคล้า", "บางน้ำเปรี้ยว", "บางปะกง", "บ้านโพธิ์", "พนมสารคาม", "ราชสาส์น", "สนามชัย", "แปลงยาว", "ท่าตะเกียบ", "คลองเขื่อน", "กบินทร์บุรี", "กาบัง", "เวียงเก่า"); // เพิ่มคำเฉพาะได้ที่นี่

			$min_pos_i = strlen($dataIn);
			$pos_i = 0;
			$i_ord = 0;
			$ret_len = strlen($dataIn);
	
			$mypatt = implode("|", $specword);
			if (preg_match("/($mypatt)/",$dataIn,$match)) {
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			} 
			$mypatt = implode("|", $pvword);
			if (preg_match("/($mypatt)/",$dataIn,$match)) {
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			} 
			$mypatt = implode("|", $amword);
			if (preg_match("/($mypatt)/",$dataIn,$match)) {
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			} 
			if (preg_match("/(เ([ก-ฮ])(ร|ม)?าะ(ห์)?)/",$dataIn,$match)) { // // เคราะห์ เหมาะ เจาะ เกาะ เอาะ เลาะห์
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			} 
			if (preg_match("/(มา(?:ก|ย|ตรการ|ตรา|ตุภูมิ|ชิก))/",$dataIn,$match)) { // 
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			}
			if (preg_match("/(เ([ก-ฮ])ี([่|้|๊|๋])?ยง)/",$dataIn,$match)) { // เกียง เอี้ยง เมี่ยง เสี่ยง 
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			}
			if (preg_match("/(เ([ก-ฮ])ื([่|้|๊|๋])?อ([ง|น]))/",$dataIn,$match)) { // เมือง เนื่อง เอื้อง เรือง เลื่อน เดือน
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			}
			if (preg_match("/((เ|แ)([ก-ฮ])([งลรว])?([่|้|๊|๋|็|ิ|ี|ึ|ื])?([ง|ว|อ]))/",$dataIn,$match)) { // เกลือ แกง แฮง แรง แกล้ง แผลง แดง แวง แตง แหว่ง แกร่ง แฝง แสลง แกร๊ง แกล้ว
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			} 
			if (preg_match("/(เ([ก-ฮ])([่|้|๊|๋])า)/",$dataIn,$match)) { // เข้า เจ้า เจ่า เช้า เก่า เม่า เล่า
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			}
			if (preg_match("/([ก-ฮ][่|้|๊|๋])อน/",$dataIn,$match)) {  // ช้อน ค้อน ร้อน ซ้อน ซ่อน ค่อน ป้อน 
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			} 
			if (preg_match("/(ม(?:ี|ัน|ือ))/",$dataIn,$match)) { // มือ มัน มือ
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			}
			if (preg_match("/([ก-ฮ]ื([่|้|๊|๋])?อ)/",$dataIn,$match)) { // ชื่อ ซื้อ คือ สื่อ ดื้อ มื้อ หือ อื้อ
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			}
			if (preg_match("/([ก-ฮ]ั([่|้|๊|๋])?([ง|ก|บ|น|ด]))/",$dataIn,$match)) { // ตั้ง ตั่ง กั๊ง กั๊ก สัก มัก มั้ง มั๊ย ขัย ปั๊บ รับ นั้น มัน จัด ขัด นัด
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			}
			if (preg_match("/(โ[ก-ฮ]([่|้|๊|๋])?([ง|ก|บ|น|ด]))/",$dataIn,$match)) { // โกง โด่ง โดด โฉด โชค โมก โก่ง โข่ง โค้ง โจ๊ง โด๊บ
				$pos_i = strpos($dataIn, $match[0]);
				if ($pos_i < $min_pos_i) {
					$min_pos_i = $pos_i;
					$ret_len = strlen($match[0]);
				}
			}

			if ($min_pos_i==$ret_len && $ret_len==strlen($dataIn)) {
				$min_pos_i = 0;
			}
			$ch = substr($dataIn,$min_pos_i+$ret_len,1);
			if (strpos("ะาิีึืุูำ่้๊๋ั็",$ch) !== false) { // ถ้าถัดไป เป็นตัวที่ต้องมีอักษรนำ ให้บวกไปด้วย
				$ret_len++;
			} else {
				$ch = substr($dataIn,$min_pos_i+$ret_len+1,1);
				if (strpos("เแโใไ",$ch) !== false) { // ถ้าตัวถัดไปอีก 1 ตัว เป็นตัวนำ เอาตัวก่อนหน้าไปด้วย
					$ret_len++;
				}		
			}
			$spec_ch = array("|", " ", ".", ",", ")");
			$min_spec_ch = 999999;
			$seltext = substr($dataIn,0,$min_pos_i+$ret_len);
//			echo "seltext=[$seltext]<br>";
			for($jj = 0; $jj < count($spec_ch); $jj++) {
				$spec_ch_i = strpos($seltext, $spec_ch[$jj]);
//				echo "spec_ch[$spec_ch_i] < min_spec_ch[$min_spec_ch]<br>";
				if ($spec_ch_i !== false && $spec_ch_i < $min_spec_ch) {
					$min_spec_ch = $spec_ch_i;
				}
			}
			if ($min_spec_ch == 999999)  $min_spec_ch = -1;
			if ($min_spec_ch >= 0) {
//				echo "min_spec_ch[$min_spec_ch] < min_pos_i[$min_pos_i] + ret_len[$ret_len]<br>";
				if ($min_spec_ch < $min_pos_i + $ret_len) {
					$min_pos_i=0;
					$ret_len = $min_spec_ch+1;
				}
			}
//			echo "cut text = [".substr($dataIn,$min_pos_i,$ret_len)."]<br>";
//			echo "cut text = [".substr($dataIn,$min_pos_i,$ret_len)."]($min_pos_i,$ret_len)<br>";
			return $min_pos_i+$ret_len;
		} // end function

		function thaiCutLinePDF($dataIn, $w, $delim){
			$vowels = array("<br>", "<BR>", "<Br>", "<br />", "<BR />", "<Br />", "<br/>", "<BR/>", "<Br/>", "\n");
			$tempdataIn = str_replace($vowels, "|", $dataIn); // แล้วค่อยเอา $delim มาแทนทีหลัง เพื่อตัดปัญหา \n ไม่นับจำนวนใน string
			$tempdataIn = trim($tempdataIn);
			if (substr($tempdataIn,strlen($tempdataIn)-1)=="|") 
				$tempdataIn = substr($tempdataIn,0,strlen($tempdataIn)-1);
//			echo "$tempdataIn<br>";
			$midch_cnt=0;
			$i = 0;
			$ctext = "";
			$out = "";
			while (strlen($tempdataIn) > 0) {
				$ch = substr($tempdataIn,$i,1);
				if (strpos( "ิีึืุูํ่้๊๋็ํ์ั", $ch) === false) { // ถ้าเป็นอักษรแถวกราง (ไม่เป็นอักษรยก   ิ  ี  ื  ึ  ุ  ู  ํ  ่  ้  ๊  ๋  ั  ็)
					$mylen = $this->thaiWrapPDF($tempdataIn, $delim);
					$text1 = substr($tempdataIn,0,$mylen);
//					echo "after cut = [$text1]<br>";
					$cnt_up=0;
					for($ii=0; $ii < strlen($text1); $ii++) {
						$ch1=substr($text1,$ii,1);
						if (strpos( "ิีึืุูํ่้๊๋ั็์ั", $ch1) > -1) { // เป็นอักษรยก   ิ  ี  ื  ึ  ุ  ู  ํ  ่  ้  ๊  ๋  ั  ็
							$cnt_up++;
						}
					}
					$mylen1 = $mylen - $cnt_up;
					$str_w = $this->GetStringWidth("$ctext"."$text1");
//					echo "$str_w > ".($w-1)." [$text1]<br>";
					if ($str_w > $w - 1) {
//						echo "****1.$ctext<br>";
						$out = "$out".$ctext."$delim";
						$ctext=$text1;
						$tempdataIn = substr($tempdataIn,$mylen);
						$midch_cnt=$mylen1;
					} else { // <= $n
						$delim_pos = strpos($text1,"|");
						if ($delim_pos !== false) {
							$ctext = "$ctext"."$text1";
//							echo "****2.$ctext<br>";
							$out = "$out".$ctext;
							$ctext="";
							$tempdataIn = substr($tempdataIn,$mylen);
							$midch_cnt=0;
						} else {
							$ctext = "$ctext"."$text1";
							$tempdataIn = substr($tempdataIn,$mylen);
							$midch_cnt = $midch_cnt + $mylen1;
						}
					}
					$i=-1;
				} // end if ch
				$i++;
			} // end loop while
//			echo "****3.$ctext<br>";
			$out = "$out".trim((substr($ctext,strlen($ctext)-1)=="|"?substr($ctext,0,strlen($ctext)-1):$ctext));
			$out = str_replace("|",$delim,$out);
			return $out; 
		} // end function
}
?>