<?
//	fix head for rpt_R004007

	$heading_width[0] = 25;
	$heading_width[1] = 25;
	$heading_width[2] = 8;		
	$heading_width[3] = 25;
	$heading_width[4] = 8;
	$heading_width[5] = 5;
	$heading_width[6] = 10;
	if ($SURVEY_NO==3) {
		$heading_width[7] = 5;
		$col = 7;
	} elseif ($SURVEY_NO==4) {
		$col = 6;
	}
	$heading_width[$col+1] =  10;
	$heading_width[$col+2] = 10;
	$heading_width[$col+3] = 12;
	$heading_width[$col+4] = 12;
	$heading_width[$col+5] = 8;
	$heading_width[$col+6] = 8;

	$heading_text[0] = "<**1**>การกำหนดตำแหน่งและจัดข้าราชการ ตาม พรบ.|<**1**>ระเบียบข้าราชการพลเรือน พ.ศ.2535 (ก่อน 11 ธันวาคม 2551)|ชื่อตำแหน่งในสายงาน|(ระดับ 7 หรือ 7ว)|||";
	$heading_text[1] = "<**1**>การกำหนดตำแหน่งและจัดข้าราชการ ตาม พรบ.|<**1**>ระเบียบข้าราชการพลเรือน พ.ศ.2535 (ก่อน 11 ธันวาคม 2551)|ชื่อ-นามสกุล|ผู้ดำรงตำแหน่ง|(1)||";
	$heading_text[2] = "<**1**>การกำหนดตำแหน่งและจัดข้าราชการ ตาม พรบ.|<**1**>ระเบียบข้าราชการพลเรือน พ.ศ.2535 (ก่อน 11 ธันวาคม 2551)|ตำแหน่ง|เลขที่|||";
	$heading_text[3] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|ชื่อตำแหน่งในสายงาน|||";
	$heading_text[4] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|ตำแหน่ง|เลขที่||";
	if ($SURVEY_NO==3) {
		$heading_text[5] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|<**4**>ระดับตำแหน่ง|ชพ||";
		$heading_text[6] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|<**4**>ระดับตำแหน่ง|วันที่แต่งตั้ง|ให้ดำรง|ตำแหน่ง ชพ";
		$heading_text[7] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|<**4**>ระดับตำแหน่ง|ชก||";
		$heading_width[7] = 5;
	} elseif ($SURVEY_NO==4) {
		$heading_text[5] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|<**4**>ระดับตำแหน่ง|อว||";
		$heading_text[6] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|<**4**>ระดับตำแหน่ง|วันที่แต่งตั้ง|ให้ดำรง|ตำแหน่ง อว";
	}
	$heading_text[$col+1] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|ส่วนกลาง|||";
	$heading_text[$col+2] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|ส่วนกลางตั้ง|ในภูมิภาค||";
	$heading_text[$col+3] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|ส่วนภูมิภาค|(จังหวัด/อำเภอ)||";
	$heading_text[$col+4] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|อื่น ๆ|(โปรดระบุ)||";
	$heading_text[$col+5] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|<**5**>การเกษียณอายุราชการ|ปี พ.ศ.|ที่จะเกษียณ|";
	$heading_text[$col+6] = "<**2**>ดำรงตำแหน่ง / ประเภท / ระดับ|<**2**>(ตั้งแต่วันที่ 11 ธันวาคม 2557)|<**3**>ผู้ดำรงตำแหน่งตาม (1) ปัจจุบันดำรงตำแหน่งในสายงานใด / ระดับใด / เกษียณอายุปีใด หรือ เกษียณอายุไปแล้ว|<**5**>การเกษียณอายุราชการ|เกษียณ|ไปแล้ว|";

	// function ประเภท aggregate มี  SUM, AVG, PERC ตามแนวบรรทัด (ROW)
	// 									SUM-columnindex1-columnindex2-....  Ex SUM-1-3-4-7 หมายถึง ผลรวมของ column ที่ 1,3,4 และ 7
	// 									AVG-columnindex1-columnindex2-....  Ex AVG-1-3-4-7 หมายถึง ค่าเฉลี่ยของ column ที่ 1,3,4 และ 7
	// 									PERCn-columnindex1-columnindex2-....  Ex PERCn-1-3-4-7 n คือ column ที่ เป็นเป้าหมายเปรียบเทียบร้อยละ (ค่า 1 ค่า ใน column 1 3 4 7) 
	//																												ถ้าไม่ใส่ค่า n ก็คือ ค่าสรุป (100%) PERC3-1-3-4-7 ก็คือ ค่าใน column ที่ 3 เป็นร้อยละเท่าใดของผลรวม column 1,3,4,7
	//	function ประเภท รูปแบบ (format) ซึ่งจะต้องตามหลัง function ประเภท aggregate เสมอ (ถ้ามี)
	//									TNUM-n คือ เปลี่ยนเป็นตัวเลขของไทย n คือ จำนวนทศนิยม ถ้ามีค่าเป็น ศูนย์ จะแสดงเป็น -
	//									TNUM0-n คือ เปลี่ยนเป็นตัวเลขของไทย n คือ จำนวนทศนิยม ถ้ามีค่าเป็น ศูนย์ จะแสดงเป็น 0
	//									ENUM-n คือ แสดงเป็นเลขอาราบิค n คือ จำนวนทศนิยม ถ้ามีค่าเป็น ศูนย์ จะแสดงเป็น -
	//									ENUM0-n คือ แสดงเป็นเลขอาราบิค n คือ จำนวนทศนิยม ถ้ามีค่าเป็น ศูนย์ จะแสดงเป็น 0
	//
	$column_function[0] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
	$column_function[1] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM"); 
	$column_function[2] = (($NUMBER_DISPLAY==2)?"TNUM-x":"ENUM-x");
	$column_function[3] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
	$column_function[4] = (($NUMBER_DISPLAY==2)?"TNUM-x":"ENUM-x");
	$column_function[5] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
	$column_function[6] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
	if ($SURVEY_NO==3) {
		$column_function[7] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
		$col = 7;
	} elseif ($SURVEY_NO==4) {
		$col = 6;
	}
	$column_function[$col+1] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
	$column_function[$col+2] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
	$column_function[$col+3] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
	$column_function[$col+4] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
	$column_function[$col+5] = (($NUMBER_DISPLAY==2)?"TNUM-x":"ENUM-x");
	$column_function[$col+6] = (($NUMBER_DISPLAY==2)?"TNUM":"ENUM");
	
	$heading_align = array("C","C","C","C","C","C","C","C","C","C","C","C","C","C");

	$data_align = array("L", "L", "C", "L", "C", "C", "C", "C", "C", "C", "C", "C", "C", "C");

	$total_head_width = 0;
	for($iii=0; $iii < count($heading_width); $iii++) 	$total_head_width += (int)$heading_width[$iii];
	
	if (!$COLUMN_FORMAT) {	// ต้องกำหนดเป็น element ให้อยู่ใน form1 ด้วย  <input type="hidden" name="COLUMN_FORMAT" value="<?=$COLUMN_FORMAT
		$arr_column_map = (array) null;
		$arr_column_sel = (array) null;
		for($i=0; $i < count($heading_text); $i++) {
			$arr_column_map[] = $i;		// link index ของ head 
			$arr_column_sel[] = 1;			// 1=แสดง	0=ไม่แสดง   ถ้าไม่มีการปรับแต่งรายงาน ก็เป็นแสดงหมด
		}
		$arr_column_width = $heading_width;	// ความกว้าง
		$arr_column_align = $data_align;		// align
		$COLUMN_FORMAT = implode(",",$arr_column_map)."|".implode(",",$arr_column_sel)."|".implode(",",$arr_column_width)."|".implode(",",$arr_column_align);
	} else {
		$arrbuff = explode("|",$COLUMN_FORMAT);
		$arr_column_map = explode(",",$arrbuff[0]);		// index ของ head เริ่มต้น
		$arr_column_sel = explode(",",$arrbuff[1]);	// 1=แสดง	0=ไม่แสดง
		$arr_column_width = explode(",",$arrbuff[2]);	// ความกว้าง
		$heading_width = $arr_column_width;	// ความกว้าง
		$arr_column_align = explode(",",$arrbuff[3]);		// align
	}
	
	$total_show_width = 0;
	for($iii=0; $iii < count($arr_column_width); $iii++) 	if ($arr_column_sel[$iii]==1) $total_show_width += (int)$arr_column_width[$iii];

?>