10109     	นักบริหาร
10208     	ผู้ตรวจราชการ
10403     	เจ้าพนักงานปกครอง
10501     	เจ้าหน้าที่ปกครอง
10512     	พนักงานปกครอง
10525     	เจ้าหน้าที่บริหารงานปกครอง
10703     	เจ้าหน้าที่วิเคราะห์นโยบายและแผน
10903     	เจ้าหน้าที่วิเคราะห์งานบุคคล
11003     	เจ้าหน้าที่ระบบงานคอมพิวเตอร์
11013     	นักวิชาการคอมพิวเตอร์
11103     	เจ้าหน้าที่บริหารงานทั่วไป
11403     	บุคลากร
11601     	เจ้าหน้าที่ธุรการ
11612     	เจ้าพนักงานธุรการ
11624     	เจ้าหน้าที่บริหารงานธุรการ
11701     	เจ้าหน้าที่พัสดุ
11712     	เจ้าพนักงานพัสดุ
11723     	นักวิชาการพัสดุ
11734     	เจ้าหน้าที่บริหารงานพัสดุ
11801     	เจ้าหน้าที่บันทึกข้อมูล
11901     	เจ้าหน้าที่พิมพ์ดีด
12201     	เจ้าหน้าที่สถิติ
12212     	เจ้าพนักงานสถิติ
12223     	นักสถิติ
12234     	เจ้าหน้าที่บริหารงานสถิติ
12301     	เจ้าหน้าที่เวชสถิติ
12403     	นิติกร
13003     	เจ้าหน้าที่วิเทศสัมพันธ์
13403     	เจ้าหน้าที่วินัย
13503     	นักวิจัยการจราจร
20103     	นักวิชาการคลัง
20201     	เจ้าหน้าที่การคลัง
20212     	เจ้าพนักงานการคลัง
20224     	เจ้าหน้าที่บริหารงานการคลัง
20303     	นักบัญชี
20401     	เจ้าหน้าที่การเงินและบัญชี
20412     	เจ้าพนักงานการเงินและบัญชี
20423     	นักวิชาการเงินและบัญชี
20435     	เจ้าหน้าที่บริหารงานการเงินและบัญชี
20603     	เจ้าหน้าที่ตรวจสอบภายใน
20801     	เจ้าหน้าที่ตรวจสอบบัญชี
20812     	เจ้าพนักงานตรวจสอบบัญชี
20823     	นักวิชาการตรวจสอบบัญชี
20834     	เจ้าหน้าที่บริหารงานตรวจสอบบัญชี
20903     	เจ้าหน้าที่วิเคราะห์งบประมาณ
21003     	นักวิชาการภาษี
21703     	เจ้าหน้าที่ตรวจสอบภาษี
22901     	เจ้าหน้าที่จัดเก็บรายได้
22912     	เจ้าพนักงานจัดเก็บรายได้
22923     	นักวิชาการจัดเก็บรายได้
22934     	เจ้าหน้าที่บริหารงานจัดเก็บรายได้
24003     	นักวิชาการละครและดนตรี
26203     	นักวิชาการวัฒนธรรม
31201     	เจ้าหน้าที่สื่อสาร
31303     	นักพัฒนาการท่องเที่ยว
31801     	เจ้าหน้าที่ประชาสัมพันธ์
31813     	นักประชาสัมพันธ์
31824     	เจ้าหน้าที่บริหารงานประชาสัมพันธ์
31902     	เจ้าพนักงานประชาสัมพันธ์
32501     	เจ้าหน้าที่โสตทัศนศึกษา
32512     	เจ้าพนักงานโสตทัศนศึกษา
32523     	นักวิชาการโสตทัศนศึกษา
32535     	เจ้าหน้าที่บริหารงานโสตทัศนศึกษา
40103     	นักวิชาการเกษตร
40401     	เจ้าหน้าที่การเกษตร
40412     	เจ้าพนักงานการเกษตร
40424     	เจ้าหน้าที่บริหารงานการเกษตร
50103     	นักวิทยาศาสตร์
50201     	เจ้าหน้าที่วิทยาศาสตร์
50212     	เจ้าพนักงานวิทยาศาสตร์
60104     	นายแพทย์
60200     	จพง.ทันตสาธารณสุข2-4/ผู้ช่วยทันตแพทย์1-3
60204     	ทันตแพทย์
60290     	จพง.ทันตฯ2-4/5/6/ผช.ทันตแพทย์1-3/4/5
60304     	นายสัตวแพทย์
60403     	นักวิทยาศาสตร์การแพทย์
60503     	นักเทคนิคการแพทย์
60603     	เภสัชกร
60801     	โภชนากร
60813     	นักโภชนาการ
60823     	นักโภชนาวิทยา
61203     	นักจิตวิทยา
61303     	นักวิชาการสุขศึกษา
61403     	นักวิชาการสุขาภิบาล
61502     	พยาบาลเทคนิค
61514     	นักวิชาการพยาบาล
61523     	พยาบาลวิชาชีพ
61601     	เจ้าหน้าที่พยาบาล
61690     	พยาบาลเทคนิค2-4/5/จ.พยาบาล1-3/4
61691     	เจ้าหน้าที่พยาบาล 1-3/4/5
61692     	พยาบาลเทคนิค2-4/5/6/จ.พยาบาล1-3/4/5
61702     	เจ้าหน้าที่เอ็กซ์เรย์
61712     	เจ้าหน้าที่รังสีการแพทย์
61723     	นักรังสีการแพทย์
61803     	นักกายภาพบำบัด
61903     	นักอาชีวบำบัด
62002     	ทันตานามัย
62102     	สัตวแพทย์
62201     	เจ้าหน้าที่วิทยาศาสตร์การแพทย์
62212     	เจ้าพนักงานวิทยาศาสตร์การแพทย์
62290     	จพง.ว.การแพทย์2-4/5/6/จ.ว.การแพทย์1-3/4ฯ
62291     	จพง.ว. การแพทย์ 2-4/จ.ว. การแพทย์ 4
62301     	ผู้ช่วยเภสัชกร
62312     	เจ้าพนักงานเภสัชกรรม
62390     	จพง.เภสัชกรรม2-4/5/6/ผช.เภสัชกร1-3/4/5
62391     	จพง.เภสัชกรรม2-4/5/ผู้ช่วยเภสัชกร1-3/4
62403     	เจ้าหน้าที่เวชภัณฑ์
62503     	นักวิชาการสาธารณสุข
62514     	เจ้าหน้าที่บริหารงานสาธารณสุข
62601     	ผู้ช่วยทันตแพทย์
62701     	เจ้าหน้าที่กายภาพบำบัด
62713     	นักอาชีวอนามัย
62802     	เจ้าพนักงานทันตสาธารณสุข
62903     	พยาบาลเวชปฏิบัติ
63001     	เจ้าหน้าที่ส่งเสริมสุขภาพ
63012     	เจ้าพนักงานส่งเสริมสุขภาพ
63023     	นักวิชาการส่งเสริมสุขภาพ
63031     	เจ้าหน้าที่อนามัย
63090     	เจ้าพนักงานส่งเสริมสุขภาพ 2-4/5/6
63101     	เจ้าหน้าที่ควบคุมโรค
63112     	เจ้าพนักงานควบคุมโรค
63123     	นักวิชาการควบคุมโรค
63131     	เจ้าหน้าที่งานรักษาความสะอาด
63202     	เจ้าพนักงานสาธารณสุข
70103     	วิศวกร
70203     	วิศวกรโยธา
70291     	-
70403     	วิศวกรเครื่องกล
70490     	วิศวกรเครื่องกล/ไฟฟ้า
70491     	วิศวกรเครื่องกล/ไฟฟ้า/สุขาภิบาล
70503     	วิศวกรไฟฟ้า
70590     	วิศวกรไฟฟ้า/วิศวกรโยธา
70603     	สารวัตรศึกษา
71401     	ช่างโยธา
71412     	นายช่างโยธา
71601     	ช่างสำรวจ
71612     	นายช่างสำรวจ
71901     	ช่างเครื่องกล
71912     	นายช่างเครื่องกล
72901     	เจ้าหน้าที่เครื่องคอมพิวเตอร์
73001     	ช่างไฟฟ้า
73012     	นายช่างไฟฟ้า
73501     	ช่างเทคนิค
73512     	นายช่างเทคนิค
73803     	สถาปนิก
74001     	เจ้าหน้าที่ป้องกันและบรรเทาสาธารณภัย
74003     	มัณฑนกร
74102     	พนักงานป้องกันและบรรเทาสาธารณภัย
74203     	เจ้าพนักงานป้องกันและบรรเทาสาธารณภัย
74301     	ช่างเขียนแบบ
74306     	เจ้าหน้าที่บริหารงานป้องกันและบรรเทาสาธารณภัย
74312     	นายช่างเขียนแบบ
74401     	ช่างศิลป์
74412     	นายช่างศิลป์
74423     	นักวิชาการช่างศิลป์
74901     	ช่างภาพ
74912     	นายช่างภาพ
75003     	ช่างภาพการแพทย์
75105     	ช่างกายอุปกรณ์
75505     	เจ้าหน้าที่บริหารงานโยธา
75603     	วิศวกรสุขาภิบาล
75703     	นักวิชาการแผนที่
75801     	เจ้าหน้าที่แผนที่
80103     	นักวิชาการศึกษา
80203     	นักวิชาการสอบ
80402     	วิทยาจารย์
80513     	นักวิชาการศึกษาพิเศษ
80603     	เจ้าหน้าที่ฝึกอบรม
80902     	เจ้าหน้าที่พลศึกษา
80990     	เจ้าหน้าที่พลศึกษา (วุฒิทางวิทยาศาสตร์การกีฬา)
81303     	บรรณารักษ์
81501     	เจ้าหน้าที่ห้องสมุด
81512     	เจ้าพนักงานห้องสมุด
82201     	ดุริยางคศิลปิน
82290     	ดุริยางคศิลปินหรือคีตศิลปิน
82291     	ดุริยางคศิลปิน (นักดนตรี)
82292     	ดุริยางคศิลปิน (เจ้าหน้่าที่โฆษกและตลก)
82293     	ดุริยางคศิลปิน (นักแต่งเพลง)
82294     	ดุริยางคศิลปิน (นักแยกเพลง)
82295     	ดุริยางคศิลปิน (เจ้าหน้าที่เขียนเพลง)
82301     	คีตศิลปิน
82390     	คีตศิลปิน (นักร้อง)
82903     	นักสังคมสงเคราะห์
83403     	เจ้าหน้าที่วิเคราะห์ผังเมือง
83503     	นักผังเมือง
83701     	เจ้าหน้าที่พัฒนาชุมชน
83712     	เจ้าพนักงานพัฒนาชุมชน
83723     	นักพัฒนาชุมชน
83734     	เจ้าหน้าที่บริหารงานพัฒนาชุมชน
84003     	นักวิชาการสิ่งแวดล้อม
84203     	เจ้าหน้าที่จัดหาที่ดิน
84404     	ศึกษานิเทศก์
84504     	เจ้าหน้าที่บริหารการศึกษา
84512     	เจ้าพนักงานการศึกษา
84521     	เจ้าหน้าที่การศึกษา
84601     	เจ้าหน้าที่ศูนย์เยาวชน
84602     	เจ้าหน้าที่ศูนย์เยาวชน (ผู้นำกิจกรรมศิลปะ)
84603     	เจ้าหน้าที่ศูนย์เยาวชน (ผู้นำกิจกรรมคหกรรมศาสตร์)
84604     	เจ้าหน้าที่ศูนย์เยาวชน (ผู้นำกิจกรรมนาฏศิลป์)
84605     	เจ้าหน้าที่ศูนย์เยาวชน (ผู้นำกิจกรรมห้องสมุด)
84612     	เจ้าพนักงานศูนย์เยาวชน
84613     	เจ้าพนักงานศูนย์เยาวชน (ผู้นำกิจกรรมพลศึกษา)
84614     	เจ้าพนักงานศูนย์เยาวชน (ผู้นำกิจกรรมศิลปะ)
84615     	เจ้าพนักงานศูนย์เยาวชน (ผู้นำกิจกรรมคหกรรมศาสตร์))
84616     	เจ้าพนักงานศูนย์เยาวชน (ผู้นำกิจกรรมนาฏศิลป์)
84617     	เจ้าพนักงานศูนย์เยาวชน (ผู้นำกิจกรรมห้องสมุด)
84623     	นักวิชาการศูนย์เยาวชน
84624     	นักวิชาการศูนย์เยาวชน (ผู้นำกิจกรรมพลศึกษา)
84625     	นักวิชาการศูนย์เยาวชน (ผู้นำกิจกรรมศิลปะ)
84626     	นักวิชาการศูนย์เยาวชน (ผู้นำกิจกรรมคหกรรมศาสตร์)
84627     	นักวิชาการศูนย์เยาวชน (ผู้นำกิจกรรมนาฏศิลป์)
84628     	นักวิชาการศูนย์เยาวชน (ผู้นำกิจกรรมห้องสมุด)
84635     	เจ้าหน้าที่บริหารงานศูนย์เยาวชน
84903     	เจ้าหน้าที่ผังเมือง
99901     	พนักงานโทรศัพท์
99902     	นักการ
99903     	พนักงานขับรถยนต์
99904     	คนซักฟอก
99905     	คนครัว
99906     	ภารโรง
99907     	คนใช้
99908     	คนยาม
99909     	พนักงานขับรถบด
99910     	พนักงานขับรถแทรกเตอร์
99911     	นายท้ายเรือยนต์
99912     	ผู้ช่วยพยาบาล
