<?	
	include("php_scripts/session_start.php");
	include("php_scripts/function_share.php");
	include("php_scripts/load_per_control.php");

	$db_dpis1 = new connect_dpis($dpisdb_host, $dpisdb_name, $dpisdb_user, $dpisdb_pwd);
	$db_dpis2 = new connect_dpis($dpisdb_host, $dpisdb_name, $dpisdb_user, $dpisdb_pwd);
	$CREATE_DATE = "NOW()";
	$UPDATE_DATE = date("Y-m-d H:i:s");

	if( $command=='ALTER' ) {
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(1, 1, '101', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานตามหน้าที่ความรับผิดชอบของแต่ละบุคคล แต่มีการกำหนดเวลาการส่งมอบงานในแต่ละงานอย่างชัดเจน
ส่งเสริมและเปิดโอกาสให้บุคลากรได้แสดงความคิดเห็นหรือข้อเสนอแนะต่างๆ เพิ่มเติมที่เกี่ยวข้องกับหน้าที่ความรับผิดชอบ เพื่อส่งเสริมให้สามารถพัฒนางานของตนให้ดียิ่งขึ้นไปได้
ส่งเสริมและเปิดโอกาสให้บุคลากรได้แสดงความคิดเห็นว่าตนเองจะสามารถสร้างคุณค่าและประโยชน์ที่ดีให้แก่งานและองค์กรได้อย่างไร และมอบหมายงานนั้นๆ ตามความสนใจของแต่ละบุคคล
มอบหมายงานที่มีลักษณะเป็นเป้าหมายระยะสั้นและสามารถติดตามผล เปรียบเทียบความก้าวหน้าได้ พร้อมทั้งได้รับคำติชมเกี่ยวกับผลงานในทันที
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องวิธีการการทำงานให้ได้ตามมาตรฐานของงานและมาตรฐานขององค์กร
การฝึกอบรม
Time Management', 'ชื่อหลักสูตรการฝึกอบรม: Time Management 
วัตถุประสงค์
เพื่อให้ผู้ฝึกอบรมมีกรอบความคิด เรื่องการบริหารจัดการเวลา 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดในการบริหารจัดการเวลาและประโยชน์ของการบริหารจัดการเวลา
ข้อผิดพลาดต่างๆ ที่ทำให้เสียเวลา (การบริหารเหตุไม่คาดหวัง (Crisis) การรบกวนโดยโทรศัพท์ การไม่วางแผนล่วงหน้า การแบ่งงาน การไม่วินัยต่อตนเอง ความไม่สามารถที่จะปฏิเสธ การบริหารจัดการการประชุม การบริหารงานเอกสาร (Paperwork) การสื่อสารที่ไม่ดี เป็นต้น)
กระบวนการและเทคนิคในการแก้ไขข้อผิดพลาดเพื่อให้สามารถบริหารจัดการเวลาได้อย่างมีประสิทธิภาพสูงสุด
ระยะเวลาของหลักสูตร
8 ชั่วโมง
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถบริหารจัดการเวลาได้มากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(2, 2, '101', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้รับผิดชอบงานใหม่ๆ ที่แตกต่างจากงานปกติ และติดตามประเมินผลงานให้ได้ตามเป้าหมายและมาตรฐานที่องค์กรกำหนด
สนับสนุนและเปิดโอกาสให้บุคลากรได้แสดงความคิดเห็นและเสนอวิธีการใหม่ๆ ในการทำงานเพื่อปรับปรุงงานของตนให้ได้งานที่ดีขึ้น
มอบหมายงานหรือโครงการให้รับผิดชอบที่ต้องเน้นการติดตามและประเมินผลงานทุกขั้นตอน และ/หรือต้องการผลงานหรือผลลัพธ์อย่างเร่งด่วน 
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการกำหนดเป้าหมาย และมาตรฐานของผลงาน
สอนงานด้านการติดตามและประเมินผลงานหรือประเมินผลโครงการ
การฝึกอบรม
การตั้งเป้าหมาย (Goal Setting)', 'ชื่อหลักสูตรการฝึกอบรม: การตั้งเป้าหมาย
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจกระบวนการในตั้งเป้าหมายที่มีประสิทธิภาพในงานของตนที่สอดคล้องกับแผนยุทธศาสตร์ของหน่วยงาน และภาระหน้าที่รับผิดชอบของตน
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
การกำหนดเป้าหมายการทำงานที่มีประสิทธิภาพ
การวางแผนกระบวนการทำงานให้สอดคล้องกับเป้าหมาย
การประสานความร่วมมือเพื่อให้เกิดผลสัมฤทธิ์สูงสุด
การติดตามและปรับปรุงพัฒนาเพื่อให้ได้เป้าหมายที่มีประสิทธิภาพมากขึ้น
มีกิจกรรมและ Case Study ตลอดการฝึกอบรมเพื่อให้ผู้รับการฝึกอบรมเข้าใจในกรอบแนวคิด ทฤษฎี และวิธีการนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(3, 3, '101', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้รับผิดชอบงานใหม่ๆ ที่แตกต่างจากงานปกติ และมีความท้าทายในงานมากขึ้น 
มอบหมายงานหรือหมุนเวียนงานให้เป็นผู้นำโครงการใหม่ๆ หรืองานที่เกี่ยวข้องกับการปรับปรุงและเปลี่ยนแปลงระบบ และวิธีการทำงานให้มีคุณภาพมากขึ้น
มอบหมายงานหรือปรับเปลี่ยนให้ทำงานที่เน้นคุณภาพและมาตรฐานในการทำงานที่สูงขึ้นกว่างานปกติทั่วไป และให้คำติชมและคำแนะนำอย่างสร้างสรรค์และมีประโยชน์อย่างทันที
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการปรับเปลี่นกระบวนการทำงาน และการเปลี่ยนแปลงระบบการทำงาน
การฝึกอบรม
การปรับปรุงกระบวนการทำงาน', 'ชื่อหลักสูตรการฝึกอบรม: การปรับปรุงกระบวนการทำงาน
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจถึงกระบวนการในการปรับปรุงระบบการทำงานให้มีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมสามารถนำเครื่องมือและกระบวนการการปรับปรุงกระบวนงานไปใช้ให้เกิดประโยชน์กับองค์กร
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย 
การบรรยายเพื่อให้เห็นถึงกระบวนการในการปรับปรุงกระบวนการด้วยเครื่องมือต่างๆ เช่น PDCA, Value Analysis, Total Quality Management (TQM) หรือ Six Sigma Process Improvement
กระบวนการในการเก็บข้อมูล วิเคราะห์ ตีความและนำเสนอข้อมูล เพื่อไปปรับปรุงกระบวนงานของหน่วยงาน เช่น การใช้ Pareto Diagrams การใช้ Histograms Run Charts หรือ Force Field Analysis เป็นต้น
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(4, 4, '101', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานหรือหมุนเวียนงานให้รับผิดชอบงานหรือโครงการใหม่ๆที่ท้าทายมากเป็นพิเศษ หรือไม่เคยเกิดขึ้นในองค์กร และต้องอาศัยการลงมือเสี่ยง เช่น เป็นผู้บุกเบิกโครงการใหม่ หรือริเริ่มโครงการลักษณะที่ไม่เคยมีผู้ใดทำได้มาก่อน หรือทำงานในต่างประเทศ เป็นต้น
ลองเปลี่ยนลักษณะความรับผิดชอบ เช่น รับผิดชอบโครงการใหม่ๆ หรือโอนย้ายไปในแผนกอื่นที่มีลักษณะงานแตกต่างไปโดยสิ้นเชิง

การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการบริหารโครงการหรือบริหารจัดการอย่างมืออาชีพ

การฝึกอบรม
Process Re-engineering', 'ชื่อหลักสูตรการฝึกอบรม: Process Re-engineering 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่อง Process Re-engineering
เพื่อให้ผู้เข้าอบรมได้มีโอกาสทดลองปฏิบัติจริง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กระบวนการเก็บข้อมูลเพื่อให้เข้าใจระบบงานเดิม
กระบวนการวิเคราะห์ Outcome Analysis
กระบวนการวิเคราะห์ Technology Analysis
เทคนิคต่างๆ ในการปรับปรุงกระบวนงาน เช่น Activity Elimination Assess Potential Business Value การกำหนดต้นทุน (Determine Project Cost) การกำหนดความเสี่ยง (Determine Risk of Failure)
กระบวนการในการพัฒนาแนวคิดสำหรับระบบงานใหม่และกำหนดสิ่งที่ต้องปรับปรุง (TO BE Approach)
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(5, 5, '101', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานหรือหมุนเวียนงานให้รับผิดชอบงานหรือโครงการใหม่ๆ ที่เน้นพันธกิจหลักที่สำคัญขององค์กร
มอบหมายงานที่มีความท้าทายมากเป็นพิเศษ เป็นไปได้ยากหรือมีเสี่ยงอย่างสูงสุดต่อองค์กร แต่เน้นผลงานที่โดดเด่นที่สุด
มอบหมายงานให้สร้างสรรค์สิ่งใหม่ๆ ให้กับองค์กรแต่เกิดประโยชน์อย่างยั่งยืน
มอบหมายงานที่เน้นการวิเคราะห์ในเชิงผลได้ และผลเสียขององค์กร หรืองานที่ต้องอาศัยความเป็นผู้ประกอบการ เพื่อให้องค์กรหรือประเทศได้รับประโยชน์อย่างสูงสุด
การฝึกอบรม
เทคนิคการตัดสินใจด้วย Game Theory สำหรับผู้บริหารระดับสูง', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการตัดสินใจด้วย Game Theory 
สำหรับผู้บริหารระดับสูง
เพื่อให้ผู้เข้าอบรมมีระบบการตัดสินใจ และการต่อรองทางธุรกิจ ซึ่งจะนำมาซึ่งความได้เปรียบทางธุรกิจ และสามารถคำนวณผลได้ผลเสียได้อย่างชัดเจน
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ทฤษฏีเกมส์ คืออะไร 
การตัดสินใจเชิงกลยุทธ์ 
ศิลปะ และวิทยาศาสตร์ที่เกี่ยวกับกลยุทธ์ 
ทำความเข้าใจ ความขัดแย้ง และความร่วมมือ 
กำหนดน้ำหนักความเสี่ยง 
การอยู่รอดภายในสถานการณ์ที่คลุมเครือ 
การข่มขู่ คำมั่นสัญญา และการตัดสินใจแบบต่อเนื่อง 
อันตรายของการแข่งขันในเรื่องราคา และกลยุทธ์ในการกำหนดราคา 
Game แห่งความร่วมมือ และสมดุลของ Nash 
การสร้างอำนาจการต่อรอง และทฤษฏีเกมส์ กับการ Biding 
การจัดการกับผู้ใต้บังคับบัญชา 
ผู้จัดการเชิงกลยุทธ์ (Strategic Manager)
มีการจำลองสถานการณ์ ทางธุรกิจ และการแลกเปลี่ยนความคิด ประสบการณ์ในลักษณะ Group Discussion
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(6, 1, '102', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้รับผิดชอบงานที่ต้องมีปฏิสัมพันธ์ ติดต่อสื่อสาร หรือให้บริการแก่ผู้รับบริการ หรือผู้ประกอบการโดยตรง
มอบหมายงานให้เข้าไปเป็นส่วนหนึ่งของโครงการหรือกิจกรรมต่างๆ ที่ต้องคอยให้ข้อมูล ให้บริการ หรือคำแนะนำต่างๆ แก่ผู้รับบริการ หรือผู้ประกอบการ 
มอบหมายงานให้รับผิดชอบในการจัดวางระบบใหม่ ติดตามงาน และรายงานความคืบหน้าให้แก่ผู้รับบริการ
หมุนเวียนงานให้ไปรับผิดชอบงานในหน่วยงานที่ต้องทำงานร่วมกับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายภาคีต่างๆ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการสื่อสารที่มีประสิทธิภาพ และการบริการที่ดีแก่ผู้รับบริการ ผู้ประกอบการ หรือผู้อื่น
สอนงานในรายละเอียดถึงวิธีการสร้างความประทับใจให้แก่ผู้รับบริการ ผู้ประกอบการ หรือผู้อื่น
การฝึกอบรม
การสร้างจิตสำนึกในงานบริการผู้รับบริการ', 'ชื่อหลักสูตรการฝึกอบรม: การสร้างจิตสำนึกในงานบริการผู้รับบริการ
วัตถุประสงค์
เพื่อให้เกิดจิตสำนึก และตระหนักถึงความสำคัญในการดำเนินงานและการสื่อสารด้วยรอยยิ้ม 
เพื่อให้เกิดความเต็มใจในการให้บริการ และให้ความช่วยเหลือแก่ผู้รับบริการ 
กรอบเนื้อหาของหลักสูตร
แนวคิดการให้บริการสมัยใหม่
ความคาดหวังและที่มาของความคาดหวังของลูกค้า
ลักษณะของผู้รับบริการที่พอใจในสินค้าและการบริการขององค์กร
หัวใจการบริการ
เทคนิคการติดต่อสื่อสารกับผู้รับบริการ
มาตรฐานการปฏิบัติงานเพื่อสร้างการบริการที่เป็นเลิศ
การบริการก่อน/ระหว่าง/หลังการขาย   
การประเมินความพึงพอใจของผู้รับบริการด้วยดัชนีความพึงพอใจ (Customer Satisfaction Index : CSI)
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(7, 2, '102', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นผู้รับผิดชอบ หรือบทบาทหลักในงานการประสานงานต่างๆ เช่น การจัดการงานประชุม การสัมมนา การประสานงานกิจกรรม หรือโครงการต่างๆ เป็นต้น
มอบหมายงานให้รับผิดชอบงานที่เกี่ยวข้องกับการให้บริการ ข้อมูล หรือผลิตภัณฑ์ต่างๆ ขององค์กรแก่ผู้รับบริการ หรือผู้ประกอบการ เพื่อฝึกความเชี่ยวชาญด้านการให้บริการ หรือผลิตภัณฑ์ต่างๆ ขององค์กร และสามารถให้ข้อมูล ข่าวสาร ของการบริการที่ถูกต้อง ชัดเจนแก่ผู้รับบริการได้ตลอดการให้บริการ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาอย่างละเอียดในเรื่องกระบวนการทำงาน ขั้นตอนการทำงาน การให้บริการและผลิตภัณฑ์ต่างๆ ขององค์กร เพื่อให้สามารถให้คำแนะนำ ข้อมูล หรือการบริการที่ถูกต้อง และชัดเจนแก่ผู้รับบริการ หรือผู้ประกอบการได้
ดูแล แนะนำ ให้คำปรึกษาเรื่องการติดต่อประสานงาน และการติดตามงาน (Follow up) 
การฝึกอบรม
การฟังและการพัฒนาการสื่อสาร
', 'ชื่อหลักสูตรการฝึกอบรม: การฟังและการพัฒนาการสื่อสาร
วัตถุประสงค์
เพื่อให้ตระหนักและเข้าใจผลของการสื่อสารที่บกพร่อง (Error Communication Consequence)
เพื่อให้เกิดการพัฒนา การเปลี่ยนแปลง การสื่อสารให้มีคุณภาพยิ่งขึ้น
เพื่อให้สามารถประยุกต์การสื่อสารที่ดีแก่ลูกค้า เพื่อสร้างความประทับใจ (Customer Delight)  ในการบริการ และต่อองค์กร
เพื่อให้สามารถนำการสื่อสารที่ดีสร้างความเข้าใจ และสัมพันธภาพที่ดีแก่ผู้บริการ เพื่อนร่วมงาน หรือผู้อื่น เพื่อก่อให้เกิดสัมพันธภาพที่ดี ความร่วมมือ และสร้างความประทับใจได้
กรอบเนื้อหาของหลักสูตร
ความจริงเกี่ยวกับการสื่อสาร และการเป็นผู้ฟังที่ดี (Active Listener)
การค้นหาความเข้าใจ และการจำใจความ
สื่อสารอย่างไร ให้ผู้รับสารเข้าใจในสิ่งที่เราสื่อได้อย่างถูกต้อง
ลักษณะบุคลิกภาพของแต่ละคนในการสื่อสาร
การสื่อสารอย่างมีประสิทธิภาพ และการสร้างความประทับใจ
การสื่อสารเพื่อสร้างความสัมพันธ์ที่ดีกับผู้รับบริการ
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(8, 3, '102', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานที่มีลักษณะต้องติดต่อและสร้างสัมพันธ์กับผู้อื่น งานสนับสนุน หรืองานบริการ โดยสามารถวัดผลสัมฤทธิ์ของงานได้จากความพึงพอใจของผู้รับบริการ เครือข่ายภาคี หรือองค์กรพันธมิตรเป็นหลัก
มอบหมายงานให้วางแผนการทำงานร่วมกับผู้บังคับบัญชา หรือเพื่อนร่วมงานของ เพื่อให้บริการที่ดีและทันเวลาแก่ผู้รับบริการ โดยมีการตรวจสอบและประเมินผลความถูกต้อง ความเป็นไปได้ และผลลัพธ์ให้สอดคล้องกับแผนงานที่กำหนดไว้
มอบหมายให้พัฒนาและปรับปรุงกระบวนการทำงาน และการให้บริการภายในหน่วยงาน หรือองค์กรตามที่ผู้รับบริการได้มีข้อติชมมาเพื่อให้ลูกค้าได้รับความพึงพอใจในการรับบริการครั้งต่อๆ ไป
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการปรับรูปแบบการให้บริการที่สอดคล้องกับความต้องการของผู้รับบริการ
แลกเปลี่ยนประสบการณ์ถึงวิธีการแก้ไขปัญหาที่เกิดขึ้นต่างๆ แก่ผู้รับบริการได้อย่างสำเร็จ
การฝึกอบรม
การเข้าใจผู้อื่น', 'ชื่อหลักสูตรการฝึกอบรม: การเข้าใจผู้อื่น
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี รวมทั้งสามารถสื่อสารได้อย่างมีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด หลักการเข้าใจผู้อื่น และอุปสรรคสำคัญต่างๆ รวมทั้งแนวทางในการพัฒนาการเข้าใจผู้อื่น
กรอบเนื้อหาของหลักสูตร
หลักการ ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี และหลักการในจดบันทึกข้อมูลให้ครบถ้วน และเป็นประโยชน์ รวมทั้งหลักการสื่อสารที่มีประสิทธิภาพ
แนวคิดเบื้องต้นเกี่ยวกับภาษาและพฤติกรรมมนุษย์ (Myers-Briggs Type Indicator) เพื่อให้สามารถตอบสนองผู้อื่นและสื่อสารได้อย่างมีประสิทธิภาพสูงสุด
ข้อแนะนำในการพัฒนาการเข้าใจผู้อื่น และการชนะใจคน
เครื่องมือ แนวคิด หลักการของการเข้าใจผู้อื่น อุปสรรคที่สำคัญ และการสร้างความเข้าใจผู้อื่นเกิดขึ้นได้โดย:
การยอมรับอารมณ์ของผู้อื่น และ
การแสดงให้ผู้อื่นเห็นว่าท่านเข้าใจ แม้ว่าท่าน ไม่จำเป็นต้องเห็นด้วยกับคำพูดหรือความรู้สึกของผู้นั้นก็ตาม
การจำลองสถานการณ์จริง และทดลองให้ปฏิบัติ รวมทั้งมีเกมและแบบฝึกหัดเพื่อฝึกการฟัง การสื่อสาร และการเข้าใจผู้อื่น ตลอดจนสรุปผล
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(9, 4, '102', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นลองปฏิบัติงานที่ครอบคลุมการบริการผู้อื่นแบบครบวงจร เช่น งาน CRM หรืองานโครงการต่างๆ ที่มุ่งเน้นความสำเร็จและประโยชน์อย่างสูงสุดของผู้รับบริการ
มอบหมายงานให้ไปทำงานร่วมกับผู้รับบริการในทุกขั้นตอน และกระบวนการทำงาน เพื่อให้มีความรู้และเข้าใจอย่างถ่องแท้ถึงความต้องการที่แท้จริงของผู้รับบริการ เพื่อสามารถให้บริการและสร้างประโยชน์สูงสุดแก่ผู้รับบริการ
การโค้ช (Coaching)
แนะนำหรือแลกเปลี่ยนประสบการณ์ในการทำงานที่ประสบความสำเร็จด้านการให้บริการที่สอดคล้องกับความต้องการอย่างแท้จริงของผู้รับบริการ
การฝึกอบรม
การบริการด้วยใจ (Service Solution)', 'ชื่อหลักสูตรการฝึกอบรม: การบริการด้วยใจ (Service Solution)
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจในกรอบความคิดเรื่อง Customer Service ต่อความสำเร็จขององค์กร และสามารถนำไปใช้ถึงวิธีการคิด และกระบวนการในการบริการลูกค้า
กรอบเนื้อหาของหลักสูตร
ลักษณะของลูกค้าและความสำคัญของการบริการลูกค้า 
กรอบแนวคิดในเรื่องการสร้างและรักษาสัมพันธ์กับลูกค้าปัจจุบันและลูกค้าใหม่ 
กระบวนการในการสร้างความแตกต่างซึ่งเป็นคุณค่า (Different Advantage) ขององค์กรให้กับลูกค้า
ข้อผิดพลาดในการบริหารลูกค้า และกระบวนการป้องกัน/แก้ไขข้อผิดพลาด
กรอบแนวคิดเรื่อง Service Solution ซึ่งเป็นการเชื่อมโยง Emotional Intelligence กับทฤษฎีการบริการลูกค้า
Turn in yourself: Learn to manage your personal thermostat
Stay Cool: Learn to stay calm in the face of pressure
Connect with your customer: Learn to turn in to others and make a positive connection
Provide Great Service: Learn to influence others to achieve an outcome beneficial to them and you
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(10, 5, '102', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้ศึกษานวัตกรรมของผู้รับบริการ เครือข่ายภาคี และองค์กรพันธมิตร และทำงานร่วมกันในฐานะหุ้นส่วนทางธุรกิจขององค์กร
มอบหมายงานให้วิเคราะห์การแข่งขันของตลาด เทคโนโลยีสมัยใหม่ และการเปลี่ยนแปลงต่างๆ ที่อาจจะเกิดขึ้นในอนาคต และเตรียมการล่วงหน้าเพื่อป้องกันปัญหาต่างๆ ที่จะเกิดขึ้นในอนาคตให้แก่องค์กร ผู้รับบริการ หรือเครือข่ายพันธมิตรต่างๆ
การโค้ช (Coaching)
แนะนำหรือแลกเปลี่ยนประสบการณ์ในการทำงานด้านการมองการณ์ไกลและการสร้างโอกาสที่ดีให้ผู้รับบริการ (ทั้งภายในและภายนอก) เพื่อรักษาผลประโยชน์อันยั่งยืนหรือผลประโยชน์ระยะยาวให้แก่ผู้รับบริการ
ส่งไปเรียนรู้กับผู้ที่มีประสบการณ์ด้านการคิดเชิงกลยุทธ์ การวางกลยุทธ์/ยุทธศาสตร์ในระยะยาว
การฝึกอบรม
การวางแผนเชิงกลยุทธ์', 'ชื่อหลักสูตรการฝึกอบรม: การวางแผนเชิงกลยุทธ์
วัตถุประสงค์
เพื่อให้มีกรอบความคิด และให้ความสำคัญของการคิดเชิงกลยุทธ์
เพื่อให้เข้าใจ และสามารถนำไปใช้ถึงวิธีการคิด วิเคราะห์ และมองหาโอกาสในเชิงกลยุทธ์ โดยใช้ข้อมูล และหลักการทฤษฎีมาประยุกต์ให้เกิดประโยชน์
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญ และองค์ประกอบของการคิดเชิงกลยุทธ์ เพื่อความสำเร็จขององค์กร
ขั้นตอน และกระบวนการในการ Moving from Operational Manager to a Strategic Thinker 
หลักการวิเคราะห์จุดแข็ง จุดอ่อน โอกาส และข้อจำกัดของธุรกิจ (SWOT Analysis) รวมทั้งการวิเคราะห์คู่แข่ง และตลาด
ข้อมูลที่จำเป็นต้องใช้เพื่อการคิด และมองปัญหาในเชิงกลยุทธ์และโอกาสในทางธุรกิจ
ข้อจำกัดของการที่ไม่สามารถคิดในเชิงกลยุทธ์ได้ และวิธีการขจัดข้อจำกัด
แบบทดสอบ (Case Study) ก่อนการเข้ามีการสัมมนา เพื่อวัดการคิดเชิงกลยุทธ์เพื่อให้ผู้บริหารได้ศึกษาและลองใช้ข้อมูล เพื่อตัดสินใจในเชิงกลยุทธ์
การจำลองสถานการณ์ และแบบฝึกหัดการออกแบบธุรกิจ และการตัดสินใจเชิงธุรกิจ เพื่อสร้างข้อได้เปรียบทางธุรกิจ และสร้างผลประโยชน์ในระยะยาว
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
ผู้เข้าอบรมจะถูกประเมินด้วยแบบทดสอบก่อนการเข้าสัมมนาเพื่อวัด ระดับความสามารถ และในระหว่างการสัมมนาจะมีแบบฝึกหัดเพื่อวัดผลการคิดเชิงกลยุทธ์ด้านการออกแบบธุรกิจ และเมื่อสิ้นสุดการฝึกอบรมจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(11, 1, '103', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้รับผิดชอบงานหรือโครงการใหม่ๆ เพื่อส่งเสริมการแสวงหาความรู้และประสบการณ์ในงาน
เปิดโอกาสให้แสดงความคิดเห็นและประเด็นต่างๆ ที่จะช่วยให้เพิ่มความเชี่ยวชาญในงานได้
ลองเปลี่ยนลักษณะความรับผิดชอบหรือโอนย้ายไปในแผนกอื่นที่มีลักษณะงานแตกต่างอย่างสิ้นเชิง
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการสั่งสมความเชี่ยวชาญในสายอาชีพที่เกี่ยวข้องกับงาน
การฝึกอบรม
เทคนิคการหาข้อมูลที่มีประสิทธิภาพ', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการหาข้อมูลที่มีประสิทธิภาพ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความเข้าใจการหาข้อมูลจากแหล่งต่างๆ ได้อย่างมีประสิทธิภาพสูงสุด
เพื่อให้ผู้เข้าอบรมทดลองปฏิบัติการในการหาข้อมูลที่กำหนด
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
รูปแบบของการค้นหาทั้งในรูปแบบ Index Directory และการค้นหาในรูปแบบ Search Engine 
เทคนิคการค้นหาให้ได้ผลลัพธ์ตามต้องการ  (เช่น การบีบประเด็นให้แคบลง การใช้คำที่ใกล้เคียง การใช้คำหลัก (Keyword) ช่วยคำหลัก (Keyword) หรือการใช้เครื่องหมายบวกและลบช่วย เป็นต้น)
Search Engine ทั้งในประเทศและต่างประเทศ
ตัวอย่างการใช้งาน Search Engine 
ทดลองหาข้อมูลจริง จาก Case Study ที่กำหนดให้
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถสนับสนุนให้เกิดการหาข้อมูลเพิ่มขึ้นมากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(12, 2, '103', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานที่มีลักษณะเกี่ยวข้องกับการพัฒนาความรู้ ความเชี่ยวชาญ การค้นคว้า ศึกษาองค์ความรู้และเทคโนโลยีใหม่ๆ ที่มีใช้ในแวดวงธุรกิจขององค์กร
มอบหมายงานให้วิเคราะห์ความสามารถในการแข่งขันหรือวิจัยด้านการตลาด คู่แข่ง หรือผลิตภัณฑ์ใหม่ที่เกี่ยวข้องกับธุรกิจขององค์กร
มอบหมายงานให้เข้าร่วมโครงการใหม่ๆ ที่เกี่ยวข้องกับองค์ความรู้และแนวโน้มทางธุรกิจใหม่ๆ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการวิเคราะห์และวิจัยทางการตลาด คู่แข่ง หรือผลิตภัณฑ์ใหม่ๆ ที่เกี่ยวข้องกับองค์กร
การฝึกอบรม
การจัดการความรู้
', 'ชื่อหลักสูตรการฝึกอบรม: การจัดการความรู้ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการบริหารความรู้ที่มีประสิทธิภาพสูงสุด
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ประเภทความรู้และองค์ประกอบของความรู้
ความสำคัญของการบริหารความรู้และกระบวนการในการพัฒนาระบบบริหารจัดการความรู้
โมเดลหรือวงจรการจัดการความรู้
ขั้นตอนจัดทำเหมืองความรู้หรือระบบฐานข้อมูลความรู้
พฤติกรรมและแผนการดำเนินงานที่ทำให้เกิดหรือเป็นอุปสรรคไม่ให้เกิดการจัดการความรู้
การทำกิจกรรมเพื่อให้เข้าใจกระบวนการในการบริหารจัดการความรู้
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถสนับสนุนให้เกิดการบริหารจัดการความรู้มากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(13, 3, '103', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานที่เกี่ยวข้องกับการค้นคว้าวิจัย เช่น วิเคราะห์คู่แข่ง วิเคราะห์ผลิตภัณฑ์ และการเป็นที่ปรึกษาด้านเทคนิคแก่ผู้อ่อนอาวุโสกว่าในงาน เป็นต้น
หมุนเวียนไปทำงานในฝ่ายค้นคว้าหรือวิจัยผลิตภัณฑ์ใหม่ๆ ให้กับองค์กร
หมุนเวียนงานไปปฏิบัติหน้าที่ที่เกี่ยวข้องกับการค้นคว้าวิจัยและต้องปรับตัวให้ทันกับการเปลี่ยนแปลงรอบตัวที่เกิดขึ้นตลอดเวลา
ลองเปลี่ยนลักษณะความรับผิดชอบ เช่น รับผิดชอบผลิตภัณฑ์ใหม่ๆ 
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการค้นคว้าวิจัยผลิตภัณฑ์หรือโครงการใหม่ๆขององค์กร
การฝึกอบรม
การคิดเชิงสังเคราะห์', 'ชื่อหลักสูตรการฝึกอบรม: การคิดเชิงสังเคราะห์ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการคิดเชิงสังเคราะห์ (Conceptual Thinking)
เพื่อให้ผู้เข้าอบรมมีเครื่องมือช่วยคิดเรื่องการคิดเชิงสังเคราะห์ เช่น Critical Thinking Technique, Mind Mapping, etc.
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความหมายของการคิดเชิงสังเคราะห์
เครื่องมือช่วยคิดเรื่องการคิดเชิงสังเคราะห์ เช่น Critical Thinking Technique, Mind Mapping, etc.
การทำกิจกรรมเพื่อให้เข้าใจกระบวนการในการสังเคราะห์ความรู้
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(	14, 4, '103', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นผู้นำโครงการหรืองานใหม่ที่ต้องอาศัยความเชี่ยวชาญในงานอย่างสูงสุด
หมุนเวียนหน้าที่ไปปฏิบัติงานที่มีความเกี่ยวข้องกับการงานพัฒนาธุรกิจ งานจัดการผลิตภัณฑ์ต่างๆ เป็นต้น
ส่งเสริมให้ปฏิบัติงานหรือเป็นผู้นำในโครงการที่มีถนัดและตรงตามความสนใจของแต่ละบุคคลเพื่อเพิ่มความเชี่ยวชาญในงานนั้นๆ อย่างต่อเนื่อง
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการพัฒนาธุรกิจ และการพัฒนาผลิตภัณฑ์ใหม่ขององค์กร
การฝึกอบรม
การสั่งสมความเชี่ยวชาญในงานอาชีพ', 'ชื่อหลักสูตรการฝึกอบรม: การสั่งสมความเชี่ยวชาญในงานอาชีพ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความรู้ ความเข้าใจในวิธีการรวบรวมองค์ความรู้ของบุคคลได้
เพื่อให้ผู้เข้าอบรมมีความรู้ ความเข้าใจในแนวทางการเพิ่มทักษะและการจัดเก็บผลงานของบุคคล
เพื่อให้ผู้เข้าอบรมมีเทคนิคการถ่ายทอดความรู้ ทักษะ สู่บุคคลอื่นๆ ได้อย่างมีประสิทธิภาพ
กรอบเนื้อหาของหลักสูตร
บรรยาย: การรวบรวมองค์ความรู้ของบุคคล
บรรยายและฝึกปฏิบัติ: การเพิ่มทักษะและการจัดเก็บผลงานของบุคคล
บรรยาย: เทคนิคการถ่ายโอนความรู้ ทักษะ สู่บุคคลอื่น
บรรยายและระดมสมอง: การกำหนดความเชี่ยวชาญในงานอาชีพระดับองค์กร
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(15, 5, '103', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นผู้นำในการสร้างสรรค์และส่งเสริมวัฒนธรรมการเรียนรู้ในฝ่ายงาน กอง หรือกลุ่มงานที่รับผิดชอบ รวมทั้งมีการติดตามประเมินผล
มอบหมายงานให้สรรสร้างและบูรณาการองค์ความรู้ใหม่ๆ มาใช้ในงานหรือองค์กร โดยพิจารณาจากแผนกลยุทธ์และวิสัยทัศน์ขององค์กรโดยรวม เพื่อให้เกิดองค์ความรู้ใหม่ๆ และประโยชน์ต่อองค์กร
หมุนเวียนงานไปเป็นผู้นำในหน่วยงานที่มีการบูรณาการองค์ความรู้ใหม่ขององค์กร
เปิดโอกาสให้ส่วนร่วมในการนำความรู้และความเชี่ยวชาญมาประยุกต์ใช้กำหนดกลยุทธ์และวิสัยทัศน์ขององค์กร
การฝึกอบรม
Learning Organization (LO)', 'ชื่อหลักสูตรการฝึกอบรม: Learning Organization (LO)
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความเข้าใจเรื่ององค์กรแห่งการเรียนรู้
เพื่อให้ผู้เข้าอบรมมีโอกาสและเปลี่ยนเรียนรู้ซึ่งกันและกัน
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
องค์ประกอบขององค์กรแห่งการเรียนรู้ 
แนวทางในการสร้างองค์กรแห่งการเรียนรู้
ลักษณะสำคัญ 5 ประการขององค์กรแห่งการเรียนรู้ 
อุปสรรคต่อการเรียนรู้ขององค์กร 
การแลกเปลี่ยนและสนทนาเรื่องการสร้างองค์กรแห่งการเรียนรู้
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(16, 1, '104', 'ด้านการคิดและพฤติกรรม
ในแต่ละวัน ให้ประเมินตัวเองว่ามีพฤติกรรมไหนบ้างที่แสดงออกมาได้สอดคล้องกับคุณค่า และค่านิยมของตัวท่านเอง ความน่าเชื่อถือและจริยธรรมจะช่วยส่งเสริมและสนับสนุนให้ท่านทำในสิ่งที่ท่านเชื่อว่าเป็นสิ่งที่ดี
หมั่นรับคำติชม (Feedback) ที่เป็นประโยชน์และตรงไปตรงมา และความคิดเห็นจากเพื่อนที่ไว้ใจและเพื่อนร่วมงานเกี่ยวกับระดับความซื่อสัตย์ที่ท่านติดต่องานกับผู้อื่น
เวลาที่ผู้อื่นมาขอความช่วยเหลือจากท่านในทางที่ไม่ถูกต้อง ท่านต้องกล้าปฏิเสธอย่างตรงไปตรงมา
การโค้ช (Coaching)
ให้คำแนะนำ เรื่องคุณธรรม และจริยธรรม
การฝึกอบรม
On-the-Job Training', 'ชื่อหลักสูตรการฝึกอบรม: On-the-Job Training
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจมาตรฐาน วิธีการทำงาน และกระบวนการในการทำงานของตำแหน่งงานของตนเองอย่างถูกต้อง และชัดเจน
เพื่อให้โอกาสผู้ฝึกอบรมมีโอกาสสั่งสมความชำนาญในการทำงาน และสามารถปฏิบัติงานได้อย่างถูกต้อง โดยไม่มีข้อผิดพลาด และตรงตามมาตรฐานที่กำหนด
กรอบเนื้อหาของหลักสูตร
อธิบายกฎระเบียบ วิธีการปฏิบัติงาน และมาตรฐานความถูกต้องของงานในตำแหน่งงานที่รับผิดชอบ
จัดทำคู่มือ ระเบียบปฏิบัติ และกระบวนการทำงานของตำแหน่งงาน
ดำเนินการฝึกอบรมถึงหน้าที่ความรับผิดชอบ ขั้นตอนการปฏิบัติงาน โดยเน้นเรื่องความถูกต้องของงานควบคู่ไปกับการปฏิบัติงานจริง 
มีกิจกรรม และแบบทดสอบ รวมทั้งทดลองให้ปฏิบัติงานจริง เพื่อให้ผู้รับการฝึกอบรมเข้าใจในวิธีการปฏิบัติงาน สามารถปฏิบัติงานได้ถูกต้อง และสามารถนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร ครึ่งวัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(17, 2, '104', 'ด้านการคิดและพฤติกรรม
ให้เวลาในการสำรวจตนเองว่าคุณค่า ค่านิยม และหลักการอะไรที่ตัวท่านเองรู้สึกเป็นสิ่งที่สำคัญอย่างสูงสุด และจดบันทึกเก็บเป็นข้อมูล รวมทั้งติดตามพฤติกรรมของตัวเองว่ามีพฤติกรรมไหนที่สอดคล้องกับค่านิยมของตัวเองบ้าง 
แบ่งปันข้อมูลว่าแบบอย่างและพฤติกรรมด้านจริยธรรม คุณธรรมและหลักการอะไรบ้างที่ท่านยึดถือเป็นแบบอย่างให้แก่เพื่อนร่วมงานหรือผู้อื่น และหมั่นซักถามให้พวกเขาคอยเตือนท่านในกรณีที่ท่านแสดงพฤติกรรมที่ขัดแย้งกับค่านิยมและแบบอย่างที่ยึดถือเป็นแนวทางในการปฏิบัติ
ติดค่านิยมและความเชื่อต่างๆ ของท่านที่เกี่ยวข้องกับคุณธรรมและจริยธรรมบนปฏิทินหรือบนโต๊ะทำงานในองค์กร เพื่อให้ท่านเห็นถึงความสำคัญและซึมซับพฤติกรรมเหล่านั้น รวมทั้งเป็นเครื่องเตือนให้ท่านตระหนักถึงพฤติกรรมเหล่านั้นอยู่ตลอดเวลา โดยมุ่งเน้นความสม่ำเสมอเป็นหลัก
การโค้ช (Coaching)
เล่าประสบการณ์และชี้ให้เห็นถึงความสำคัญของการรักษาสัจจะและผลกระทบต่อความสำเร็จที่ยั่งยืนขององค์กรหรือหน่วยงาน
การฝึกอบรม
ธรรมะในชีวิตประจำวัน ', 'ชื่อหลักสูตรการฝึกอบรม: ธรรมะในชีวิตประจำวัน 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมได้รับคำเทศน์ที่ใช้ในชีวิตประจำวันนี้
เพื่อให้ผู้เข้าอบรมมีจริยธรรมประกอบการทำงานในสายอาชีพ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดในศีล 5
กรอบแนวคิดในเรื่องมรรค 8 โดยเฉพาะเรื่องสัมมากัมมันโต (กระทำชอบ) สัมมาอาชีโว (เลี้ยงชีพชอบ) และสัมมาวายาโม (เพียรชอบ)
พรหมวิหาร 4 (เมตตา กรุณา มุติทา อุเบกขา)
มีการเสวนาเรื่องหลักธรรมคำสั่งสอน กับงานในชีวิตประจำวัน
ระยะเวลาของหลักสูตร
ไม่น้อยกว่า 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(18, 3, '104', 'ด้านการคิดและพฤติกรรม
หาโอกาสในการพัฒนาและเสริมสร้างความเข้าใจด้านจริยธรรม หลักการ และจรรยาบรรณของวิชาชีพอันลึกซึ้ง และแบ่งปันข้อมูลเหล่านี้ให้กับบุคคลที่ท่านเชื่อว่าพวกเขาเหล่านั้นจะมีความเชื่อเหมือนกับท่าน เพื่อสร้างความยึดมั่นในหลักการทางวิชาชีพ และจริยธรรมภายในองค์กร
เปิดเผยความรู้สึกอย่างตรงไปตรงมา และแสดงความคิดเห็นอย่างจริงใจ รวมทั้งไม่หนีปัญหาและหลีกเลี่ยงการตอบปัญหาที่ไม่แน่ชัด
พัฒนาและปรับปรุงการให้คำติชมในเชิงสร้างสรรค์และซื่อสัตย์แก่ผู้อื่น
เข้าร่วมกิจกรรมต่างๆ ที่เสริมสร้างคุณธรรมความดี
เมื่อท่านทำสิ่งใดผิดพลาด ให้ยอมรับและขอโทษ

การโค้ช (Coaching)
ดูแล แนะนำและชี้ให้เห็นถึงหลักการและจรรยาบรรณของวิชาชีพ และผลประโยชน์ที่ได้รับ ', '', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(19, 4, '104', 'ด้านความคิดและพฤติกรรม
กล้าเผชิญกับความจริง ในกรณีที่ท่านเห็นว่าผู้อื่นไม่ปฏิบัติตามหลักการที่ถูกต้อง ท่านต้องพร้อมที่จะบอกล่าวอย่างตรงไปตรงมา เพื่อธำรงไว้ซึ่งความถูกต้อง เพื่อพิทักษ์ผลประโยชน์และชื่อเสียงขององค์กร
ในสถานการณ์ที่ยากลำบากที่จะยืนหยัดบนหลักการที่ถูกต้อง ท่านต้องยึดมั่นและตั้งใจที่จะธำรงไว้ซึ่งความถูกต้อง 
เป็นผู้คิดริเริ่มโครงการใหม่ๆ ในองค์กรที่เกี่ยวข้องการบริหารงบประมาณจำนวนมาก
คอยหาโอกาสที่จะช่วยเหลือผู้อื่นที่อยู่นอกเหนือความรับผิดชอบของท่าน หาวิธีการที่หน่วยงานสามารถทำงานให้ดีขึ้นได้เพื่อให้เกิดประโยชน์ต่อองค์กรโดยรวม', '', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(20, 5, '104', 'ด้านความคิดและพฤติกรรม
พยายามทำตัวเป็นแบบอย่างเพื่อมาตรฐานที่ดีด้านพฤติกรรมและจริยธรรม เช่น ยอมรับความผิดพลาดที่ตนเองเป็นผู้ก่อเสมอ ยืนหยัดเพื่อสิ่งที่ท่านเห็นว่าถูกต้อง และให้รางวัลชมเชยผู้อื่นที่กระทำอย่างเดียวกันนี้
มอบหมายให้เข้าไปมีส่วนร่วมในการพยากรณ์งบประมาณค่าใช้จ่ายต่างๆ ในองค์กร และกระบวนการเพื่อให้บรรลุเป้าหมายนั้นๆ
ขอความร่วมมือจากเพื่อนร่วมงานที่ไว้ใจได้ในการปรับปรุงพฤติกรรมให้สอดคล้องกับค่านิยมและความเชื่อที่ท่านยึดมั่น บอกให้พวกเขาทราบถึงความตั้งใจของท่านและขอให้ช่วยตักเตือนเมื่อพวกเขาเห็นว่าการกระทำของท่านนั้นบิดเบือนไปจากสิ่งที่ท่านยึดถือ
หากมีโอกาสให้ท่านได้แสดงจุดยืนของตน ควรรีบรับโอกาสนั้นไว้ แต่ท่านต้องแน่ใจว่าท่านสามารถยืนหยัดต่อจุดยืนและหลักการของตนได้จริง', '', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(21, 1, '105', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานที่ต้องอาศัยการทำงานร่วมกับผู้อื่น หรือเพื่อนร่วมงาน
มอบหมายให้รับผิดชอบผลงานส่วนใดส่วนหนึ่งที่เป็นส่วนหนึ่งของโครงการหรือกิจกรรมต่างๆ
การคิดและพฤติกรรม
รับฟังความคิดเห็นของผู้อื่น
หลีกเลี่ยงการควบคุมกำหนดการ การเสนอความคิดเห็นเป็นบุคคลแรก หรือการประพฤติตนเป็นผู้นำ แต่เน้นแสดงบทบาทหน้าที่ของการเป็นส่วนหนึ่งของทีม
อาสาสมัครเป็นสมาชิกของทีมงานที่กำลังทำงานในสิ่งที่ท่านสนใจ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องความรับผิดชอบงานในหน้าที่ของตนเองในฐานะเป็นสมาชิกในทีมงาน
เน้นย้ำถึงความสำคัญถึงความสำคัญและประโยชน์ของการรายงาน ความคืบหน้าของงาน หรือการแลกเปลี่ยนข้อมูลที่เป็นประโยชน์ซึ่งกันและกันภายในทีมงาน
การฝึกอบรม
การเสริมสร้างศักยภาพการทำงานเป็นทีม ', 'ชื่อหลักสูตรการฝึกอบรม: การเสริมสร้างศักยภาพการทำงานเป็นทีม 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมพัฒนารูปแบบการทำงานในลักษณะของทีมงาน
เพื่อให้ผู้เข้าอบรมพัฒนาทักษะการแก้ปัญหา เน้นในเรื่องกระบวนการคิดร่วมกันอย่างเป็นระบบและสร้างสรรค์
เพื่อให้ผู้เข้าอบรมพัฒนาทักษะการสื่อสาร เน้นในเรื่องวัตถุประสงค์ของการสื่อสาร
เพื่อให้ผู้เข้าอบรมเกิดความเข้าใจในเรื่องหน้าที่รับผิดชอบ ในฐานะผู้นำ และผู้ตาม
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญของกลุ่มและทีม
เทคนิคและขั้นตอนสำคัญในการสร้างทีมงาน
กระบวนการพัฒนาความคิดสร้างสรรค์และการทำงานร่วมกับผู้อื่น
การปรับสภาพการทำงานของทีมงานอย่างมีประสิทธิภาพ
ความสัมพันธ์ของทีมงานและการบริหาร
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(22, 2, '105', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ไปติดต่อและสร้างสัมพันธ์กับผู้อื่น
สร้างโอกาสให้มีการพูดคุยหรือทำกิจกรรมร่วมกันกับเพื่อนพนักงาน หรือบุคลากรจากหน่วยงานต่างๆ ภายนอก เพื่อให้เกิดสัมพันธภาพที่ดีระหว่างสองฝ่าย
มอบหมายงานที่เน้นการทำงาน การแก้ไขปัญหา การตัดสินใจ และการประสานงานของสมาชิกภายในทีม โดยให้สมาชิกทุกคนมีจุดมุ่งหมายเดียวกันคือความสำเร็จของทีม
การคิดและพฤติกรรม
ใช้เวลาในการคิดทบทวนถึงการปฏิสัมพันธ์กับผู้อื่นครั้งล่าสุดว่าตนมีปฏิกิริยาอย่างไร ผู้ที่สนทนาด้วยมีท่าทีอย่างไร ผลลัพธ์ที่ได้เป็นเช่นไร และทั้งสองฝ่ายมีความพึงพอใจกับผลลัพธ์หรือไม่
หาโอกาสในการพูดคุยหรือพบปะทักทายผู้คนให้เป็นกิจวัตร โดยอาจจัดการด้วยการกันเวลาในตารางนัดหมายเพื่อให้การเยี่ยมเยียนพบปะผู้คนเป็นไปอย่างมีระบบ
หมั่นสื่อสารข้อมูลหรือข่าวสารที่จำเป็นให้เพื่อนร่วมงาน หรือหน่วยงานต่างๆ อย่างสม่ำเสมอ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเน้นย้ำถึงความสำคัญของการผูกมิตร และสร้างสัมพันธภาพที่ดีระหว่างองค์กรกับหน่วยงานอื่นๆ
ดูแลแนะนำการทำงานเป็นทีมให้กับบุคลากรในหน่วยงาน
สอนกระบวนการในการดูแลและสร้างสัมพันธ์กับหน่วยงานอื่นๆ
การฝึกอบรม
การสร้างทีมงาน', 'ชื่อหลักสูตรการฝึกอบรม: การสร้างทีมงาน 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจหลักการทำงานเป็นทีมได้อย่างถูกต้อง
เพื่อให้ผู้เข้าอบรมสามารถปฏิบัติงานร่วมกับผู้อื่นด้วยความร่วมมือที่ดี ปฏิบัติต่อกันในงานได้ตามหลักมนุษยสัมพันธ์และมีสัมพันธภาพที่ดี โดยมีการช่วยเหลือพึ่งพาอาศัยกัน และเปิดเผยรับฟังซึ่งกันและกัน
เพื่อให้ผู้ฝึกอบรมสามารถตัดสินใจร่วมกันโดยใช้หลักเหตุผล และความเห็นพ้องต้องกัน
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการทั่วไปในการทำงานเป็นทีม
มนุษยสัมพันธ์ในการทำงานร่วมกัน
การเปิดใจรับฟังความคิดเห็นของผู้อื่น และการตัดสินใจในทีม
การสื่อข้อความในทีม
การรู้จักตนเองและการพัฒนาตนเอง
การวางแผนและจัดระบบงานในทีม
ฝึกปฏิบัติการทำงานเป็นทีม และกิจกรรมระดมสมองเรื่อง “ทำไมจึงไม่เป็นทีม”
ระยะเวลาของหลักสูตร
1-2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(23, 3, '105', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ดูแลและรักษาสัมพันธภาพที่ดีกับผู้อื่น หรือหน่วยงานต่างๆ เช่น ผู้รับบริการ เพื่อนร่วมงาน องค์กรพันธมิตร องค์กรคู่ค้าบางราย หรือบางกลุ่ม เป็นต้น
มอบหมายให้จัดงานเพื่อสร้างกิจกรรมสัมพันธ์กับเพื่อนร่วมงาน ผู้อื่น หรือหน่วยงานต่างๆ
สนับสนุนให้เกิดโอกาสที่จะรับฟังประเด็นหรือความต้องการของเพื่อนร่วมงานผู้อื่น หรือหน่วยงานต่างๆ เพื่อนำไปสู่การปรับปรุงที่ดีขึ้นทั้งสองฝ่าย
การคิดและพฤติกรรม
พยายามเปิดใจยอมรับฟังและเข้าใจความคิดเห็นของผู้อื่น เพื่อประโยชน์ในการทำงานร่วมกันให้ดียิ่งขึ้น
พยายามอย่างเต็มที่ในการรักษาความสัมพันธ์อันดี โดยเน้นการให้ความร่วมมือและความช่วยเหลือในการทำงานอย่างเต็มที่กับเพื่อนร่วมงาน หรือผู้อื่นเพื่อให้งานสำเร็จลุล่วง
พยายามลดอคติหรือความไม่ชอบส่วนตัว เพื่อต้องทำงานร่วมกับผู้อื่น โดยมองที่ผลงานเป็นหลัก
เต็มใจและสร้างให้เกิดการแลกเปลี่ยนความคิด ทัศนคติ เมื่อได้รับข้อมูลใหม่ หรือหลักฐานที่ขัดแย้งกับความคิดเดิมจากเพื่อนร่วมงาน
การโค้ช (Coaching)
เน้นให้เห็นถึงประโยชน์และความสำคัญของการแลกเปลี่ยนข้อมูลหรือความคิดเห็นร่วมกันอย่างสม่ำเสมอเพื่อให้เกิดความเข้าใจและ ความร่วมมือที่ดีต่อกันมากยิ่งขึ้น
การฝึกอบรม
การบริหารทีมงาน', 'ชื่อหลักสูตรการฝึกอบรม: การบริหารทีมงาน 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด เรื่องการบริหารทีมงาน
เพื่อให้ผู้เข้าอบรมเข้าใจ และสามารถนำไปใช้ถึงวิธีการคิด และกระบวนการในการบริหารเป็นทีมไปใช้
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดเรื่องการทำงานเป็นทีม
กระบวนการในการสร้างความสัมพันธ์ในทีม                                                (Forming Stage, Storming Stage,                                                                  Norming Stage and Performing stage)
ทักษะของผู้นำทีมที่จำเป็นในแต่ละขั้น                                                     ของการสร้างสัมพันธ์ในทีม
เครื่องมือในการประเมินการทำงานเป็นทีม
กิจกรรมการทำงานเป็นทีม
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด เมื่อผ่านการฝึกอบรม โดยจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(24, 4, '105', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้จัดกิจกรรมที่สร้างประโยชน์ให้กับเพื่อนพนักงาน ผู้อื่น หรือหน่วยงานต่างๆ
มอบหมายให้คิดแผนงานที่จะสามารถให้ความสนับสนุนหรือความช่วยเหลือผู้รับบริการ คู่ค้า หรือองค์กรพันธมิตรต่างๆ เพื่อให้งานที่ตั้งเป้าหมายร่วมกันประสบความสำเร็จ
มอบหมายให้หาจุดแข็งของผู้รับบริการ คู่ค้า หรือองค์กรพันธมิตรต่างๆ แล้วหาแนวทางที่จะผลักดันหรือสร้างสรรค์ให้เกิดผลประโยชน์แก่องค์กร
ลองปฏิบัติงานโดยกำหนดเป็นโครงการใหม่ๆ ที่ท้าทาย หรืองานที่กำลังประสบกับปัญหาซึ่งต้องอาศัยความร่วมมือของทีมงาน เป็นต้น
การคิดและพฤติกรรม
อภิปรายร่วมกันบนหลักข้อเท็จจริงและเหตุผล โดยพึงระลึกอยู่เสมอว่าแต่ละคนต่างก็มีภูมิหลังที่แตกต่างกัน อันนำมาสู่ค่านิยมและความเชื่อที่แตกต่างกันด้วย
พยายามเข้าใจความต้องการของเพื่อนร่วมงาน หรือผู้อื่น และยอมเสียสละประโยชน์ส่วนตนในระยะสั้น เพื่อสร้างมิตรภาพและผลประโยชน์ร่วมกันในระยะยาว
ส่งเสริมและกล้าที่จะให้เพื่อนร่วมงาน ผู้อื่น หรือหน่วยงานต่างๆ มีความรู้สึกเข้มแข็ง (Empowerment) และเห็นว่าตนเองมีบทบาทสำคัญต่อผลลัพธ์ที่เกิดขึ้นของงานและโครงการนั้นๆ
แสดงน้ำใจและให้กำลังใจเพื่อนร่วมงานหรือผู้อื่นอย่างจริงใจที่สุด
พยายามรักษาสายสัมพันธ์ที่ดีให้ต่อเนื่องและยาวนาน โดยการให้ความช่วยเหลือหรือให้คำแนะนำที่เป็นประโยชน์ด้วยความจริงใจในโอกาสต่างๆ ที่เหมาะสม
การโค้ช (Coaching)
เน้นให้เห็นถึงการสร้างประโยชน์ร่วมกันในระยะยาว 
การฝึกอบรม
Strategic Partnership Management ', 'ชื่อหลักสูตรการฝึกอบรม: Strategic Partnership Management 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการบริหารงานองค์กรพันธมิตรต่างๆ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
คำจำกัดความของการบริหารองค์กรพันธมิตร 
เทคนิค 80/20 ในการบริหารองค์กรพันธมิตร
การประสานพลัง (Synergy) เพื่อให้เกิดการสร้างประโยชน์สูงสุด
การให้อำนาจ (Empowerment) ทั้งกระบวนการเชิงจิตวิทยา และกระบวนการทางสังคม
การใช้ประโยชน์จากการทำงานร่วมกัน (Leverage)
การทำ Role Play ในสถานการณ์สมมติ
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(25, 5, '105', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานหรือโครงการต่างๆ ที่มีผลกระทบระดับองค์กรเน้นการทำงาน การแก้ไขปัญหา การตัดสินใจ การวางแผน และการประสานงานของเจ้าหน้าที่ทั้งหมดขององค์กร ที่ต้องอาศัยความร่วมมือและการมีส่วนร่วมอย่างเต็มที่ โดยให้เจ้าหน้าที่ทุกคนมีจุดมุ่งหมายเดียวกันคือความสำเร็จขององค์กร
มอบหมายให้วางแผนว่าจะสร้างผลประโยชน์ร่วมกันกับองค์กรพันธมิตร หรือหน่วยงานอื่นๆ อย่างยั่งยืนได้อย่างไร แล้วให้นำแผนนั้นไปปฏิบัติให้เกิดขึ้นจริงตามแผนที่วางไว้
มอบหมายให้สร้างบรรยากาศที่ดีของการทำงานร่วมกันเป็นทีมให้เกิดขึ้นภายในหน่วยงาน หรือองค์กร
การคิดและพฤติกรรม
หยิบยื่นความช่วยเหลือให้กับผู้อื่นในยามที่พวกเขาประสบวิกฤติโดยไม่ต้องร้องขอ เพื่อแสดงความมีน้ำใจและใส่ใจต่อการรักษาสัมพันธภาพที่ดีระหว่างกัน
พยายามสร้างให้เกิดการทำงานอย่างสามัคคีและรักษามิตรภาพในระยะยาวกับเพื่อนร่วมงาน ผู้อื่น หรือหน่วยงานต่างๆ จนเป็นพลังที่เข้มแข็งขึ้น
ต้องหมั่นสร้างความสัมพันธ์และความเป็นอันหนึ่งอันเดียวกันในองค์กร กับองค์กรพันธมิตร หรือหน่วยงานต่างๆ อย่างสม่ำเสมอและต่อเนื่อง เป็นระยะเวลานาน
หมั่นรักษาความน่าเชื่อถือ ความไว้ใจและความเป็นมืออาชีพกับผู้อื่นอย่างสม่ำเสมอ
การฝึกอบรม
การบริหารความขัดแย้ง', 'ชื่อหลักสูตรการฝึกอบรม: การบริหารความขัดแย้ง 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถเข้าใจถึงการบริหารจัดการความขัดแย้ง (Conflict Management)
เพื่อให้ผู้เข้าอบรมมีเครื่องมือในการบริหารจัดการความขัดแย้งและแก้ปัญหาอย่างถูกต้อง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
การบริหาร Conflict โดยตามทฤษฎีของ Thomas-Kilmann (Competing, Accommodating, Avoiding,                                                        Compromising และ Collaborating)
การกำหนดทางเลือกในการตัดสินใจ                                                            และการประเมินความขัดแย้ง
การพิจารณาความเสี่ยงที่อาจเกิดขึ้น                                                                      และระดับที่ยอมรับได้/ไม่ได้                                                                          จากผลการตัดสินใจ
การนำสิ่งที่ตัดสินใจเข้าสู่การปฏิบัติ
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(26, 1, '201', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้นำในการประชุม หรือแจ้งข่าวสารให้สมาชิกในทีมทราบความก้าวหน้าของแต่ละส่วนงาน/โครงการ 
มอบหมายให้เข้าร่วมเป็นผู้นำกลุ่มย่อยในโครงการใหม่ๆ หรืองานใหม่ๆ (Assignment) ที่เป็นภารกิจของหน่วยงาน/ องค์กร
หมุนเวียบไปงานที่ต้องบังคับบัญชาบุคลากรอื่นๆ 
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการบริหารการประชุม การควบคุมเวลา และวิธีการในการมอบหมายงานกับผู้ใต้บังคับบัญชาที่เหมาะสมกับความสามารถของแต่ละบุคคล
การฝึกอบรม
Time Management', 'ชื่อหลักสูตรการฝึกอบรม: Time Management 
วัตถุประสงค์
เพื่อให้ผู้ฝึกอบรมมีกรอบความคิด เรื่องการบริหารจัดการเวลา 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดในการบริหารจัดการเวลาและประโยชน์ของการบริหารจัดการเวลา
ข้อผิดพลาดต่างๆ ที่ทำให้เสียเวลา (การบริหารเหตุไม่คาดหวัง (Crisis) การรบกวนโดยโทรศัพท์ การไม่วางแผนล่วงหน้า การแบ่งงาน การไม่วินัยต่อตนเอง ความไม่สามารถที่จะปฏิเสธ การบริหารจัดการการประชุม การบริหารงานเอกสาร (Paperwork) การสื่อสารที่ไม่ดี เป็นต้น)
กระบวนการและเทคนิคในการแก้ไขข้อผิดพลาดเพื่อให้สามารถบริหารจัดการเวลาได้อย่างมีประสิทธิภาพสูงสุด
ระยะเวลาของหลักสูตร
1 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถบริหารจัดการเวลาได้มากน้อยเพียงได', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(27, 2, '201', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้นำในโครงการหรือภารกิจใหม่ๆ
มอบหมายให้ประเมินศักยภาพของบุคลากรในหน่วยงาน/โครงการเพื่อวางแผนบริหารจัดการให้ได้ผลสัมฤทธิ์
มอบหมายให้แก้ปัญหาในหน่วยงาน
หมุนเวียนงานให้ไปเป็นผู้นำในโครงการที่มีบุคลากรจากหลายหน่วยงาน
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการเป็นผู้นำที่ดี เช่น การกล่าวคำชมเชยหรือข้อคิดเห็นที่สร้างสรรค์ การสร้างขวัญกำลังใจในที่ทำงาน เป็นต้น
สอนการวางแผนหน่วยงานที่ต้องรับผิดชอบ
การฝึกอบรม
การตั้งเป้าหมายด้วยวิธี Scorecard
จิตวิทยาและการเป็นหัวหน้างาน ', 'ชื่อหลักสูตรการฝึกอบรม: การตั้งเป้าหมายด้วยวิธี Scorecard
วัตถุประสงค์
เพื่อให้ผู้ฝึกอบรมเข้าใจกระบวนการในตั้งเป้าหมายองค์กรด้วยวิธี Scorecard
เพื่อให้ผู้ฝึกอบรมได้ทดลองปฏิบัติจริงในหน่วยงานของตน
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
การกำหนดแผนที่ยุทธศาสตร์ที่ถูกต้อง
กระบวนการจัดทำเป้าหมายและตัวชี้วัด                                                         ตามหลัก Scorecard ทั้งในมุมมอง                                                         ประสิทธิผลการทำงาน                                                                    มุมมองด้านผู้รับบริการ                                                                                   มุมมองด้านการพัฒนาประสิทธิภาพ                                                   ภายใน และมุมมองด้านการพัฒนา                                                         องค์กร
กระบวนการการติดตามและปรับปรุงพัฒนาเพื่อให้ได้เป้าหมายที่มีประสิทธิภาพมากขึ้น
กิจกรรมและ Case Study ตลอดการฝึกอบรมเพื่อให้ผู้รับการฝึกอบรมเข้าใจในกรอบแนวคิด ทฤษฎี และวิธีการนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร ชื่อหลักสูตรการฝึกอบรม: จิตวิทยาและการเป็นหัวหน้างาน
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถพัฒนาทักษะและคุณสมบัติในการเป็นหัวหน้างานที่ดีให้แก่บุคลากรและองค์กร ที่จะต้องมีภาระหน้าที่ (Responsibility) และความรับผิดชอบ (Accountability) ตามหน้าที่งาน (Function Description) ที่จะได้รับ หรือปรับเพิ่มสูงขึ้น 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
บทบาทหน้าที่ของหัวหน้างาน
การบริหารคน
การสื่อความหมายอย่างมีประสิทธิภาพ
การสั่งงาน การมอบหมาย การติดตามงาน
การร่วมกันทำงานเป็นทีม
การจูงใจ และให้กำลังใจ 
จิตวิทยาในการทำงานร่วมกับลูกน้อง 
การบริหารทีมงาน
กิจกรรมและ Case Study ตลอดการฝึกอบรมเพื่อให้ผู้รับการฝึกอบรมเข้าใจในกรอบแนวคิด ทฤษฎี และวิธีการนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(28, 3, '201', 'การมอบหมายงานและการหมุนเวียนงาน
หมุนเวียนงานให้เป็นผู้นำในโครงการหรือพันธกิจที่สำคัญขององค์กร
มอบหมายงานให้แก้ไขปัญหา/สถานการณ์วิกฤตที่สำคัญขององค์กรหรือหน่วยงาน
มอบหมายให้วางแผนการติดตามงานตามภารกิจขององค์กร
มอบหมายให้เป็นผู้สอนงานหน่วยงานหรือโครงการที่ต้องใช้ความเชี่ยวชาญเป็นพิเศษ
เป็นผู้นำทีมที่เกี่ยวข้องกับการประหยัดและลดต้นทุนในองค์กร
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการฟัง การ Coaching ที่ถูกวิธี
การฝึกอบรม
สภาวะผู้นำ (Team Leadership)', 'ชื่อหลักสูตรการฝึกอบรม: สภาวะผู้นำ (Team Leadership) 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด เรื่องสภาวะผู้นำ
เพื่อให้ผู้เข้าอบรมมีความเข้าใจ และสามารถนำกรอบแนวคิดเรื่องสภาวะผู้นำไปใช้ให้เกิดประโยชน์สูงสุดแก่องค์กร
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญของผู้นำที่ดีและกรอบแนวคิดในการเป็นผู้นำ
เครื่องมือและแนวทางในการวางแผน ติดตามและควบคุมให้ได้                                                                                                                     ผลงานที่สร้างแรงบันดาลใจให้ผู้ใต้บังคับบัญชา
หลักการเรื่องการสร้างขวัญกำลังใจ (Motivation) 
สไตล์ในการบริหารที่เหมาะสมกับแต่ละสถานการณ์ที่หลากหลาย
การสร้างบรรยากาศในการทำงานที่สร้างสรรค์ให้เกิดผลงานที่โดดเด่น
การบริหารจัดการและใช้ความสามารถของผู้ใต้บังคับบัญชาแต่ละบุคคลให้เกิดประสิทธิภาพสูงสุด
มีกิจกรรม เช่น Workshop หรือ Role Play เพื่อให้ผู้ฝึกอบรมได้ศึกษาและเข้าใจการนำไปใช้จริง
ระยะเวลาของหลักสูตร 3 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(29, 4, '201', 'การมอบหมายงานและการหมุนเวียนงาน
หมุนเวียนงานให้เป็นผู้นำในโครงการหรือพันธกิจที่สำคัญขององค์กร
มอบหมายงานให้เริ่มหน่วยงานหรือเริ่มโครงการใหม่ๆ ที่ต้องใช้ทักษะความเป็นผู้นำสูงให้ประสบความสำเร็จตามเป้าหมายที่องค์กรกำหนด
มอบหมายงานที่ต้องสร้างสัมพันธภาพกับหน่วยงานอื่นๆ ทั้งในและนอกองค์กร
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการเป็นผู้นำที่ดี เช่น การสร้างบรรยากาศในการทำงานที่ดี ลักษณะของผู้นำที่ดีในแต่ละสถานการณ์ (Leadership Style) การให้รางวัลและการสนับสนุนกับผู้ใต้บังคับบัญชาที่มีประสิทธิภาพ
การฝึกอบรม
การตัดสินใจอย่างถูกต้อง ', 'ชื่อหลักสูตรการฝึกอบรม: การตัดสินใจอย่างถูกต้อง 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด เรื่องการใช้ดุลยพินิจในการตัดสินใจ
เพื่อให้ผู้เข้าอบรมมีเครื่องมือที่ใช้ในการตัดสินใจ 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดในการวิเคราะห์และใช้ดุลยพินิจในการตัดสินใจ
ข้อผิดพลาดที่ทำให้เกิด Bias เวลาตัดสินใจ เช่น The Estimating and Forecasting Traps, The Framing Trap, The Confirming-Evidence Trap หรือ The Status-Quo Trap เป็นต้น
เครื่องมือที่ช่วยในการตัดสินใจให้มีประสิทธิภาพสูงสุด
มีกิจกรรมเรื่อง Decision Making Simulation เพื่อให้เข้าใจถึงกระบวนการการตัดสินใจจากแนวคิดที่บรรยาย
ระยะเวลาของหลักสูตร 3 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(30, 5, '201', 'การมอบหมายงานและการหมุนเวียนงาน
หมุนเวียนงานให้เป็นผู้นำในโครงการหรือพันธกิจที่สำคัญขององค์กร
มอบหมายงานให้เริ่มหน่วยงานหรือเริ่มโครงการใหม่ๆ ให้ประสบความสำเร็จตามเป้าหมายที่องค์กรกำหนด
มอบหมายงานที่ต้องสร้างสัมพันธภาพกับหน่วยงานอื่นๆ ทั้งในและนอกองค์กร
มอบหมายงานให้เป็นผู้สื่อสารวิสัยทัศน์ที่ทรงพลังกับหน่วยงาน
มอบหมายให้สร้างสรรค์สิ่งใหม่ให้กับองค์กรและดำเนินการให้เกิดการยอมรับและมุ่งมั่น (Commitment) ในหน่วยงาน/องค์กรที่จะช่วยผลักดันสิ่งใหม่นั้นให้เกิดประโยชน์กับองค์กรสูงสุด
การฝึกอบรม
การสร้างและสื่อสารวิสัยทัศน์ ', 'ชื่อหลักสูตรการฝึกอบรม: การสร้างและสื่อสารวิสัยทัศน์ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความรู้เรื่องการสร้างวิสัยทัศน์
เพื่อให้ผู้เข้าอบรมสามารถเตรียมการเพื่อสื่อสารวิสัยทัศน์ 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
วิสัยทัศน์คืออะไร
การสร้างวิสัยทัศน์ที่ดีคืออะไร (กรอบแนวคิดจาก Good To Great) 
วิสัยทัศน์ที่ดีมีลักษณะอย่างไร (เช่น ท้าทาย กระชับและชัดเจน (Concrete) วัดผลได้จริง (measurable) จูงใจให้ทำตาม (Engaging) ระยะยาว (Long Term) และสอดคล้องกับความต้องการของผู้มีส่วนได้ส่วนเสียทั้งหมดหรือไม่)
กระบวนการในการเตรียมการเพื่อสื่อสารวิสัยทัศน์ที่ทรงพลัง
กระบวนการในการนำวิสัยทัศน์ให้เป็นจริง 
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(31, 1, '202', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้นำเสนอผลงาน สื่อสาร และถ่ายทอดเป้าหมาย บทบาทของหน่วยงานแก่ผู้อื่นให้เกิดความถูกต้อง
มอบหมายงานให้วิเคราะห์ความเชื่อมโยงวิสัยทัศน์ เป้าหมาย หรือทิศทางของหน่วยงานว่าสอดคล้องกับกับเป้าหมาย วัตถุประสงค์และกลยุทธ์ของภาครัฐ หรือของ สมอ. โดยรวมอย่างไร
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการเสนอผลงานอย่างมีประสิทธิภาพ
เสนอแนะแนวทาง และวิธีการสื่อสาร และถ่ายทอดให้ชัดเจน และมีประสิทธิภาพ
การฝึกอบรม
เทคนิคการนำเสนอ 
การสื่อสารที่มีประสิทธิภาพ', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการนำเสนอ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมได้รู้จักการกำหนดเป้าหมาย และวัตถุประสงค์ในการนำเสนอแก่ผู้อื่น
เพื่อให้ผู้เข้าอบรมเข้าใจขบวนการสังเกตและปรับแนวทางการนำเสนอด้วยการวิเคราะห์ผู้ฟังอย่างมีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมสามารถจัดลำดับความคิดเห็นและขบวนการนำเสนออย่างมีขั้นตอน และเข้าใจง่าย
เพื่อให้ผู้เข้าอบรมสามารถจัดลำดับข้อมูลได้สมบูรณ์ พร้อมประยุกต์เครื่องมือ และอุปกรณ์ต่างๆ ในการนำเสนอได้อย่างมีประสิทธิภาพ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการและความสำคัญของการนำเสนอ 
รูปแบบการนำเสนอที่มีประสิทธิผล
ทักษะและเทคนิคการนำเสนอที่เหมาะสมกับสถานการณ์
การวางแผนและการเตรียมการก่อนนำเสนอ 
ทักษะในการนำเสนอ และการเพิ่มประสิทธิภาพในการพูดเพื่อนำเสนอ
กิจกรรมเพื่อทดลองการนำเสนอ
ระยะเวลาของหลักสูตร
1-2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(32, 2, '202', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้สื่อสาร และสร้างความน่าเชื่อถือให้แก่โครงการ หรือกิจกรรมของหน่วยงาน เพื่อสร้างการยอมรับและการมีส่วนร่วมของผู้อื่น และหน่วยงานต่างๆ 
มอบหมายงานให้ทำงาน ดำเนินโครงการ หรือกิจกรรมต่างๆ ร่วมกับบุคคลภายนอกหน่วยงานของตน (แต่เป็นหน่วยงานภายใน สมอ.)
มอบหมายงานที่เกี่ยวข้องกับการเจรจา การนำเสนอข้อมูล การสร้างอิทธิพลต่อผู้อื่น และอาศัยทักษะการพูด การสร้างความน่าเชื่อถือ และการยอมรับเป็นสำคัญ
มอบหมายให้เป็นผู้จัดการโครงการต่างๆ ที่ต้องทำหน้าที่ในการแบ่งหน้าที่ความรับผิดชอบให้แก่สมาชิกภายในโครงการนั้นๆ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการสร้างความน่าเชื่อถือของข้อมูล ผลงาน หรือวิสัยทัศน์ที่จะนำเสนอต่อผู้อื่น
เน้นย้ำถึงความสำคัญของการแลกเปลี่ยนข้อมูลกับผู้อื่น 
การฝึกอบรม
การนำเสนอและการพูดต่อสาธารณชนอย่างมีพลัง', 'ชื่อหลักสูตรการฝึกอบรม: การนำเสนอและการพูดต่อสาธารณชนอย่าง
มีพลัง
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิดเรื่องการสื่อสารที่มีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิดเรื่องการนำเสนอที่ชนะใจคน
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการพื้นฐานของการสื่อสารและนำเสนอที่มีประสิทธิภาพ
ข้อผิดพลาดในการสื่อสารและนำเสนอที่พบบ่อยและแนวทางในการป้องกัน
หลักการเรื่อง Emotional intelligence และการเข้าใจใจเขาใจเรากับการสื่อสาร
แนวคิดเบื้องต้นเกี่ยวกับภาษาและพฤติกรรมมนุษย์ (Myers-Briggs Type Indicator) เพื่อให้สามารถตอบสนองและสื่อสารได้อย่างมีประสิทธิภาพสูงสุด
กระบวนการในการฟังที่ดี และกระบวนการเขียนที่มีประสิทธิภาพ
กระบวนการในการตั้งคำถามและตอบสนองที่เหมาะสมเพื่อความชัดเจนในการสื่อสาร
เครื่องมือและแนวคิดเรื่องการโน้มน้าวและเข้าถึงใจคน 
กระบวนการนำเสนอที่ชนะใจคน (How To Make Winning Presentations) 
นอกจากนั้นยังควรมีการจัดกิจกรรมเป็น Workshop ให้ผู้ฝึกอบรมเข้าใจกรอบแนวคิดและเครื่องมืออย่างถูกต้อง
ระยะเวลาของหลักสูตร  ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล 
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(33, 3, '202', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ถ่ายทอดวิสัยทัศน์ของหน่วยงานที่ดูแลรับผิดชอบอยู่ โดยต้องอาศัยศิลปะการโน้มน้าวจูงใจกลุ่มบุคคลต่างๆ ที่มีความหลากหลาย รวมทั้งวิธีที่สร้างแรงบันดาลใจ ความกระตือรือร้น และความร่วมแรงร่วมใจให้บรรลุวิสัยทัศน์นั้น
มอบหมายให้ทำงานกับบุคคลที่ทำงานได้ด้วยยากที่ต้องอาศัยการโน้มน้าวใจ การสร้างแรงบันดาลใจ และการปลูกจิตสำนึกในการทำงาน
มอบหมายงานให้เป็นตัวแทน หรือตัวกลางในการเสนอทางเลือกหรือหาข้อสรุปการเจรจาให้กับกลุ่มบุคคลต่างๆ 
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการเป็นผู้นำในการสื่อสาร ถ่ายทอด โน้มน้าวจูงใจ และนำพากลุ่มบุคคลที่มีความแตกต่างให้บรรลุเป้าหมาย และวิสัยทัศน์ร่วมกัน
การฝึกอบรม
การโน้มน้าวจูงใจ', 'ชื่อหลักสูตรการฝึกอบรม: การโน้มน้าวจูงใจ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดและเครื่องมือในการคิดกลยุทธ์ในการชักจูงใจ (Influence Strategies)
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดเรื่ององค์ประกอบในการชักจูงใจ (What create Influence) เช่น การมี Self Motivation การนำเสนอที่มีประสิทธิผล (Good Communication) และการมีความสามารถในการนำ 
กระบวนการในการชักจูงใจ ผ่านการวิเคราะห์ อะไรคือสิ่งที่เราต้องการชักจูง (Want) ใครคือผู้รับ (Player) และสถานการณ์ (Is) 
ที่มาของขุมพลัง (Power) ในการจูงใจ รวมถึง
กลยุทธ์ (Strategies) และเครื่องมือในการชักจูงใจ                          ข้อดี-ข้อเสียและความเหมาะสมในการนำไปใช้
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมิน                                                              เมื่อเริ่มการฝึกอบรม และสิ้น                                                                 สุดการฝึกอบรมว่ามีระดับการ                                                         พัฒนาความเข้าใจหรือไม่                                                              เพียงใด นอกจากนั้นให้                                                                   ผู้บังคับบัญชาประเมินว่าได้                                                                      มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(34, 4, '202', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงาน โครงการ หรือกิจกรรมที่ต้องอาศัยการคิดนอกกรอบ นวัตกรรมใหม่ๆ และความคิดสร้างสรรค์ 
การโค้ช (Coaching)
แลกเปลี่ยนประสบการณ์กับผู้เชี่ยวชาญด้านความคิดสร้างสรรค์ การคิดนอกกรอบ และการสร้างนวัตกรรมใหม่ๆ ให้แก่องค์กร
เปิดโอกาสให้ไปดูงานภายในองค์กรทั้งในประเทศ และต่างประเทศที่มีการปรับเปลี่ยน หรือสร้างนวัตกรรมใหม่ๆ 
การฝึกอบรม
การบริหารนวัตกรรมสร้างสรรค์', 'ชื่อหลักสูตรการฝึกอบรม: การบริหารนวัตกรรมสร้างสรรค์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด เรื่องการบริหารนวัตกรรมสร้างสรรค์ 
กรอบเนื้อหาของหลักสูตร
ความสำคัญและกรอบแนวคิดในเรื่องการปรับปรุงและสร้างสรรค์สิ่งใหม่ 
Model กระบวนการและเครื่องมือในการปรับปรุงวิธีการใหม่ (Incremental Innovation) หรือการสร้างนวัตกรรมขั้นสูง (Radical Innovation) 
กลยุทธ์ในการสนับสนุนให้เกิดนวัตกรรมใหม่ในองค์กร การวัดผล และการใช้ประโยชน์จากวิธีการใหม่หรือนวัตกรรมสร้างสรรค์ที่คิดขึ้น ระยะเวลาของหลักสูตร 8 ชั่วโมง
แนวทางการประเมินผล
ผู้เข้าอบรมจะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถสนับสนุนให้เกิดวิธีการหรือความสร้างสรรค์ใหม่ๆ ได้มากน้อยเพียงได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(35, 5, '202', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้กำหนดวิสัยทัศน์ เป้าหมาย กลยุทธ์ และทิศทางการดำเนินงานของหน่วยงาน หรือองค์กร ที่สอดคล้องกับบริบทของประเทศไทย
มอบหมายงานให้เป็นผู้รับผิดชอบในการพัฒนางานหรือโครงการขนาดใหญ่ที่มีผลกระทบระดับองค์กรที่ต้องอาศัยความร่วมมือกับบุคคลภายในทั้งหมดองค์กร
มอบหมายให้เตรียมแผนงาน แผนกลยุทธ์ แผนปฏิบัติการ หรือแผนยุทธศาสตร์ล่วงหน้า เพื่อฝึกการคาดการณ์สถานการณ์ในปัจจุบัน และในอนาคต 
การโค้ช (Coaching)
แลกเปลี่ยนประสบการณ์กับผู้เชี่ยวชาญด้านกำหนดวิสัยทัศน์ เป้าหมาย กลยุทธ์ และทิศทางการดำเนินงานขององค์กร 
การฝึกอบรม
ผู้นำที่มีวิสัยทัศน์ 
การวางแผนเชิงกลยุทธ์', 'ชื่อหลักสูตรการฝึกอบรม: ผู้นำที่มีวิสัยทัศน์ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมได้รับการพัฒนาให้พร้อมที่จะเป็นนักบริหารระดับสูงที่มีวิสัยทัศน์ มีความสามารถในการนำการแข่งขันในระดับสากลทั้งในปัจจุบันและอนาคต และพร้อมที่จะเป็นกลไกหลักของรัฐในการนำการเปลี่ยนแปลง  และขับเคลื่อนระบบราชการ ให้เกิดผลสัมฤทธิ์ตามนโยบายและยุทธศาสตร์ โดยมีเป้าหมายเพื่อประโยชน์สุขของประชาชน
เพื่อให้ผู้เข้าอบรมเป็นผู้นำที่มีวิสัยทัศน์ (Visionary Leadership) มีคุณธรรม ยึดประโยชน์ประเทศชาติและประชาชนเป็นหลัก  
เพื่อให้ผู้เข้าอบรมมีศักยภาพด้านการบริหารจัดการที่ดี สามารถนำการเปลี่ยนแปลง และขับเคลื่อนนโยบายและยุทธศาสตร์ให้เกิดผลสำเร็จตามความคาดหวังของผู้ที่เกี่ยวข้องมีความพร้อมที่จะบริหารงานภายใต้สภาวะการแข่งขันที่สูงขึ้นทั้งในปัจจุบันและอนาคต
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
การพัฒนาภาวะผู้นำ
การปรับกระบวนทัศน์ทางความคิด  (Leadership and Paradigm Shift Development) 
การนำองค์ความรู้สู่ผลสัมฤทธิ์  (Driving Knowledge Management  Towards High Performance Achievement) 
การศึกษาดูงานในกรุงเทพฯ/ต่างจังหวัด (ประมาณ 4-5  ครั้ง)  และมีการศึกษาดูงานในต่างประเทศ 
การนำเสนอโครงการและนำไปสู่การปฏิบัติ  (Project Presentation and Implementation) ', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(36, 1, '203', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้นำกลุ่มการศึกษาวิเคราะห์หรือ Focus Group วิเคราะห์ข้อมูลเพื่อหารูปแบบ และภาพรวมของสิ่งที่ศึกษา 
มอบหมายให้เข้าร่วมในโครงการใหม่ๆ หรือเป็นสมาชิกในการจัดทำกลยุทธ์ของหน่วยงาน
หมุนเวียนไปทำงานในฝ่ายกลยุทธ์หรือฝ่ายวางแผนขององค์กรหรือหน่วยงานในด้านการจัดทำนโยบาย
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการจัดทำกลยุทธ์ที่เกี่ยวข้องกับหน่วยงานที่ต้องรับผิดชอบ
การฝึกอบรม
การรับฟังการสื่อสารกลยุทธ์องค์กร', 'ชื่อหลักสูตรการฝึกอบรม: การรับฟังการสื่อสารกลยุทธ์องค์กร
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความเข้าใจเรื่องกลยุทธ์และเป้าหมายขององค์กร
เพื่อให้ผู้เข้าอบรมมีโอกาสในการแลกเปลี่ยนกับผู้บริหาร เพื่อสร้างความเข้าใจที่ชัดเจนขึ้นในยุทธศาสตร์ขององค์กร
กรอบเนื้อหาของหลักสูตร
รับฟังเรื่องวิสัยทัศน์และยุทธศาสตร์ขององค์กร
รับฟังกลยุทธ์และเป้าหมายในการบรรลุตามยุทธศาสตร์ขององค์กร
รับฟังการเชื่อมโยงแผนกลยุทธ์และเป้าหมายขององค์กรกับเป้าหมายของหน่วยงาน
ร่วมวางแผนเชื่อมโยงกับตำแหน่งงานของตน
ระยะเวลาของหลักสูตร
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(37, 2, '203', 'การมอบหมายงานและการหมุนเวียนงาน
ให้เข้าสัมมนาหรือร่วมประชุมกับผู้บริหารระดับสูง 
มอบหมายให้เข้าร่วมในโครงการใหม่ๆ ที่เกี่ยวข้องกับกลยุทธ์องค์กร
มอบหมายให้เขียนกลยุทธ์ของหน่วยงาน
มอบหมายให้วิเคราะห์ความสามารถในการแข่งขัน (Competitive Analysis) รวบรวมข้อมูลและประยุกต์ใช้ความรู้ทางการตลาด ตั้งสมมติฐาน และเขียนเป็นบทสรุปผู้บริหาร
มอบหมายให้เป็นประสานหรือบูรณาการแผนกลยุทธ์ต่างๆ ของหน่วยงาน
มอบหมายให้ประสานงานโครงการที่มีหลายฝ่ายร่วมกันจัดทำโดยในการดำเนินโครงการต้องมีการคิดวิเคราะห์จุดดี จุดเด่น โอกาสและอุปสรรคที่อาจเกิดขึ้น เพื่อนำไปกำหนดกลยุทธ์ต่อไป
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการประยุกต์ใช้ประสบการณ์หรือบทเรียนต่างๆ มาจัดทำกลยุทธ์ที่เกี่ยวข้องกับหน่วยงาน
การฝึกอบรม
การคิดเชิงกลยุทธ์', 'ชื่อหลักสูตรการฝึกอบรม: การคิดเชิงกลยุทธ์ (Strategic Thinking)
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด ถึงความสำคัญของการคิดในเชิงกลยุทธ์ในระดับองค์กรในระดับหน้าที่รับผิดชอบของงาน 
เพื่อให้ผู้เข้าอบรมเข้าใจ และสามารถนำไปใช้ถึงวิธีการคิด วิเคราะห์ และมองหาโอกาสในเชิงกลยุทธ์ โดยใช้ข้อมูล หลักการทฤษฎี 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญของการคิดเชิงกลยุทธ์ ต่อความสำเร็จขององค์กร
การจัดทำ SWOT (Strength, Weakness, Opportunities, Treat)
ความแตกต่างในการคิดเชิง Corporate Strategic และ Functional Operation
การคิดเชิงกลยุทธ์ต้องมีองค์ประกอบอย่างไรบ้างและมีขั้นตอนอย่างไร
ข้อจำกัดของการที่ผู้บริหารไม่สามารถคิดในเชิงกลยุทธ์ได้ และวิธีการขจัดข้อจำกัดนั้น
มี Workshop อย่างน้อย 1 ครั้งเพื่อให้ผู้ฝึกอบรมได้ศึกษาและลองใช้ข้อมูล เพื่อตัดสินใจในเชิงกลยุทธ์
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด เมื่อผ่านการฝึกอบรม โดยจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(38, 3, '203', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นประสานหรือบูรณาการแผนกลยุทธ์ต่างๆ ของหน่วยงาน
มอบหมายให้ประสานงานโครงการที่มีหลายฝ่ายร่วมกันจัดทำโดยในการดำเนินโครงการต้องมีการคิดวิเคราะห์จุดดี จุดเด่น โอกาสและอุปสรรคที่อาจเกิดขึ้น เพื่อนำไปกำหนดกลยุทธ์ต่อไป
มอบหมายให้ศึกษา Best Practice หรือผลการวิจัยต่างๆ เพื่อนำมาเป็นข้อมูลในการจัดทำกลยุทธ์ขององค์กร
มอบหมายให้เข้าร่วมในโครงการใหม่ๆ ที่เกี่ยวข้องกับกลยุทธ์ขององค์กรหรือ ที่ต้องเชื่อมโยงภารกิจหลายๆ หน่วยงานเข้าด้วยกัน
มอบหมายให้วิเคราะห์ความได้เปรียบเชิงยุทธศาสตร์/กลยุทธ์ (Competitive Analysis) ขององค์กรและเขียนเป็นบทสรุปผู้บริหาร
มอบหมายให้ประยุกต์ประสบการณ์และบทเรียนต่างๆ มาใช้กำหนดข้อเสนอหรือแนวทาง (Implication) เชิงกลยุทธ์ที่สนับสนุนให้หน่วยงานที่รับผิดชอบบรรลุภารกิจที่กำหนดไว้
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการจัดทำกลยุทธ์ในระดับหน่วยงาน 
การฝึกอบรม
การจัดทำกลยุทธ์', 'ชื่อหลักสูตรการฝึกอบรม: การจัดทำกลยุทธ์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดถึงความสำคัญของการคิดในเชิง      กลยุทธ์ในระดับองค์กรในระดับหน้าที่รับผิดชอบของงาน 
เพื่อให้ผู้เข้าอบรมเข้าใจ และสามารถนำไปใช้ถึงวิธีการคิด วิเคราะห์ และมองหาโอกาสในเชิงกลยุทธ์ โดยใช้ข้อมูล และหลักการทฤษฎี 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญของการคิดเชิงกลยุทธ์ต่อความสำเร็จขององค์กร
ระดับของกลยุทธ์ตามความรับผิดชอบ
ความแตกต่างในการคิดเชิง Corporate Strategic และ Functional Operation
การคิดเชิงกลยุทธ์ต้องมีองค์ประกอบอย่างไรบ้างและมีขั้นตอนอย่างไร
ข้อมูลที่จำเป็นต้องใช้เพื่อการคิด และมองปัญหาในเชิงกลยุทธ์และโอกาสในทางธุรกิจ
ข้อจำกัดของการที่ผู้บริหารไม่สามารถคิดในเชิงกลยุทธ์ได้ และวิธีการขจัดข้อจำกัดนั้น
กิจกรรมเพื่อผู้ฝึกอบรมได้ศึกษาและลองใช้ข้อมูล เพื่อตัดสินใจในเชิง กลยุทธ์
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด เมื่อผ่านการฝึกอบรม โดยจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(39, 4, '203', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นประสานหรือบูรณาการแผนกลยุทธ์ต่างๆ ของหน่วยงานหรือของหลายๆ หน่วยงาน
มอบหมายให้กำหนดกลยุทธ์ แผนหรือนโยบายขององค์กรหรือหน่วยงาน หลังจากที่มีการประเมินและสังเคราะห์สถานการณ์ ประเด็น หรือปัญหาทางเศรษฐกิจ สังคม การเมืองภายในประเทศและต่างประเทศที่ซับซ้อน
คิดแผนหรือกลยุทธ์เชิงรุกเพื่อตอบสนองโอกาสหรือประเด็นปัญหาที่เกิดขึ้นจากสถานการณ์ภายในประเทศหรือต่างประเทศที่เปลี่ยนแปลงไปเพื่อให้องค์กรมีความได้เปรียบ (Competitive Advantage) ในทางธุรกิจหรือการดำเนินการ 
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการจัดทำกลยุทธ์ในระดับองค์กรที่ตอบสนองการเปลี่ยนแปลงจากภายนอก
การฝึกอบรม
Blue Ocean Strategy', 'ชื่อหลักสูตรการฝึกอบรม: Blue Ocean Strategy
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการสร้าง Coaching Culture
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
Blue Ocean Strategy คืออะไร
กรอบแนวคิดเรื่อง Blue Ocean Analysis Framework
กระบวนการสร้าง Blue Ocean Strategy เช่น การมองภาพใหญ่ (Focus on Big Picture, Not the Numbers) การกำหนดไปมากกว่าอุปสงค์ปัจจุบัน (Reach Beyond Existing Demand) การแก้ไขอุปสรรคของการดำเนินงาน (Overcome Organizational Hurdles) เป็นต้น
กระบวนการนำไปใช้จริง
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(40, 5, '203', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้นำในการปรับเปลี่ยนบริบทในการดำเนินการทางธุรกิจขององค์กร
มอบหมายให้ปรับปรุงแก้ไขหน่วยงาน (Turnaround) หรือแก้ไขปัญญาใหญ่ขององค์กร
มอบหมายให้สรรสร้างและบูรณาการองค์ความรู้ใหม่มาใช้ในงานกลยุทธ์ โดยพิจารณาจากบริบทประเทศไทยในภาพรวม เพื่อให้ได้กลยุทธ์ที่แตกต่างและสร้างประโยชน์สูงสุดกับองค์กร
หมุนเวียนงานไปเป็นผู้นำในหน่วยงานที่บูรณาการกลยุทธ์ขององค์กร
การฝึกอบรม
การบริหารเชิงกลยุทธ์ และเครื่องมือในการบริหารเชิงกลยุทธ์', 'ชื่อหลักสูตรการฝึกอบรม: การบริหารเชิงกลยุทธ์ และเครื่องมือในการ
บริหารเชิงกลยุทธ์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเรียนรู้หลักการการบริหารเชิงกลยุทธ์ และเครื่องมือในการบริหารเชิงกลยุทธ์ที่จะช่วยให้สามารถสร้างความสามารถในการแข่งขันได้อย่างเป็นระบบ และสามารถปรับเปลี่ยนกลยุทธ์ใหม่ให้สอดคล้องกับการพัฒนาของประเทศ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
	ส่วนที่ 1: การเตรียมการสร้างกระบวนการบริหารเชิงกลยุทธ์ 
ขั้นตอนการบริหารเชิงกลยุทธ์ 
การสร้างทีมงานบริหารเชิงกลยุทธ์ 
การกำหนดกรอบเวลาในการบริหารเชิงกลยุทธ์ 
การเตรียมความพร้อมในเรื่องข้อมูลที่จะใช้ในการบริหารเชิงกลยุทธ์ 
การเตรียมอุปกรณ์ และเครื่องมือในการสนับสนุนการบริหารเชิงกลยุทธ์ 
	ส่วนที่ 2: การกำหนดกลยุทธ์ (Strategy Formulation)
การออกแบบ Business Model ด้วย เทคนิค Value Chain Analysis, Generic Value Chain และ Customer Segmentation 
การกำหนด Mission ด้วย Mission Defining Technique 
การวิเคราะห์ปัจจัยภายนอก ด้วย PEST Analysis และ Weighted Scoring 
การวิเคราะห์สภาวะการแข่งขัน ด้วย Five Forces Model และ Weighted Scoringการวิเคราะห์จุดแข็ง จุดอ่อนของธุรกิจ และคู่แข่ง ด้วย Balanced Scorecard 
การวิเคราะห์ตำแหน่งการแข่งขัน ด้วยการ Benchmarking ภายใต้เทคนิค Balanced Scorecard 
การกำหนดทิศทางธุรกิจ (Business Scenarios) ด้วย GE matrix 
การวิเคราะห์ SWOT ด้วยเทคนิค SWOT Matrix 
การกำหนด Vision ด้วย Vision Defining Technique 
การกำหนดกลยุทธ์ จาก Business Scenarios, SWOT Matrix และ KPIs Techniques 
	ส่วนที่ 3: การนำแผนกลยุทธ์ไปปฏิบัติ และการติดตาม/ประเมินผล (Strategy Implementation & Monitor and Evaluation) ด้วย Scorecard Cockpit 
มีการจำลองสถานการณ์ทางธุรกิจ และการแลกเปลี่ยนความคิด ประสบการณ์ในลักษณะ Group Discussion 
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด เมื่อผ่านการฝึกอบรม โดยจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(41, 1, '204', 'การมอบหมายงานและการหมุนเวียนงาน
เมื่อมีการเปลี่ยนแปลงเกิดขึ้น มอบหมายให้ไปรับฟังความเปลี่ยนแปลงดังกล่าวแล้วออกความคิดเห็นว่าการเปลี่ยนแปลงดังกล่าวจะมีผลต่อการทำงานในหน่วยงานอย่างไร
มอบหมายให้เป็นผู้รับผิดชอบโครงการหรือกิจกรรมต่างๆ ที่ทำงานร่วมกับกลุ่มบุคคลที่ไม่เคยร่วมงานกันมาก่อน
มอบหมายงาน โครงการ หรือกิจกรรมนอกสถานที่ ต่างจังหวัด หรือต่างประเทศ เพื่อฝึกการปรับตัวให้สอดคล้องกับการเปลี่ยนแปลง
การคิดและพฤติกรรม
ฝึกตนให้เป็นผู้ที่มีความคล่องตัวในการปฏิบัติงาน และยอมรับกับการเปลี่ยนแปลงต่างๆ ที่เกิดขึ้น
หมั่นเปลี่ยนแปลง ปรับเปลี่ยนพฤติกรรมให้สอดคล้องกับสิ่งที่องค์กรกำหนด
ในขณะที่ประสบความยากลำบากในงาน ให้พยายามปรับตัวให้เคยชิน โดยอาจต้องตัดภาพความสะดวกสบายที่เคยได้รับในอดีต
อ่านหนังสือธรรมะ เพื่อให้เลิกยึดติดกับวัตถุแสดงฐานะทางสังคม หรือระดับอาวุโสในงาน
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการเป็นผู้นำการปรับเปลี่ยนเพื่อให้หน่วยงานบรรลุเป้าหมายได้อย่างมีประสิทธิภาพสูงสุด
การฝึกอบรม
การปรับตัว', 'ชื่อหลักสูตรการฝึกอบรม: การปรับตัว
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด หลักการ และวิธีการการปรับตัวให้สอดคล้องในแต่ละสถานการณ์ 
เพื่อให้ผู้เข้าอบรมสามารถปรับตัว และทำงานร่วมกับผู้อื่นที่มีหลากหลายได้ดี
กรอบเนื้อหาของหลักสูตร
ภาคทฤษฎี: กรอบแนวคิด หลักการ และวิธีการปรับตัวให้ถูกต้องในแต่ละสถานการณ์ 
ภาคปฏิบัติ: การกำหนดสถานการณ์จริงที่มีความแตกต่าง และทดลองให้ปฏิบัติจริง
ระยะเวลาของหลักสูตร 
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(42, 2, '204', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้คิดประโยชน์ของโครงการใหม่ๆ ของหน่วยงาน
มอบหมายให้กำหนดแนวทางในการปรับปรุงแก้ไขปัญหาในหน่วยงาน
มอบหมายให้มีการอภิปรายกลุ่มเพื่อกำหนดขอบเขตของการปรับเปลี่ยนที่ควรเกิดขึ้นภายในหน่วยงานที่สมาชิกสามารถยอมรับได้
การคิดและพฤติกรรม
เมื่อมีการเปลี่ยนแปลงเกิดขึ้น พยายามเรียนรู้และปรับตัวให้สอดคล้องกับการปรับเปลี่ยนหรือเปลี่ยนแปลงนั้น
พยายามคิดเชิงบวกและเชื่อว่าการเปลี่ยนแปลงจะนำไปสู่สิ่งที่ดีขึ้น
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการเป็นผู้นำการปรับเปลี่ยนเพื่อให้หน่วยงานบรรลุเป้าหมายได้อย่างมีประสิทธิภาพสูงสุด
การฝึกอบรม
การคิดเชิงบวก (Positive Thinking)', 'ชื่อหลักสูตรการฝึกอบรม: การคิดเชิงบวก (Positive Thinking)*
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความคิดเชิงบวกมากขึ้น
เพื่อให้ผู้เข้าอบรมมีการอภิปรายถึงเหตุผลในการหลีกเลี่ยงการเปลี่ยนแปลง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักและแนวคิดเรื่องการคิดเชิงบวก
องค์ประกอบและความหมายของการคิดเชิงบวก
ปัจจัยเอื้อต่อการเปลี่ยนแปลง
กระบวนการพัฒนาขีดความสามารถในการคิดเชิงบวก
ทักษะต่างๆ ที่จำเป็นต่อการสร้างการคิดเชิงบวก (เช่น ทักษะคิดมุ่งพัฒนา ทักษะคิดมุ่งทางออก ทักษะมองโลกในแง่ดี ทักษะทบทวนตนเอง เป็นต้น)
ระยะเวลาของหลักสูตร
1 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่
หมายเหตุ* ประยุกต์จากบทความของ ดร.นพ. ยุทธนา ภาระนันท์
', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(43, 3, '204', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้กำหนดแนวทางในการปรับปรุงแก้ไขปัญหาในหน่วยงาน
เปิดโอกาสให้ได้ลองปฏิบัติงานหรือโอนย้ายไปรับผิดชอบโครงการที่กำลังอยู่ในช่วงของการบริหารการเปลี่ยนแปลง เพื่อให้เกิดการยอมรับในข้อเสนอ
มอบหมายงานให้เป็นตัวแทนในการนำเสนอทางเลือกใหม่ๆ เพื่อให้เกิดการเปลี่ยนแปลงขึ้นกับหน่วยงาน องค์กร หรือสังคมในภาพรวม
มอบหมายให้เขียนบทความเพื่อกระตุ้นและสร้างแรงจูงใจให้ผู้ที่เกี่ยวข้องเห็นความสำคัญของการปรับเปลี่ยนที่เกิดขึ้น
เมื่อจบโครงการและมีผลลัพธ์ที่เป็นที่ประจักษ์แล้ว ก็มอบหมายให้เป็นผู้อธิบายความจำเป็นและประโยชน์จากผลลัพธ์ของโครงการ
การคิดและพฤติกรรม
เมื่อมีการเปลี่ยนแปลงเกิดขึ้น พยายามเข้าไปมีส่วนร่วมและสนับสนุนการปรับเปลี่ยนที่เกิดขึ้น
พยายามพูดเชิงบวกให้ผู้อื่นสบายใจในการเปลี่ยนแปลง เช่นสนับสนุนว่าการเปลี่ยนแปลงจะนำไปสู่สิ่งที่ดีขึ้น
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการเป็นผู้นำการปรับเปลี่ยนเพื่อให้หน่วยงานบรรลุเป้าหมายได้อย่างมีประสิทธิภาพสูงสุด
การฝึกอบรม
การโน้มน้าวจูงใจ', 'ชื่อหลักสูตรการฝึกอบรม: การโน้มน้าวจูงใจ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดและเครื่องมือในการคิดกลยุทธ์ในการชักจูงใจ (Influence Strategies)
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดเรื่ององค์ประกอบในการชักจูงใจ (What create Influence) เช่น การมี Self Motivation การนำเสนอที่มีประสิทธิผล (Good Communication) และการมีความสามารถในการนำ 
กระบวนการในการชักจูงใจ ผ่านการวิเคราะห์ อะไรคือสิ่งที่เราต้องการชักจูง (Want) ใครคือผู้รับ (Player) และสถานการณ์ (Is) 
ที่มาของขุมพลัง (Power) ในการจูงใจ รวมถึง
กลยุทธ์ (Strategies) และเครื่องมือในการชักจูงใจ                          ข้อดี-ข้อเสียและความเหมาะสมในการนำไปใช้
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมิน                                                              เมื่อเริ่มการฝึกอบรม และสิ้น                                                                 สุดการฝึกอบรมว่ามีระดับการ                                                         พัฒนาความเข้าใจหรือไม่                                                              เพียงใด นอกจากนั้นให้                                                                   ผู้บังคับบัญชาประเมินว่าได้                                                                      มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(44, 4, '204', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานที่เกี่ยวกับการคิดค้นแผนงาน วิธีการหรือแนวทางการปฏิบัติงานใหม่ของหน่วยงาน และนำให้เกิดการเปลี่ยนแปลงตามแผนที่กำหนดไว้
มอบหมายงานที่ต้องวางแผนวิธีการใหม่ เพื่อให้งานประสบผลสำเร็จสูงสุด
มอบหมายให้วางแผนการเปลี่ยนแปลงที่จะเกิดขึ้นกับผู้รับบริการ ผู้อื่น หรือหน่วยงานต่างๆ โดยผลลัพธ์ต้องสามารถทำให้ผู้รับบริการ ผู้อื่น หรือหน่วยงานต่างๆ อยากมีส่วนร่วมในการเปลี่ยนแปลงนั้น
มอบหมายงานที่ต้องการการท้าทาย (Challenging) สภาวการณ์ที่เป็นอยู่ด้วยการพิจารณาว่าจะสามารถพัฒนาส่วนใดให้ดีขึ้นได้บ้าง ตลอดจนชี้ระบุถึงสิ่งต่างๆ ที่ต้องเปลี่ยนแปลง จากนั้นให้ลงมือปฏิบัติการใดๆ ที่ทำให้ผู้อื่นได้เข้าใจถึงความจำเป็นต้องมีการเปลี่ยนแปลงต่างๆ ดังกล่าว 
มอบหมายให้เป็นผู้นำในการริเริ่มโครงการต่างๆ ที่ช่วยให้การเปลี่ยนแปลงต่างๆ สามารถเกิดขึ้นมาได้จริง
การคิดและพฤติกรรม
เมื่อมีการเปลี่ยนแปลงเกิดขึ้น พยายามวางแผนการเปลี่ยนแปลงด้วยการใช้ Force-Field Analysis Method เช่น อะไรเป็นปัจจัยช่วยให้เกิดการเปลี่ยนแปลงที่มีประสิทธิภาพ (What forces will help the change happen effectively?) และอะไรเป็นปัจจัยที่จะเป็นอุปสรรคในการเปลี่ยนแปลง (What factors will hinder the change?)
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการบริหารการเปลี่ยนแปลง
การฝึกอบรม
การบริหารการเปลี่ยนแปลง', 'ชื่อหลักสูตรการฝึกอบรม: การบริหารการเปลี่ยนแปลง
วัตถุประสงค์
เพื่อให้ผู้เข้ารับการอบรมมีกรอบแนวคิด ความรู้ ความเข้าใจ รวมทั้งกระบวนการในการบริหารความเปลี่ยนแปลง (Step by Step Approach to Change Management)
เพื่อให้ผู้เข้ารับการอบรมสามารถช่วยหน่วยงานตน/หน่วยงานอื่น ในการดำเนินการเปลี่ยนแปลง 
เพื่อให้ผู้เข้ารับการอบรมตระหนักถึงความสำคัญของการเปลี่ยนแปลง และเริ่มสร้างความมีส่วนร่วมในการบริหารการเปลี่ยนแปลง (Increase Ownership of the Change Programme)
กรอบเนื้อหาของหลักสูตร
กรอบแนวคิดในเรื่องการบริหารความเปลี่ยนแปลง (Change Management) และหลักความพร้อมในการเปลี่ยนแปลง (Change Readiness Model)
การเตรียมความพร้อมเพื่อการเปลี่ยนแปลง (Readiness for Change)
ทำไมคนจึงต่อต้านการเปลี่ยนแปลง และจะมีวิธีการอย่างไรในการรับมือกับการต่อต้านและสร้างให้เกิดการยอมรับ (Commitment)
การบริหารความขัดแย้ง ตามทฤษฎีของ Thomas-Kilmann (Competing, Accommodating, Avoiding, Compromising และ Collaborating)บทบาทในการบริหารความเปลี่ยนแปลง (Roles in Change)
หน้าที่ของบุคคลต่างๆ ในการเปลี่ยนแปลง (Solver, Doer, Checker, Caregiver และ Knower) และกระบวนการต่างๆ ในการสร้างบทบาทหน้าที่และความรับผิดชอบ (Responsibility Codes) เช่น ใครมีหน้าที่ตัดสินใจเรื่องใด (D) ใครเป็นเจ้าภาพ (O) ใครเป็นผู้ติดตามผล (P) เป็นต้น
กระบวนการในการกำหนดผู้ที่มีส่วนได้ส่วนเสียในการเปลี่ยนแปลง
ประเด็นต่างๆ ในการเปลี่ยนแปลง (Issues in Implementing Change)
กระบวนการและเครื่องมือในการสื่อสารประชาสัมพันธ์และสร้างการยอมรับ
กระบวนการและเครื่องมือในการประเมินผลกระทบ (Impact Analysis) 
ระยะเวลาของหลักสูตร
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(45, 5, '204', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้นำในการปรับเปลี่ยนบริบทในการดำเนินการงานของ หน่วยงาน หรือองค์กร
มอบหมายให้เป็นผู้นำในการปรับเปลี่ยนเรื่องใดเรื่องหนึ่งขององค์กร เช่น การบริหารงานบุคคล การบริหารงานกฎหมาย การบริหารโครงการ ฯลฯ เป็นต้น โดยผลลัพธ์ของการปรับเปลี่ยนนั้นต้องมีการวางแผนให้ดำเนินไปได้อย่างราบรื่นและประสบความสำเร็จ
มอบหมายให้ปรับปรุงแก้ไขหน่วยงาน (Turnaround) หรือแก้ไขปัญหาใหญ่ขององค์กร
การคิดและพฤติกรรม
หมั่นคิดและติดตามสถานการณ์ต่างๆ ทั้งในประเทศและต่างประเทศ เพื่อให้สามารถปรับเปลี่ยนทิศทางที่จะผลักดันให้เกิดการเปลี่ยนแปลงที่ต่อเนื่องและยั่งยืน
หมั่นคาดการณ์ถึงทิศทาง แนวโน้มในอนาคต และขอบเขตขององค์กรที่รับผิดชอบอยู่
หมั่นแลกเปลี่ยนเรียนรู้กับผู้ทรงคุณวุฒิที่มีความเชี่ยวชาญด้านการนำการเปลี่ยนแปลงที่มีผลกระทบโดยกว้างในระดับองค์กรหรือประเทศ ทั้งในและนอกประเทศ เพื่อแลกเปลี่ยนประสบการณ์
การฝึกอบรม
การวางแผนเชิงกลยุทธ์ 
การจัดการองค์กร', 'วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด และให้ความสำคัญของการคิดเชิงกลยุทธ์
เพื่อให้ผู้เข้าอบรมเข้าใจ และสามารถนำไปใช้ถึงวิธีการคิด วิเคราะห์ และมองหาโอกาสในเชิงกลยุทธ์ โดยใช้ข้อมูล และหลักการทฤษฎีมาประยุกต์ให้เกิดประโยชน์
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญ และองค์ประกอบของการคิดเชิงกลยุทธ์ เพื่อความสำเร็จขององค์กร
ขั้นตอน และกระบวนการในการ Moving from Operational Manager to a Strategic Thinker 
หลักการวิเคราะห์จุดแข็ง จุดอ่อน โอกาส และข้อจำกัดของธุรกิจ (SWOT Analysis) รวมทั้งการวิเคราะห์คู่แข่ง และตลาด
ข้อมูลที่จำเป็นต้องใช้เพื่อการคิด และมองปัญหาในเชิงกลยุทธ์และโอกาสในทางธุรกิจ
ข้อจำกัดของการที่ผู้บริหารไม่สามารถคิดในเชิงกลยุทธ์ได้ และวิธีการขจัดข้อจำกัด
แบบทดสอบ (Case Study) ก่อนการเข้ามีการสัมมนา เพื่อวัดการคิดเชิงกลยุทธ์เพื่อให้ผู้บริหารได้ศึกษาและลองใช้ข้อมูล เพื่อตัดสินใจในเชิงกลยุทธ์
การจำลองสถานการณ์ และแบบฝึกหัดการออกแบบธุรกิจ และการตัดสินใจเชิงธุรกิจ เพื่อสร้างข้อได้เปรียบทางธุรกิจ และสร้างผลประโยชน์ในระยะยาว
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
ผู้เข้าอบรมจะถูกประเมินด้วยแบบทดสอบก่อนการเข้าสัมมนาเพื่อวัดระดับความสามารถ และในระหว่างการสัมมนาจะมีแบบฝึกหัดเพื่อวัดผลการคิดเชิง    กลยุทธ์ด้านการออกแบบธุรกิจ และเมื่อสิ้นสุดการฝึกอบรมจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้เพื่อให้ผู้บริหารได้ทราบถึงหลักการบริหารจัดการ กระบวนการจัดการ และ หลักการใช้ทรัพยากรอย่างคุ้มค่า ให้เกิดประสิทธิภาพ และประโยชน์สูงสุดแก่องค์กร
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
เป็นการนำเสนอทฤษฎีการบริหารจัดการยุคใหม่
หัวใจของการบริหารจัดการองค์กร (Planning, Organizing, Leading, Controlling)
การปรับใช้ในหลักการบริหารจัดการที่มีประสิทธิภาพ
นำเสนอเทคนิคการบริหารจัดการที่มีประสิทธิภาพ
เทคนิคการบริหารจัดการองค์กร เพื่อการจูงใจในการทำงาน 
เทคนิคการตัดสินใจและแก้ไขปัญหาเพื่อการจัดการอย่างมีประสิทธิภาพ
ระยะเวลาของหลักสูตร 
1 วัน
แนวทางการประเมินผล
ผู้เข้าอบรมจะถูกประเมินด้วยแบบทดสอบก่อนการเข้าสัมมนาเพื่อวัดระดับความสามารถ และในระหว่างการสัมมนาจะมีแบบฝึกหัดเพื่อวัดผลการจัดการองค์กร และเมื่อสิ้นสุดการฝึกอบรมจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(46, 1, '205', 'การมอบหมายงานและการหมุนเวียนงาน
เวลาอยู่ในที่ประชุมหรือในบทสนทนา ให้สังเกตและใส่ใจกับสัญญาณทางกายภาพ และปฏิกิริยาต่างๆ ที่เกิดขึ้นกับตนเองว่าตนเองสามารถสะท้อนสภาวะทางอารมณ์ในสถานการณ์ต่างๆเป็นอย่างไร
ในแต่ละวัน ให้ลองประเมินและพิจารณาว่าตัวเองมีความเข้าใจและรับรู้ความรู้สึกของตนเองหรือไม่อย่างไร
หมั่นพิจารณาและวิเคราะห์ตนเองว่าทำไมตนเองถึงมีความรู้สึกเช่นนั้นในแต่ละสถานการณ์
การคิดและพฤติกรรม
หมั่นศึกษา รับรู้ และสร้างความเข้าใจในอารมณ์และความรู้สึกของตนเองในแต่ละสถานการณ์
สังเกตและติดตามสถานการณ์ต่างๆ ที่ตนเองแสดงอารมณ์ว่าเป็นอย่างไรและเช่นไร
หมั่นจดบันทึกเหตุการณ์ที่ตนเองสามารถรับรู้ความรู้สึกตนเองได้ว่าตนเองมีความรู้สึกอย่างไร
หมั่นตรวจสอบและพิจารณาอารมณ์ความรู้สึกของตัวท่านเอง
พยายามศึกษาที่มาและที่ไปของสาเหตุต่างๆ ที่นำพาให้ท่านมีอารมณ์และความรู้สึกเช่นนั้น
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการตระหนักและการประเมินอารมณ์ความรู้สึกตนเอง
การฝึกอบรม
 การพัฒนาตนให้มี EQ ', 'ชื่อหลักสูตรการฝึกอบรม: การพัฒนาตนให้มี EQ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด ความสำคัญ และเทคนิคการพัฒนา EQ
เพื่อให้ผู้เข้าอบรมสามารถควบคุมอารมณ์ และความรู้สึกได้อย่างมีประสิทธิภาพ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญและความหมายของ EQ
องค์ประกอบของ EQ
EQ ส่งผลต่อมนุษย์เราอย่างไรบ้าง 
เทคนิคการพัฒนา EQ ให้มีประสิทธิภาพ 
วิธีขจัดอุปสรรคที่ขัดขวางความสำเร็จในชีวิต 
เครื่องมือและวิธีใช้เครื่องมือในการแก้ปัญหาและอุปสรรคต่างๆ ที่เกิดขึ้น 
การสร้างทางเลือกในการแก้ไขปัญหาและอุปสรรค 
ปัจจัยที่ส่งผลต่อประสิทธิภาพในการแก้ไขปัญหา 
พลังสู่ความสำเร็จ และความมุ่งมั่นสู่ความเป็นเลิศ
ระยะเวลาของหลักสูตร 
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(47, 2, '205', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้ทำงานร่วมกับบุคคลที่ทำงานด้วยยากในสถานการณ์ที่ที่ตึงเครียดหรือมีปัญหามาก เช่น บุคคลที่มีอารมณ์ค่อนข้างแปรปรวน เพื่อฝึกความอดทนอดกลั้น
หมุนเวียนงานให้ทำงานที่ต้องปฏิสัมพันธ์กับลูกค้าที่บริหารจัดการอารมณ์ด้วยยากหรือที่ต้องเน้นการควบคุมอารมณ์ และยึดประโยชน์ของลูกค้าเป็นหลัก เพื่อฝึกการควบคุมอารมณ์
มอบหมายงานที่จะก่อความไม่ชอบใจต่างๆ ให้รับผิดชอบเพื่อฝึกการควบคุมอารมณ์และความอดทนอดกลั้นต่อเหตุอันไม่ชอบต่างๆ
การคิดและพฤติกรรม
หมั่นพัฒนาและควบคุมอารมณ์ของตัวท่านเอง เมื่อต้องอยู่ในสถานการณ์ที่ตึงเครียด คับขัน หรือต้องทำงานร่วมกับบุคคลที่ทำงานด้วยยาก
หมั่นฝึกนั่งสมาธิเพื่อฝึกจิตใจให้มีความสงบและควบคุมอารมณ์ได้ดียิ่งขึ้น
การโค้ช (Coaching)
เล่าประสบการณ์และชี้ให้เห็นถึงความสำคัญและประโยชน์ของการควบคุมอารมณ์ และความอดทนอดกลั้น
ให้คำแนะนำเรื่องการพยายามทำความเข้าอารมณ์และความรู้สึกของผู้อื่น
การฝึกอบรม
การเข้าใจผู้อื่น', 'ชื่อหลักสูตรการฝึกอบรม: การเข้าใจผู้อื่น
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี รวมทั้งสามารถสื่อสารได้อย่างมีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด หลักการเข้าใจผู้อื่น และอุปสรรคสำคัญต่างๆ รวมทั้งแนวทางในการพัฒนาการเข้าใจผู้อื่น
กรอบเนื้อหาของหลักสูตร
หลักการ ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี และหลักการในจดบันทึกข้อมูลให้ครบถ้วน และเป็นประโยชน์ รวมทั้งหลักการสื่อสารที่มีประสิทธิภาพ
แนวคิดเบื้องต้นเกี่ยวกับภาษาและพฤติกรรมมนุษย์ (Myers-Briggs Type Indicator) เพื่อให้สามารถตอบสนองผู้อื่นและสื่อสารได้อย่างมีประสิทธิภาพสูงสุด
ข้อแนะนำในการพัฒนาการเข้าใจผู้อื่น และการชนะใจคน
เครื่องมือ แนวคิด หลักการของการเข้าใจผู้อื่น อุปสรรคที่สำคัญ และการสร้างความเข้าใจผู้อื่นเกิดขึ้นได้โดย:
การยอมรับอารมณ์ของผู้อื่น และ
การแสดงให้ผู้อื่นเห็นว่าท่านเข้าใจ แม้ว่าท่านไม่จำเป็นต้องเห็นด้วยกับคำพูดหรือความรู้สึกของผู้นั้นก็ตาม


การจำลองสถานการณ์จริง และทดลองให้ปฏิบัติ รวมทั้งมีเกมและแบบฝึกหัดเพื่อฝึกการฟัง การสื่อสาร และการเข้าใจผู้อื่น ตลอดจนสรุปผล
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(48, 3, '205', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้รับผิดชอบงาน หรือโครงการที่มีความเร่งด่วน (ภายใต้ระยะเวลาที่จำกัด) และมีความสำคัญมากต่อหน่วยงาน หรือองค์กร รวมทั้งต้องทำงานร่วมกับกลุ่มบุคคลที่หลากหลาย เพื่อฝึกการบริหารจัดการอารมณ์และความรู้สึกให้เหมาะสมกับสถานการณ์ที่จำกัดต่างๆ ได้
การคิดและพฤติกรรม
หมั่นประเมินและตระหนักตนเองด้วยใจเป็นธรรมว่าตนเองมีจุดเด่นและจุดด้อยอย่างไรบ้าง
เปิดโอกาสให้ผู้อื่นได้แสดงความคิดเห็นเกี่ยวกับตัวท่านเองหรือให้คำติชมท่านเพื่อส่งเสริมให้ท่านสามารถปรับปรุงตนเองให้ดียิ่งขึ้นไปได้
ขอความร่วมมือจากเพื่อนร่วมงานที่ท่านไว้ใจได้ในการปรับปรุงจุดด้อยหรือข้อเสียของท่านเพื่อพัฒนาและปรับปรุงความสามารถของท่านให้ดีขึ้น
ให้ผู้อื่นให้คำติชมและข้อเสนอแนะเกี่ยวกับการจุดเด่นหรือจุดด้อยของท่าน เพื่อนำไปสู่การพัฒนาตนเองได้อย่างเหมาะสมและมีประสิทธิภาพ
เปิดใจและยอมรับความเป็นจริงอย่างสร้างสรรค์ เมื่อท่านได้รับข้อติชมหรือข้อเสนอแนะจากผู้อื่น
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำติชมเรื่องจุดเด่น จุดด้อยหรือแนวทางเพื่อการพัฒนาและปรับปรุงศักยภาพตนเอง
การฝึกอบรม
การบริการด้วยใจ (Service Solution)', 'ชื่อหลักสูตรการฝึกอบรม: การบริการด้วยใจ (Service Solution)
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจในกรอบความคิดเรื่อง Customer Service ต่อความสำเร็จขององค์กร และสามารถนำไปใช้ถึงวิธีการคิด และกระบวนการในการบริการลูกค้า
กรอบเนื้อหาของหลักสูตร
ลักษณะของลูกค้าและความสำคัญของการบริการลูกค้า 
กรอบแนวคิดในเรื่องการสร้างและรักษาสัมพันธ์กับลูกค้าปัจจุบันและลูกค้าใหม่ 
กระบวนการในการสร้างความแตกต่างซึ่งเป็นคุณค่า (Different Advantage) ขององค์กรให้กับลูกค้า
ข้อผิดพลาดในการบริหารลูกค้า และกระบวนการป้องกัน/แก้ไขข้อผิดพลาด
กรอบแนวคิดเรื่อง Service Solution ซึ่งเป็นการเชื่อมโยง Emotional Intelligence กับทฤษฎีการบริการลูกค้า
Turn in yourself: Learn to manage your personal thermostat
Stay Cool: Learn to stay calm in the face of pressure
Connect with your customer: Learn to turn in to others and make a positive connection
Provide Great Service: Learn to influence others to achieve an outcome beneficial to them and you
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(49, 4, '205', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นผู้นำโครงการหรือกลุ่มงานที่ติดต่อปฏิสัมพันธ์กับบุคคลอื่นหรือลูกค้าที่ปฏิบัติงานด้วยยากแต่โครงการนั้นๆ มีผลประโยชน์อย่างสูงสุดต่อองค์กรและลูกค้า
หมุนเวียนงานไปฝ่ายงานที่ต้องบริหารจัดการกลุ่มคนเป็นจำนวนมากที่มีความหลากหลายและแตกต่างกันทั้งในเชิงความคิด อารมณ์ ความรู้สึก และพฤติกรรม
มอบหมายงานให้เป็นผู้นำในการบริหารจัดการกลุ่มคนที่มีความขัดแย้งกัน
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำแนะนำในการบริหารจัดการอารมณ์อย่างฉลาด', 'การคิดและพฤติกรรม
พยายามดำรงรักษาวุฒิภาวะทางอารมณ์ของตน เพื่อหาวิธีแสดงออกที่เหมาะสม
พยายามมองโลกอย่างเข้าใจ เพื่อให้สามารถบริหารจัดการอารมณ์ของตนได้อย่างมีประสิทธิภาพ
หมั่นฝึกฝนจิตและนั่งสมาธิ
หากมีโอกาสได้แสดงและบริหารจัดการอารมณ์ของตน ควรรีบรับโอกาสนั้น 
ศึกษาความเป็นไปของสาเหตุ และที่มาของอารมณ์ของตัวท่านเองอย่างเจาะลึก เพื่อสามารถเตรียมการรองรับหรือหาวิธีการแสดงออกได้อย่างเหมาะสม
แลกเปลี่ยนความคิดเห็น ประสบการณ์หรือพูดคุยกับผู้บริหารระดับสูงในเรื่องการบริหารจัดการอารมณ์อย่างฉลาด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(50, 5, '205', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นผู้นำหน่วยงานหรือโครงการที่ต้องส่งเสริมบรรยากาศการทำงานอย่างผู้มีวุฒิภาวะทางอารมณ์ เช่น ให้ปกครองผู้ใต้บังคับบัญชาที่มีความขัดแย้งกัน เพื่อเน้นการบริหารงานด้วยความเมตตาเป็นธรรม ความสมานฉันท์ เป็นต้น
การคิดและพฤติกรรม
พยายามทำตัวเป็นแบบอย่างที่ดีในด้านวุฒิภาวะทางอารมณ์ เช่น ปกครองผู้ใต้บังคับบัญชาด้วยความเป็นธรรม ส่งเสริมการมองผู้อื่นในแง่ดีและเน้นความสมานฉันท์ เป็นต้น
รณรงค์และส่งเสริมวัฒนธรรมและบรรยากาศการทำงานร่วมกันอย่างผู้มีวุฒิภาวะทางอารมณ์ โดยเน้นการปฏิบัติตนต่อผู้อื่นอย่างให้เกียรติ มีน้ำใจเอื้อเฟื้อต่อกัน เป็นต้น
กล้ายืนหยัดและแสดงความไม่เห็นด้วยกับพฤติกรรมในเชิงลบ เช่น การนินทาว่าร้าย การวางอำนาจ เป็นต้น เพื่อรักษาความถูกต้องและวุฒิภาวะทางอารมณ์ที่ดีภายในองค์กร
หากมีโอกาสได้ปกครองผู้ใต้บังคับบัญชา ให้บริหารจัดการหรือปกครองลูกน้องด้วยความเป็นธรรมและมีความเมตตากรุณา และเน้นการสร้างความสามัคคีภายในหมู่ลูกน้อง', 'การคิดและพฤติกรรม (ต่อ)
แลกเปลี่ยนความคิดเห็น ประสบการณ์หรือพูดคุยกับผู้บริหารระดับสูงในเรื่องการส่งเสริมบรรยากาศการทำงานอย่างผู้มีวุฒิภาวะทางอารมณ์
หากมีโอกาสได้แสดงจุดยืนของตน ควรรีบรับโอกาสนั้น แต่ท่านต้องแน่ใจว่าท่านสามารถแสดงความไม่เห็นด้วยกับพฤติกรรมในเชิงลบได้ หรือการแสดงปฏิกิริยาและอารมณ์อย่างผู้ขาดวุฒิภาวะ เพื่อสร้างเป็นแบบอย่างที่ดีให้แก่องค์กรและหน่วยงานต่อไป', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(51, 1, '206', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นที่ปรึกษาผู้สร้างแรงบันดาลใจให้กับผู้ใต้บังคับบัญชาแต่ละคนในเรื่องที่เกี่ยวข้องกับการทำงาน และการพัฒนาทักษะหรือความรู้เพื่อให้สามารถทำงานในหน้าที่ได้อย่างมีประสิทธิภาพ
มอบหมายงานและเปิดโอกาสให้แสดงความคิดเห็น และทัศนคติว่าผู้ใต้บังคับบัญชาสามารถพัฒนาความรู้ และความสามารถได้
การโค้ช (Coaching)
ดูแล และให้คำแนะนำด้านการสอนงานให้แก่ผู้ใต้บังคับบัญชา 
ให้คำแนะนำเรื่องการปรับทัศนคติว่า “ทุกคนมีจุดเด่นและจุดด้อยที่แตกต่างกัน” และ “ทุกคนสามารถพัฒนาได้แต่อาจด้วยความพยายามที่แตกต่างกัน”
การฝึกอบรม
การสอนงานระดับต้น', 'ชื่อหลักสูตรการฝึกอบรม: การสอนงานระดับต้น 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด เรื่องการสอนงาน
เพื่อให้ผู้เข้าอบรมมีเครื่องมือที่ใช้ในการสอนงาน
เพื่อให้ผู้เข้าอบรมสามารถนำเครื่องมือไปใช้ในชีวิตจริงได้อย่างมีประสิทธิภาพสูงสุด
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
การเป็นโค้ชที่ดีคืออะไร
เทคนิคในการสอน และการสื่อสาร (Communication and Training Skills)
สมรรถนะของการเป็นโค้ชดี และการประเมินความสำเร็จในฐานะโค้ช 
การสอนงานในแต่ละสถานการณ์ และเมื่อไหร่จึงควรสอนงาน เมื่อไหร่ไม่ควรสอนงาน
มีกิจกรรมเรื่อง Decision Making Simulation เพื่อให้เข้าใจถึงกระบวนการการตัดสินใจจากแนวคิดที่บรรยาย
ระยะเวลาของหลักสูตร
ไม่น้อยกว่า 3 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม มีสถานการณ์จำลองให้ลองฝึกการสอนที่ดี', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(52, 2, '206', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้สอนงานในรายละเอียดในกรณีที่พนักงานคนใหม่เข้าร่วมงานในฝ่ายหรือในหน่วยงานที่รับผิดชอบ
มอบหมายให้เข้าร่วมในโครงการใหม่ๆ โดยมีบทบาทเป็นหัวหน้าทีมเฉพาะกิจของกลุ่มคนที่ด้อยประสบการณ์ในการทำงาน และใช้เวลาอธิบายวิธีการทำงานแก่พวกเขา
มอบหมายให้จัดการประชุม 1-2 ชั่วโมง เพื่อปรึกษาและพูดคุยกับแต่ละบุคคลถึงแนวทางและแผนในการพัฒนา และหาวิธีการและกระบวนการในการปรับปรุงเพื่อให้สามารถบรรลุเป้าหมายได้
การโค้ช (Coaching)
สอนงานให้รู้จักกระบวนการและแนวทางในการสอนงานผู้ใต้บังคับบัญชาหรือผู้อื่นในรายละเอียด รวมถึงวิธีการในการให้คำแนะนำที่เฉพาะเจาะจงและชัดเจนที่เกี่ยวกับวิธีการปฏิบัติงาน
การฝึกอบรม
จิตวิทยาและการเป็นหัวหน้างาน', 'ชื่อหลักสูตรการฝึกอบรม: จิตวิทยาและการเป็นหัวหน้างาน
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถพัฒนาทักษะและคุณสมบัติในการเป็นหัวหน้างานที่ดีให้แก่บุคลากรและองค์กร ที่จะต้องมีภาระหน้าที่ (Responsibility) และความรับผิดชอบ (Accountability) ตามหน้าที่งาน (Function Description) ที่จะได้รับ หรือปรับเพิ่มสูงขึ้น 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
บทบาทหน้าที่ของหัวหน้างาน
การบริหารคน
การสื่อความหมายอย่างมีประสิทธิภาพ
การสั่งงาน การมอบหมาย การติดตามงาน
การร่วมกันทำงานเป็นทีม
การจูงใจ และให้กำลังใจ 
จิตวิทยาในการทำงานร่วมกับลูกน้อง 
การบริหารทีมงาน
กิจกรรมและ Case Study ตลอดการฝึกอบรมเพื่อให้ผู้รับการฝึกอบรมเข้าใจในกรอบแนวคิด ทฤษฎี และวิธีการนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(53, 3, '206', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้สำรวจว่าผู้ใต้บังคับบัญชาสามารถปฏิบัติหน้าที่เป็นอย่างไร รวมทั้งฝึกให้คำแนะนำเกี่ยวกับผลการปฏิบัติงาน เพื่อให้พวกเขาเกิดการพัฒนาศักยภาพ ความรู้ และความสามารถต่อไป
พยายามให้เวลากับผู้ใต้บังคับบัญชาเพื่อสอนงานสำคัญให้ คอยสังเกตว่าผู้ใต้บังคับบัญชาทำงานดังกล่าวเป็นอย่างไร แล้วให้ข้อคิดเห็นที่เป็นประโยชน์เพื่อช่วยพัฒนาพวกเขา โดยที่ไม่ได้กำกับทุกอย่างก้าวในการทำงาน
คิดถึงงานของผู้ใต้บังคับบัญชาของท่านโดยลองนึกถึงตัวท่าน หากท่านอยู่ในสถานะเดียวกับพวกเขาว่าท่านจะต้องการอะไรบ้างเพื่อให้ทำงานได้ดี อะไรจะเป็นอุปสรรคสำคัญที่สุดต่อผลงานของพวกเขาและท่านจะช่วยเหลือพวกเขาได้อย่างไร
การโค้ช (Coaching)
แนะนำให้เห็นถึง Learning Style ที่แตกต่างกันของแต่ละบุคคล
การฝึกอบรม
การสอนงานระดับสูง ', 'ชื่อหลักสูตรการฝึกอบรม: การสอนงานระดับสูง 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด เรื่องการสอนงานที่ดี
เพื่อให้ผู้เข้าอบรมมีเครื่องมือ กระบวนการ และวิธีคิดที่ใช้ในการสอนงานให้เกิดประโยชน์สูงสุด
เพื่อให้ผู้เข้าอบรมสามารถนำเครื่องมือไปใช้ในชีวิตจริงได้อย่างมีประสิทธิภาพสูงสุด
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดในการสอนงาน (Coaching) 
ทฤษฎีเรื่องการเรียนรู้ที่แตกต่างกัน (Learning styles: Accommodating, Converging, Diverging และ Assimilating)
กระบวนการในการสอนงาน (The coaching theory) 
วิธีการในการพัฒนาทักษะในการสอนงาน 
การเป็นผู้ฟังที่ดี (Active listening)
การตั้งคำถามที่เหมาะสม (Effective questioning)
การให้ข้อคิดเห็นที่สร้างสรรค์ (Feedback)
กิจกรรม Role Play เรื่องการสอนงาน
ระยะเวลาของหลักสูตร
ไม่น้อยกว่า 3 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม มีสถานการณ์จำลองให้ลองฝึกการสอนที่ดี', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(54, 4, '206', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้สำรวจว่าผู้ใต้บังคับบัญชาต้องเผชิญกับความยากลำบากอะไรบ้างในการปฏิบัติงานและให้ความช่วยเหลือเพื่อให้พวกเขาสามารถปฏิบัติน้าที่ได้อย่างมีประสิทธิภาพ
มอบหมายงานให้ติดตาม และสำรวจพฤติกรรมของผู้อื่นที่คอยให้คำแนะนำ และคำติชม (Feedback) ผู้ใต้บังคับบัญชาและผู้อื่นเพื่อให้เกิดการกระบวนการในการพัฒนาในการสอนงานและการให้คำติขม 
มอบหมายให้เข้าร่วมการประชุมที่มีการปรึกษา และพูดคุยกันในเรื่องการให้คำแนะนำที่มีประโยชน์เพื่อส่งเสริมให้ผู้ใต้บังคับบัญชาหรือผู้อื่นเกิดการพัฒนาความรู้ ความสามารถและปรับปรุงผลงานอย่างต่อเนื่อง
การโค้ช (Coaching)
สอนเรื่องการให้คำแนะนำ และคำติชม (Feedback) ที่มีประสิทธิภาพและสร้างเสริมขวัญกำลังใจได้ดี
การฝึกอบรม
การเป็น Mentor ที่ดี ', 'ชื่อหลักสูตรการฝึกอบรม: การเป็น Mentor ที่ดี 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด เรื่องการเป็น Mentor ที่ดี
เพื่อให้ผู้เข้าอบรมมีเครื่องมือ กระบวนการ และวิธีคิดที่จำเป็นในการเป็น Mentor ที่ดี
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดในการเป็น Mentor ที่ดี
เทคนิคต่างๆ ในการเป็น Mentor ที่ดีเช่น เทคนิคการสอนงานด้วยตัวอย่าง (Teach by Example) เทคนิคการสร้างกำลังใจการพัฒนา (Offer Encouragement) เทคนิคการท้าทายและเผชิญกับนิสัยที่ไม่ถูกต้อง (Encourage Professional Behavior and Confront Negative Behavior) เป็นต้น
การบริหารความสัมพันธ์ระหว่าง Mentor กับ Mentee (การสร้างความสัมพันธ์ (Relationship) การให้ประสบการณ์ (Informative) การอภิปราย (Facilitative) การสร้างทิศทาง (Prot?g? Vision) เป็นต้น
กิจกรรม Role Play เรื่องการเป็น Mentor ที่ดี
ระยะเวลาของหลักสูตร 3 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม มีสถานการณ์จำลองให้ลองฝึกการ Mentor ที่ดี', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(55, 5, '206', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ศึกษาว่าผู้ใต้บังคับบัญชาแต่ละคนมีความต้องการพัฒนาศักยภาพและความรู้ในด้านใดบ้างในระยะยาว พร้อมทั้งให้คำแนะนำและมองหาโอกาสในการพัฒนาขีดความสามารถและประสบการณ์อื่นๆ เพื่อสนับสนุนให้เกิดการเรียนรู้อย่างต่อเนื่อง
มอบหมายงานที่ต้องคอยติดตามการปฏิบัติงานของพนักงานใหม่หรือพนักงานที่มีปัญหาในการใช้ความรู้และทักษะต่างๆ ในการทำงาน โดยต้องทำหน้าที่เป็นผู้มอบหมายงานเพื่อให้พวกเขาเหล่านั้นมีความมั่นใจและสามารถใช้ความรู้และความสามารถในการทำงานได้อย่างเหมาะสมและมีประสิทธิภาพ
มอบหมายให้จัดทำแผนทางก้าวหน้าในสายอาชีพระยะยาวให้กับผู้ใต้บังคับบัญชาแต่ละคน โดยต้องมีแผนพัฒนาที่เหมาะสม
มอบหมายให้จัดทำระบบ Talent Management ขึ้นในหน่วยงาน
การฝึกอบรม
การสร้างวัฒนธรรมการสอน
การเป็นผู้นำและการสอนงาน', 'ชื่อหลักสูตรการฝึกอบรม: การสร้างวัฒนธรรมการสอน
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการสร้าง Coaching Culture
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดในการสร้างวัฒนธรรมการสอนงาน (เช่น ต้องเชื่อมโยงกับ กลยุทธ์องค์กร หาผู้รับผิดชอบ (Sponsor) การประเมินผล (Develop evaluation strategies) การสร้างโค้ช (Create a coach pool) เป็นต้น
ประโยชน์ของวัฒนธรรมการสอนงาน
ขั้นตอนในการสร้างวัฒนธรรมการสอนงาน (Defining & Moving Your Current Culture)
แนวทางในการติดตามและประเมินผลเพื่อให้มั่นใจว่าเกิดวัฒนธรรมการสอนงานจริง (Coaching Culture Review Frame)
กิจกรรมการวางแผนการสร้างวัฒนธรรมการสอนงาน
ระยะเวลาของหลักสูตร
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรมมีแผนการสร้างวัฒนธรรมการสอนงาน', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(56, 1, '301', 'การมอบหมายงานและการหมุนเวียนงาน
ให้ระดมสมองถึงประโยชน์ของการกำกับติดตามการดำเนินงานต่างๆ ของผู้อื่น/ผู้ประกอบการ
มอบหมายให้วางแผนกำกับติดตามการดำเนินงานต่างๆ ของผู้ประกอบการหรือหน่วยงานที่อยู่ในความรับผิดชอบ
มอบหมายให้ดำเนินการติดตามให้ผู้อื่นปฏิบัติตามมาตรฐาน กฎระเบียบ หรือข้อบังคับที่กำหนดไว้ เพื่อให้เกิดประโยชน์ในการดำเนินงานของตนเอง หน่วยงาน หรือองค์กร
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางหรือกระบวนการในการกำกับติดตามอย่างมีประสิทธิภาพ รวมถึงให้การสนับสนุนและคำชมเชยหากสามารถกำกับติดตามให้บุคคลหรือหน่วยงานอื่นทำตามเป้าหมายที่กำหนดไว้สำเร็จ
การฝึกอบรม
เทคนิคการวางแผนกำกับติดตาม', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการวางแผนกำกับติดตาม
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความเข้าใจเทคนิคในการวางแผนการกำกับติดตามและการกำหนดเกณฑ์ชี้วัดความสำเร็จ
เพื่อให้ผู้เข้าอบรมทดลองปฏิบัติการการวางแผนกำกับติดตาม
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
แนวทางในการกำกับติดตามและเครื่องมือในการวางแผนกำกับติดตาม
ทดลองหาข้อมูลจริง จาก Case Study ที่กำหนดให้
ระยะเวลาของหลักสูตร
ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถกำกับติดตามได้มากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(57, 2, '301', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้กำกับติดตามการดำเนินงานต่างๆ ของหน่วยงานที่อยู่ในความรับผิดชอบ
มอบหมายให้กำกับติดตามให้ผู้อื่นปฏิบัติตามมาตรฐาน กฎระเบียบ หรือข้อบังคับที่กำหนดไว้
มอบหมายให้รายงานผลการติดตามหน่วยงานที่รับผิดชอบในทุกเดือน
หมุนเวียนไปในงานที่ต้องออกไปกำกับและติดตามผู้ประกอบการที่มีปัญหาหรือต้องการการแนะนำ/คำปรึกษา
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางหรือกระบวนการในการกำกับติดตามที่มีประสิทธิภาพ รวมถึงให้การสนับสนุนและคำชมเชยหากสามารถแก้ไขปัญหาและกำกับติดตามหน่วยงานหรือบุคคลอื่นๆ ได้สำเร็จตามเป้าหมาย
การฝึกอบรม
เทคนิคการติดตามและประเมินผลอย่างมีประสิทธิภาพ', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการติดตามและประเมินผล
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความเข้าใจเทคนิคการติดตามและประเมินผลอย่างมีประสิทธิภาพสูงสุด
เพื่อให้ผู้เข้าอบรมทดลองปฏิบัติการตามเทคนิคที่ได้เรียนรู้
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
การกำหนดตัวชี้วัดเพื่อการติดตามและประเมินผล
เครื่องมือในการติดตามและประเมินผลเช่น Descriptive Checklist, Trade-off Matrix, Spreadsheet Model หรือ Overlay Screening Model เป็นต้น
แนวทางในการติดตามและประเมินอย่างมีประสิทธิภาพ
ทดลองวางแผนกำกับติดตามจาก Case Study ที่กำหนดให้
ระยะเวลาของหลักสูตร
ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถนำไปใช้ได้อย่างมีประสิทธิภาพมากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(58, 3, '301', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้กำกับติดตามการดำเนินงานต่างๆ ของหน่วยงานหรือผู้อื่น และรายงานผลทุกๆ เดือนและทุกๆ ไตรมาส
มอบหมายให้วิเคราะห์ และระบุข้อมูล ข้อเท็จจริง สาเหตุ สิ่งผิดปกติ และความเปลี่ยนแปลงต่างๆ ที่เกิดขึ้นในการกำกับติดตามหน่วยงานหรือผู้อื่น
มอบหมายให้เสนอกระบวนการ หรือวิธีการต่างๆ เพื่อจำกัดทางเลือกของผู้อื่น หรือเพื่อบีบคั้นให้ผู้อื่นปฏิบัติในกรอบที่ถูกต้องตามกฎหมายหรือระเบียบปฏิบัติที่กำหนดไว้
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางหรือกระบวนการในการกำกับติดตามที่มีประสิทธิภาพ รวมถึงให้การสนับสนุนและคำชมเชยหากสามารถแก้ไขปัญหาและกำกับติดตามหน่วยงานหรือบุคคลอื่นๆ ได้สำเร็จตามเป้าหมาย
การฝึกอบรม
การดูงานในหน่วยงานทั้งในประเทศและต่างประเทศที่ประสบความสำเร็จในเรื่องที่เกี่ยวข้องกับการติดตามและประเมินผลอย่างมีประสิทธิภาพ', 'ชื่อหลักสูตรการฝึกอบรม: การดูงานในหน่วยงาน Best Practice
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเห็นประสบการณ์ดีๆ จากกรณีศึกษาของหน่วยงานอื่นๆ
เพื่อให้ผู้เข้าอบรมเกิดการแลกเปลี่ยนเรียนรู้ในการกำกับติดตาม
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วยการกำหนดทางดูงานเช่น
หน่วยงานที่ต้องการไปดูงาน 
การสรุปภารกิจของหน่วยงานที่ไปดูงาน และวัตถุประสงค์ของการดูงานก่อนไปดูงานจริง
การดูงานและการแลกเปลี่ยนเรียนรู้กับเจ้าหน้าที่ในหน่วยงาน Best Practice 
การทำสรุปผลการดูงาน
ระยะเวลาของหลักสูตร
ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล
ผู้ไปดูงานต้องสรุปและวิเคราะห์บทเรียนที่ได้จากการไปดูงาน นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นๆ ว่าสามารถสนับสนุนให้เกิดการหาข้อมูลเพิ่มขึ้นมากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(59, 4, '301', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้มีการกำกับติดตาม และตรวจสอบความถูกต้องของการดำเนินงานต่างๆ ของผู้อื่นอย่างใกล้ชิดและออกคำเตือน/สั่งการให้ปรับปรุงการดำเนินงานต่างๆ ในเชิงปริมาณหรือคุณภาพให้ถูกต้องตามมาตรฐาน กฎระเบียบ หรือข้อบังคับที่กำหนดไว้
มอบหมายให้ไปติดตามงานของผู้ประกอบการหรือหน่วยงานที่ไม่ปฏิบัติงานตามกฎระเบียบอย่างต่อเนื่อง
มอบหมายให้ดูแลและให้คำปรึกษาผู้ใต้บังคับบัญชาหรือเจ้าหน้าที่ในหน่วยงาน เรื่องแนวทางหรือกระบวนการในการกำกับติดตามที่มีประสิทธิภาพ
การฝึกอบรม
เทคนิคของ
	การบริหาร
	ความขัดแย้ง', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการบริหารความขัดแย้ง
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถเข้าใจถึงการบริหารจัดการความขัดแย้ง (Conflict Management)
เพื่อให้ผู้เข้าอบรมมีเครื่องมือในการบริหารจัดการความขัดแย้งและแก้ปัญหาอย่างถูกต้อง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
การบริหาร Conflict โดยตามทฤษฎีของ Thomas-Kilmann (Competing, Accommodating, Avoiding, Compromising และ Collaborating)
การกำหนดทางเลือกในการตัดสินใจและการประเมินความขัดแย้ง
การพิจารณาความเสี่ยงที่อาจเกิดขึ้น และระดับที่ยอมรับได้/ไม่ได้                                                     จากผลการตัดสินใจ
การนำสิ่งที่ตัดสินใจเข้าสู่การปฏิบัติ
ระยะเวลาของหลักสูตร
ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถสนับสนุนให้เกิดการหาข้อมูลเพิ่มขึ้นมากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(60, 5, '301', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้จัดการกับการดำเนินงานต่างๆ ที่ไม่ดี ไม่ถูกต้อง หรือสิ่งผิดกฎหมายอย่างเด็ดขาดตรงไปตรงมา
มอบหมายให้ไปเผชิญหน้าอย่างเด็ดขาดกับผู้ประกอบการ หน่วยงานภายใต้การกำกับดูแลที่มีการดำเนินงานต่างๆ ที่ผิดระเบียบอย่างต่อเนื่องหรือทำผิดกฎหมายอย่างร้ายแรง 
มอบหมายให้กำหนด หรือปรับมาตรฐาน ข้อบังคับ หรือกฎระเบียบต่างๆ ที่เกี่ยวข้องให้แตกต่าง ท้าทาย หรือสูงขึ้น (เมื่อสภาวแวดล้อมเปลี่ยนไป)
มอบหมายให้กำหนดเกณฑ์การประเมินผลนโยบาย (ตามรูป)
การฝึกอบรม
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการวางกลยุทธ์ภาครัฐ
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการมุ่งผลสัมฤทธิ์
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องจริยธรรม', '', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(61, 1, '302', 'ด้านความคิดและพฤติกรรม
ในที่ประชุมหรือต่อหน้าผู้อื่น ให้กล้าแสดงความคิดเห็น หรือเปิดเผยข้อมูลหรือเหตุผลอย่างตรงไปตรงมา
หมั่นยึดมั่นในหลักการและแนวทางตามหลักวิชาชีพของตนเองอย่างสม่ำเสมอ
เมื่อได้รับมอบหมายงานใดๆ ก็ตาม ให้ปฏิบัติหน้าที่ด้วยความโปร่งใส และถูกต้องตามหลักกฎระเบียบข้อบังคับที่กำหนดไว้
ทำงานร่วมกับหน่วยงานด้านประชาสัมพันธ์และร่วมให้ความเห็นว่าควรจะสื่อสารสิ่งใดต่อสาธารณชน
ใช้เวลาสำรวจความคิดตนเองถึงค่านิยมและหลักการทางวิชาชีพที่ท่านคิดว่าท่านยึดมั่นมากที่สุด และเขียนลงกระดาษเฉพาะสิ่งที่ท่านเห็นว่าสำคัญที่สุด แล้วไตร่ตรองทีละรายการว่ามีค่านิยมหรือหลักการทางวิชาชีพใดบ้างที่ท่านได้แสดงออกอย่างสอดคล้องกับหลักการทางวิชาชีพหรือค่านิยมนั้นๆ แล้วถามตัวเองว่าท่านต้องการจะกระทำการใดๆ ที่แตกต่างไปจากเดิมหรือไม่เพื่อเป็นคนที่ซื่อสัตย์ต่อตัวเองให้มากขึ้น และสามารถประพฤติปฏิบัติตนได้สอดคล้องกับแนวทางตามหลักวิชาชีพอย่างสม่ำเสมอ
เข้าไปมีส่วนร่วมในโครงการที่เปิดโอกาสให้ท่านได้แสดงความคิดเห็นอย่างเปิดเผยและตรงไปตรงมา
ติดกฎระเบียบหรือข้อบังคับที่ท่านต้องการประพฤติปฏิบัติไว้ที่โต๊ะทำงานของท่าน เพื่อให้ท่านจำได้และสามารถปฏิบัติตนได้อย่างสอดคล้อง
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการปฏิบัติหน้าที่ด้วยความโปร่งใส และการแสดงความคิดเห็นอย่างเปิดเผยและตรงไปตรงมา
สอนให้ปฏิบัติงานตามหลักการและแนวทางตามหลักวิชาชีพ
การฝึกอบรม
จริยธรรมจรรยาบรรณวิชาชีพ', 'ชื่อหลักสูตรการฝึกอบรม: จริยธรรมจรรยาบรรณวิชาชีพ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความรู้ ความเข้าใจเกี่ยวกับหลักจริยธรรมในจรรยาบรรณวิชาชีพของตน
เพื่อให้ผู้เข้าอบรมพึงระมัดระวังในความรับผิดชอบต่อผู้รับบริการ ผู้ประกอบการ และเครือข่ายต่างๆ 
เพื่อให้ผู้เข้าอบรมเข้าใจบทบาทในวิชาชีพของตน และพัฒนาความรู้เกี่ยวกับวิชาชีพอย่างต่อเนื่อง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
จริยธรรมและข้อพึงปฏิบัติในการประกอบวิชาชีพ
ความสำคัญ และสาระสำคัญของจริยธรรมในจรรยาบรรณวิชาชีพ
Code of Ethic and Professional Conduct, Code of Ethic Requirement
สาเหตุของปัญหาจริยธรรมทางธุรกิจต่างๆ
หลักจรรยาบรรณวิชาชีพ และหลักปฏิบัติงานอย่างมืออาชีพ (Principle of Professional Conduct)
ตัวอย่างกรณีศึกษา เพื่อให้สามารถนำมาประยุกต์ใช้ในงานได้จริง
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(62, 2, '302', 'ด้านความคิดและพฤติกรรม
เวลาที่ผู้อื่นมาขอความช่วยเหลือจากท่านในทางที่ไม่ถูกต้อง เช่น ขาดเหตุผลที่ดี หรือผิดกฎระเบียบและแนวทางนโยบายที่วางไว้ ท่านต้องกล้าปฏิเสธข้อเรียกร้องเหล่านั้นอย่างตรงไปตรงมา
ประพฤติปฏิบัติต่อบุคคลอื่นหรือหน่วยงานอื่นๆ อย่างเท่าเทียมกัน ไม่บิดเบือนข้ออ้างหรือข้อยกเว้นให้ต่อตนเองหรือผู้ใต้บังคับบัญชาของตน
รักษาสัจจะ ยึดมั่นในคำสัญญา พูดอะไรก็มุ่งมั่นตั้งใจที่จะทำสิ่งนั้นๆ
คิดย้อนถึงเหตุการณ์ที่ท่านให้สัญญาสิ่งใดไว้แต่ไม่สามารถกระทำตามได้ ลองวิเคราะห์ถึงรูปแบบของการให้คำมั่นสัญญาที่เกิดขึ้นและพิจารณาถึงสาเหตุที่ท่านลังเล ไม่เต็มใจ หรือไม่สามารถทำตามสัญญาได้ (เช่น ไม่ได้คิดว่าสำคัญ วางแผนไม่ดี ไม่ได้ตั้งใจจะทำตามอย่างจริงจัง ฯลฯ) ถามตนเองว่าท่านสามารถทำอะไรให้ดีขึ้นได้ เพื่อไม่ให้เกิดปัญหาเดิมขึ้นอีก
ครั้งต่อไปที่ท่านได้รับการร้องขอให้ช่วยเหลือสิ่งใดก็ตาม ให้พิจารณาตารางเวลาของท่านตามความเป็นจริงเพื่อให้มั่นใจได้ว่าท่านสามารถสิ่งที่ได้รับการร้องขอได้จริงๆ อย่าพยายามให้คำมั่นสัญญาที่ไม่มีความหมายใดๆ เพียงเพื่อสร้างความประทับใจแก่ผู้อื่นหรือเพื่อซื้อเวลา ผู้คนนั้นคาดหวังให้เราตรงไปตรงมาและซื่อสัตย์กับภาระหน้าที่ของท่าน และจะเข้าใจเสมอหากท่านไม่สามารถจะช่วยตามที่ได้รับการร้องขอได้
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการปฏิบัติต่อผู้อื่นอย่างเท่าเทียมกัน และการรักษาสัจจะ
เล่าประสบการณ์และชี้ให้เห็นถึงความสำคัญของการรักษาสัจจะและการยึดมั่นคำสัญญาหรือคำพูดว่ามีผลประโยชน์ที่ดีอย่างไรต่อองค์กรและหน่วยงาน
การฝึกอบรม
7 อุปนิสัยของผู้มีประสิทธิผลสูง ', 'ชื่อหลักสูตรการฝึกอบรม: 7 อุปนิสัยของผู้มีประสิทธิผลสูง 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจกรอบความคิด หลักการสำคัญของการใช้ชีวิตอย่างมีประสิทธิผลและสมดุล (ของ Stephen R. Covey) 
เพื่อให้ผู้เข้าอบรมสามารถนำ 7 อุนิสัยไปใช้ในชีวิตประจำวันให้เกิดประโยชน์
กรอบเนื้อหาของหลักสูตร
กรอบความคิด แนวคิด และหลักการพื้นฐาน รวมทั้งคุณลักษณะของความมีประสิทธิผลและความสมดุล และการนำ 7 อุปนิสัยไปใช้ในชีวิตประจำวัน 
อุปนิสัยที่ 1: บี โปรแอคทีฟ หยุดเพื่อคิดและตอบสนองตามหลักการ ใช้ภาษาแบบโปรแอคทีฟขยายขอบเขตแห่งอิทธิผล และเป็นผู้นำการเปลี่ยนแปลง
อุปนิสัยที่ 2: เริ่มต้นด้วยจุดมุ่งหมายในใจ สร้างวิสัยทัศน์ของผลลัพธ์ก่อนลงมือกระทำ สร้างและดำเนินชีวิตตามคำปณิธานส่วนตน
อุปนิสัยที่ 3: ทำสิ่งที่สำคัญก่อน มุ่งเน้นสิ่งที่มีความสำคัญมากในลำดับต้นๆ ขจัดสิ่งที่ไม่สำคัญออกไป วางแผนรายสัปดาห์ และวางแผนรายวัน
อุปนิสัยที่ 4: คิดแบบชนะ – ชนะ รักษาความสมดุลระหว่างความกล้าหาญและ ความใส่ใจต่อผู้อื่น แสวงหาผลประโยชน์ร่วมกัน สร้างข้อตกลงแบบชนะ – ชนะ 
อุปนิสัยที่ 5: เข้าใจผู้อื่นก่อน แล้วจึงให้ผู้อื่นเข้าใจเรา วิเคราะห์ก่อนให้คำแนะนำ ฟังอย่างเข้าอกเข้าใจ ทำให้ผู้อื่นเข้าใจเราจากมุมมองของเขา
อุปนิสัยที่ 6: ผนึกพลังประสานความต่าง ให้คุณค่าและร่วมยินดีกับความแตกต่าง ฝึกฝนการร่วมมืออย่างสร้างสรรค์ 
อุปนิสัยที่ 7: ลับเลื่อยให้คมอยู่เสมอ หมั่นเติมพลังอย่างสม่ำเสมอใน 4 มิติของชีวิต เข้มแข็งในช่วงเวลาที่ท้าทาย
คำมั่นสัญญา 7 อุปนิสัย การทำกิจกรรม และบทสรุป
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการเตรียมความพร้อมก่อนสัมมนา โดยต้องตอบแบบสอบถามก่อน รวมทั้งวางแผนร่วมกับผู้บังคับบัญชา ซึ่งจะช่วยให้ได้รับคุณค่าจากการเข้าสัมมนามากขึ้น หลังการฝึกอบรมจะมีการติดตามผลถึงคำมั่นสัญญา 7 อุปนิสัย และในขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(63, 3, '302', 'กิจกรรมเพื่อการพัฒนา (สำหรับระดับที่ 3)
ด้านความคิดและพฤติกรรม
พัฒนาและปรับปรุงการให้คำแนะนำ หรือคำติชมผลงานผู้อื่นในเชิงสร้างสรรค์ ปราศจากอคติ และตรงไปตรงมา เมื่อผลงานของผู้อื่นไม่ได้ตามมาตรฐานที่กำหนดไว้หรือแสดงพฤติกรรมที่ขัดต่อกฎระเบียบขององค์กร
สังเกต ติดตามและตรวจสอบการดำเนินงานของหน่วยงานที่ตนเองรับผิดชอบอยู่ว่าปฏิบัติหน้าที่ได้อย่างถูกต้องตามกฎระเบียบหรือมาตรฐานที่องค์กรกำหนดไว้หรือไม่
พัฒนาและปรับปรุงการให้คำแนะนำ หรือคำติชมผลงานผู้อื่นในเชิงสร้างสรรค์ ปราศจากอคติ และตรงไปตรงมา เมื่อผลงานของผู้อื่นไม่ได้ตามมาตรฐานที่กำหนดไว้หรือแสดงพฤติกรรมที่ขัดต่อกฎระเบียบขององค์กร
อาสาสมัครหรือเข้าร่วมกิจกรรมหรือโครงการต่างๆ ที่เปิดโอกาสให้ได้มีหน้าที่ตรวจตราและตรวจสอบการดำเนินงานของผู้อื่นให้ปฏิบัติหน้าที่ตามกฎระเบียบหรือแนวทางนโยบายที่วางไว้
สังเกตพฤติกรรมของผู้บริหารหรือผู้บังคับบัญชาเวลาให้คำติชมผลงานของผู้ใต้บังคับบัญชาในการปฏิบัติงาน
การโค้ช (Coaching)
ดูแล แนะนำ และชี้ให้เห็นถึงประโยชน์ที่ได้รับในกรณีที่ปฏิบัติตามกฎระเบียบและมาตรฐานขององค์กร
การฝึกอบรม
การเป็น Mentor ที่ดี', 'ชื่อหลักสูตรการฝึกอบรม: การเป็น Mentor ที่ดี 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด เรื่องการเป็น Mentor ที่ดี
เพื่อให้ผู้เข้าอบรมมีเครื่องมือ กระบวนการ และวิธีคิดที่จำเป็นในการเป็น Mentor ที่ดี
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดในการเป็น Mentor ที่ดี
เทคนิคต่างๆ ในการเป็น Mentor ที่ดีเช่น เทคนิคการสอนงานด้วยตัวอย่าง (Teach by Example) เทคนิคการสร้างกำลังใจการพัฒนา (Offer Encouragement) เทคนิคการท้าทายและเผชิญกับนิสัยที่ไม่ถูกต้อง (Encourage Professional Behavior and Confront Negative Behavior) เป็นต้น
การบริหารความสัมพันธ์ระหว่าง Mentor กับ Mentee (การสร้างความสัมพันธ์ (Relationship) การให้ประสบการณ์ (Informative) การอภิปราย (Facilitative) การสร้างทิศทาง (Prot?g? Vision) เป็นต้น
กิจกรรม Role Play เรื่องการเป็น Mentor ที่ดี
ระยะเวลาของหลักสูตร 3 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม มีสถานการณ์จำลองให้ลองฝึกการ Mentor ที่ดี
', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(64, 4, '302', 'ด้านความคิดและพฤติกรรม
เป็นผู้คิดริเริ่มโครงการใหม่ๆในองค์กรที่เกี่ยวข้องการบริหารงบประมาณจำนวนมาก
มอบหมายงานให้จัดทำข้อเสนอเกี่ยวกับระบบหรือกระบวนการใหม่ๆ ซึ่งรวมถึงข้อมูลที่เกี่ยวข้องกับต้นทุนกำไรต่างๆ ที่มีผลต่อองค์กร อันมีหลักการอ้างอิงชัดเจน
ในกรณีที่ทำสิ่งผิดพลาดเกิดขึ้น ควรกล้ายอมรับความจริงและรีบปรับปรุงแก้ไขข้อผิดพลาดเหล่านั้น
กล้าเผชิญหน้ากับความจริงและกล้าตัดสินใจในหน้าที่ ในกรณีที่ท่านเห็นว่าผู้อื่นหรือหน่วยงานใดๆ ที่ฝ่าฝืนกฎระเบียบ นโยบาย หรือมาตรฐานที่องค์กรกำหนดไว้ ท่านต้องพร้อมที่จะบอกกล่าวอย่างตรงไปตรงมา แม้อาจจะสร้างศัตรูก็ตาม
ขอความร่วมมือจากเพื่อนร่วมงานที่ไว้ใจได้ในการปรับปรุงพฤติกรรมให้สอดคล้องกับค่านิยมและความเชื่อที่ท่านยึดมั่น บอกไห้พวกเขาทราบถึงความตั้งใจของท่านและขอให้ช่วยตักเตือนเมื่อพวกเขาเห็นว่าการกระทำของท่านนั้นบิดเบือนไปจากสิ่งที่ท่านยึดถือ
เข้าร่วมโครงการหรือพยายามหาโอกาสเข้าร่วมการประชุมสัมมนาต่างๆ กับผู้บริหารเพื่อให้ได้รับทราบว่าผู้บริหารกำลังพยายามที่จะบรรลุเป้าหมาย ทิศทาง หลักการ หรือแนวทางไดอยู่บ้าง', 'การแลกเปลี่ยนความรู้และประสบการณ์ (Knowledge & 
Experience Sharing)
พูดคุยและแลกเปลี่ยนความคิดเห็นและประสบการณ์กับผู้ทรงคุณวุฒิ ผู้เชี่ยวชาญ หรือผู้มีประสบการณ์โดยตรงในการกล้าเปิดเผย และการยอมรับความจริงในกรณีที่ทำสิ่งผิดพลาด และเปิดใจที่จะพร้อมแก้ไขให้มีประสิทธิภาพมากขึ้น', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(65, 5, '302', 'ด้านความคิดและพฤติกรรม
มอบหมายงานให้เข้าไปมีส่วนร่วมในการพยากรณ์งบประมาณค่าใช้จ่ายต่างๆ ในองค์กร กำไร ขาดทุน และกระบวนการต่างๆ เพื่อให้บรรลุเป้าหมายนั้นๆ
กล้าเผชิญหน้ากับความจริง และเปิดเผยอย่างตรงไปตรงมาเมื่อผู้อื่นหรือหน่วยงานมีปัญหาผลงานที่ไม่ดีหรือทำผิดกฎระเบียบข้อบังคับขององค์กรอย่างร้ายแรง
รักษาความถูกต้อง กล้ายืนหยัดและพิทักษ์ผลประโยชน์และชื่อเสียงขององค์กรแม้ในสถานการณ์ที่อาจเสี่ยงต่อความมั่นคงในตำแหน่งหน้าที่การงานก็ตาม
เมื่อต้องเผชิญกับการตัดสินใจที่ยากลำบาก พยายามคิดถึงองค์กรในฐานะว่า ถ้าท่านเป็นเจ้าขององค์กรนี้ ท่านจะจัดการปัญหานี้อย่างไร
หมั่นพัฒนาฝึกฝนและปรับปรุงความจริงใจและความซื่อสัตย์ในการให้ผลตอบรับแก่ผู้อื่นโดยการฝึกหัดการให้ความเห็นแก่ผู้อื่นอย่างสร้างสรรค์ เน้นหนักที่พฤติกรรม ไม่ใช่ตัวบุคคล เพื่อให้ความเห็นของท่านนั้นมีคุณค่าและไม่ทำร้ายความรู้สึกผู้อื่น
พูดคุยและแลกเปลี่ยนความคิดเห็นและประสบการณ์กับผู้บริหารระดับสูงในเรื่องการจัดการผลงานที่ไม่ดีหรือสิ่งที่ผิดกฎระเบียบอย่างเด็ดขาดและตรงไปตรงมา', 'การแลกเปลี่ยนความรู้และประสบการณ์ (Knowledge & Experience 
Sharing)
พูดคุยและแลกเปลี่ยนความคิดเห็นและประสบการณ์กับผู้ทรงคุณวุฒิ ผู้เชี่ยวชาญ หรือผู้มีประสบการณ์โดยตรงในเรื่องการจัดการผลงานที่   ไม่ดีหรือสิ่งที่ผิดกฎระเบียบอย่างเด็ดขาดและตรงไปตรงมา', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(66, 1, '303', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เข้าร่วมเป็นส่วนหนึ่งของการระดมสมอง (Brain Strom) ในการคิดวิเคราะห์ภายในกลุ่มงาน เพื่อให้เรียนรู้กระบวนการคิดวิเคราะห์จากผู้ร่วมงานหรือผู้หน้างาน
มอบหมายให้ไปจัดเรียงและวิเคราะห์ข้อมูลมากไปกว่าการทำความเข้าใจในรายละเอียดของข้อมูล
ดูแล แนะนำ ให้คำปรึกษาเรื่องแนวทางหรือกระบวนการในคิดวิเคราะห์ และการแตกประเด็นปัญหา เมื่อมีเหตุการณ์เกิดขึ้น
ฝึกให้จัดทำและระบุรายการหรือปัญหาที่เกิดขึ้นในงาน
หมุนเวียนงานไปในหน่วยงานที่ต้องอาศัยการวางแผนหรือคิดวิเคราะห์
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางหรือกระบวนการในคิดวิเคราะห์ว่าเมื่อมีเหตุการณ์เกิดขึ้น
การคิดและพฤติกรรม
ใช้เวลาสักหนึ่งสัปดาห์กับเพื่อนร่วมงานในหน่วยงานเพื่อรวบรวมข้อมูล สังเกตรูปแบบที่เกิดขึ้น ตั้งสมมติฐานและสรุปข้อสังเกตของท่านให้อยู่ในรูปการนำเสนอ แล้วสร้างแบบจำลองขึ้นเพื่อนำเสนอและสรุปสิ่งที่ท่านพบจากการศึกษา
การฝึกอบรม
การคิดเชิงวิเคราะห์และเชิงสังเคราะห์', 'ชื่อหลักสูตรการฝึกอบรม: การคิดเชิงวิเคราะห์และเชิงสังเคราะห์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการคิดเชิงวิเคราะห์และเชิงสังเคราะห์ (Analytical Thinking)
เพื่อให้ผู้เข้าอบรมมีเครื่องมือช่วยคิดเรื่องการคิดเชิงสังเคราะห์ เช่น Critical Thinking Technique, Mind Mapping, etc.
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความหมายของการคิดเชิงสังเคราะห์
เครื่องมือช่วยคิดเรื่องการคิดเชิงสังเคราะห์ เช่น Critical Thinking Technique, Mind Mapping, etc.
การทำกิจกรรมเพื่อให้เข้าใจกระบวนการในการสังเคราะห์ความรู้
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(67, 2, '303', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ประยุกต์ใช้ประสบการณ์ในการระบุประเด็น และแก้ปัญหาต่างๆ ในหน่วยงาน หากสถานการณ์หรือปัญหาดังกล่าวมีความคล้ายคลึงกับปัญหาเดิมที่เคยเกิดขึ้นแล้ว 
มอบหมายให้แยกแยะหรือแตกปัญหา ที่เกี่ยวข้องกับแนวคิด ประเด็น สถานการณ์ หลักการหรือทฤษฎี ที่เกี่ยวข้องกับหลักวิชาชีพ หรืองานที่ปฏิบัติอยู่ 
มอบหมายให้ปรับแผนงานหรือกิจกรรมในหน่วยงานที่ทำเป็นกิจวัตรประจำวัน โดยต้องประยุกต์รูปแบบเดิมที่มีอยู่มาใช้อ้างอิง
ให้ระบุว่ามีสิ่งที่ขาดหายไปในกิจกรรมของหน่วยงาน โดยกิจกรรมนั้นอาจเป็นกิจกรรมที่จัดบ่อยครั้งและเป็นภารกิจประจำของหน่วยงาน
ให้แก้ปัญหาผู้รับบริการ หรือผู้ประกอบการหากปัญหานั้นเป็นปัญหารูปแบบเดิมๆ 
การโค้ช (Coaching)
สอนประสบการณ์ที่ผ่านมา กระบวนการคิดในการประยุกต์บทเรียน และรูปแบบ/แนวโน้มของลักษณะงานที่ต้องดำเนินการ
การฝึกอบรม
การวิเคราะห์ การแก้ไขปัญหา และการตัดสินใจ ', 'ชื่อหลักสูตรการฝึกอบรม: การวิเคราะห์ การแก้ไขปัญหา และการตัดสินใจ 
วัตถุประสงค์
เพื่อให้ผู้เข้าฝึกอบรบมีความรู้ความเข้าใจ และสามารถคิดวิเคราะห์ปัญหา สถานการณ์ และข้อมูลอย่างเป็นระบบได้
เพื่อให้ผู้เข้าอบรมสามารถรวบรวมปัญหาและระบุปัญหาที่แท้จริงในแต่ละเรื่องได้
เพื่อให้ผู้เข้าอบรมสามารถรวบรวมทางเลือกระบุข้อดีข้อเสียแต่ละทางเลือก เพื่อนำมาประกอบการตัดสินใจ และนำเสนอแนวทางที่ถูกต้องได้
เพื่อให้ผู้เข้าอบรมฝึกในการพิจารณาทางเลือกและกล้าตัดสินใจ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการคิดอย่างเป็นระบบ 
หลักการในการเลือกและตัดสินใจ 
กิจกรรม และการฝึกปฏิบัติจริง: การรวบรวมสาเหตุของปัญหา การระบุปัญหา การเปรียบเทียบสถานการณ์และปัญหา การรวบรวมทางเลือกและข้อดีข้อเสีย และกรณีศึกษาการคิดอย่างเป็นระบบ และการแก้ปัญหาและตัดสินใจ 
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(68, 3, '303', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานชิ้นสำคัญของหน่วยงาน ที่จำเป็นต้องหาทางเลือกหรือข้อเสนอแนะที่ต้องใช้การคิดวิเคราะห์และเชื่อมโยงข้อมูลต่างๆ เข้าด้วยกัน
ให้งานที่ต้องหาเหตุและผลของปัญหา ประเด็น หรือสถานการณ์ที่เกิดขึ้น และมอบหมายให้แยกแยะข้อดีข้อเสียของทางเลือกที่นำเสนอหลังจากประเด็นต่างๆ ได้
หมุนเวียนงานไปในหน่วยงานที่ต้องอาศัยการวางแผนงาน คิดวิเคราะห์ และเชื่อมโยงหลายแผนงานเข้าด้วยกัน เช่น งานการจัดทำแผนและนโยบายของหน่วยงาน หรือองค์กร
มอบหมายให้ประยุกต์ใช้ทฤษฎีที่ศึกษามาประยุกต์ใช้กับการทำงานหรือให้ไปหาทฤษฎีใหม่ๆ แล้วสรุปว่าทฤษฎีเหล่านั้นจะมีประโยชน์อย่างไรต่อการทำงานให้บรรลุผลในหน่วยงานที่รับผิดชอบ หรือหาทางออก และทางแก้ไขที่สามารถนำมาใช้ได้จริง 
มอบหมายให้ปรับปรุง หรือเปลี่ยนแบบแผน หรือวิธีการในการทำงานที่ผ่านมา เพื่อให้ที่เข้ากับบริบทหรือสถานการณ์ในปัจจุบันได้อย่างเหมาะสมที่สุด
การโค้ช (Coaching)
สอนงาน และแสดงตัวอย่างที่ดีจากรายงานในอดีต ที่มีการแยกแยะข้อดี และข้อเสียของปัญหา สถานการณ์ ฯลฯ เป็นประเด็นต่างๆ ได้อย่างมีเหตุมีผล
ให้คำแนะนำถึงประโยชน์ของหลักการคิดวิเคราะห์ ความมีหลักการ และความเป็นเหตุเป็นผลในการทำงาน รวมทั้งควรแนะนำว่าจะมีกระบวนการคิดอย่างไรเมื่อต้องการปรับปรุงหรือเปลี่ยนแปลงกิจกรรมหรือแผนงานในหน่วยงาน
การฝึกอบรม
การคิดเชิงกลยุทธ์ (Strategic Thinking)
', 'ชื่อหลักสูตรการฝึกอบรม: การคิดเชิงกลยุทธ์ (Strategic Thinking)
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด ถึงความสำคัญของการคิดในเชิง   กลยุทธ์ในระดับองค์กรในระดับหน้าที่รับผิดชอบของงาน 
เพื่อให้ผู้เข้าอบรมเข้าใจ และสามารถนำไปใช้ถึงวิธีการคิด วิเคราะห์ และมองหาโอกาสในเชิงกลยุทธ์ โดยใช้ข้อมูล หลักการทฤษฎี 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญของการคิดเชิงกลยุทธ์ ต่อความสำเร็จขององค์กร
การจัดทำ SWOT (Strength, Weakness, Opportunities, Treat)
ความแตกต่างในการคิดเชิง Corporate Strategic และ Functional Operation
การคิดเชิงกลยุทธ์ต้องมีองค์ประกอบอย่างไรบ้างและมีขั้นตอนอย่างไร
ข้อจำกัดของการที่ผู้บริหารไม่สามารถคิดในเชิงกลยุทธ์ได้ และวิธีการขจัดข้อจำกัดนั้น
มี Workshop อย่างน้อย 1 ครั้งเพื่อให้ผู้ฝึกอบรมได้ศึกษาและลองใช้ข้อมูล เพื่อตัดสินใจในเชิงกลยุทธ์
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด เมื่อผ่านการฝึกอบรม โดยจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(69, 4, '303', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้นำทีมในการบูรณาการระบบ งาน หรือโครงการที่ซับซ้อน หรือรวบรวมความคิดหรือประเด็นต่างๆ มาเป็นแนวทางในการดำเนินงานของหน่วยงานหรือองค์กรให้บรรลุตามเป้าหมายที่กำหนดไว้
ให้เป็นผู้นำในการสังเกตการณ์เปลี่ยนแปลงจากภายนอกที่เกี่ยวข้องกับองค์กร แล้วทำการสรุปเป็นรายงานที่เข้าใจง่ายและมีข้อเสนอแนวทางที่จะนำข้อมูลสถานการณ์เหล่านั้นมาจัดทำให้เกิดประโยชน์ต่อองค์กร
ให้สรุปเหตุการณ์หรือข้อมูลที่ซับซ้อน ออกมาในรูปแบบที่ง่ายและสามารถอธิบายให้เป็นที่เข้าใจได้
ให้สังเคราะห์ข้อมูล บทเรียน องค์ความรู้ หรือเทคโนโลยีใหม่ๆ แล้วมาวางแผนว่าจะปรับปรุงกระบวนการดำเนินงาน หรือแผนงานของหน่วยงานอย่างไรให้มีประสิทธิภาพสูงสุด
เมื่อมีงานที่เกี่ยวข้องกับแนวคิด เทคโนโลยี หรือองค์ความรู้ใหม่ๆ มอบหมายให้วิเคราะห์ว่าแง่มุมต่างๆ ของสิ่งเหล่านั้นว่าเกี่ยวข้องกับหน่วยงานอย่างไรและจะมีโอกาสหรืออุปสรรคใดที่จะทำให้สามารถหรือไม่สามารถนำแนวคิด เทคโนโลยี หรือองค์ความรู้ใหม่ๆ มาใช้ให้เกิดประโยชน์สูงสุด
การคิดและพฤติกรรม
ศึกษาข้อมูลหรือรายงานผลการดำเนินงานในหน่วยงานหรือองค์กร แล้วพยากรณ์ว่าในอนาคตจะมีรูปแบบหรือแนวโน้มอย่างไร ด้วยกระบวนการสร้างสมมติฐานและการสรุปความ
หัดวิเคราะห์ความสามารถในการแข่งขัน (Competitive Analysis) รวบรวมข้อมูลและประยุกต์ใช้ความรู้ทางการตลาด ตั้งสมมติฐาน และเขียนเป็นบทสรุปผู้บริหาร
สรุปผลการดำเนินการที่ผ่านมาของหน่วยงานหรือองค์กร โดยมองว่าอะไรเป็นจุดแข็ง จุดอ่อนของการปฏิบัติการ เมื่อเปรียบเทียบกันหลายๆ ปี 
การฝึกอบรม
การวิเคราะห์งานและการตัดสินใจอย่างเป็นระบบ', 'ชื่อหลักสูตรการฝึกอบรม: การวิเคราะห์งานและการตัดสินใจอย่างเป็น
ระบบ
วัตถุประสงค์
เพื่อพัฒนาผู้เข้าอบรมให้มีหลักการหรือแนวทางที่ดีในการแก้ปัญหา การตัดสินใจ การวางแผนปฏิบัติ และสามารถ
วิเคราะห์สถานการณ์ต่างๆ ทั้งในปัจจุบันและอนาคต ซึ่งจะมีผลกระทบต่อ หน่วยงานหรือองค์กร
แยกแยะสาเหตุและอาการ รวมทั้งผลของปัญหา
รวบรวมและบริหารข้อมูลที่จำเป็นสำหรับการแก้ปัญหา และการตัดสินใจอย่างเป็นธรรม
เพื่อให้ผู้เข้าอบรมสามารถวิเคราะห์ทางเลือกและประเมินผลกระทบระยะสั้น ระยะยาว ข้อดี ข้อเสีย ข้อด้อย ทั้งในเชิงคุณภาพและปริมาณ
เพื่อให้ผู้เข้าอบรมสามารถมองถึงอนาคต วางแผนปฏิบัติ และป้องกันอุปสรรคต่างๆ 
เพื่อให้ผู้เข้าอบรมสามารถกำหนดวิธีการติดตามผลได้
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
สาเหตุที่ทำให้การแก้ปัญหาและการตัดสินใจยุ่งยากลำบากขึ้น
การพิจารณาและการวิเคราะห์สถานการณ์อย่างเป็นระบบ
กระบวนการแก้ปัญหาอย่างเป็นระบบ
กระบวนการตัดสินใจอย่างเป็นระบบ
กระบวนการวางแผนปฏิบัติงานอย่างเป็นระบบ
ความคิดสร้างสรรค์กับระบบการแก้ปัญหาและการตัดสินใจ
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด เมื่อผ่านการฝึกอบรม โดยจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(70, 5, '303', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เข้าร่วมเป็นส่วนหนึ่งของการแก้ไขปัญหาที่เกิดขึ้นในองค์กร
ให้พิจารณาโอกาสหรือปัญหาที่เกิดขึ้นด้วยมุมองที่แตกต่างเพื่อให้สามารถนำเสนอแนวทางที่จะสร้างประโยชน์หรือแก้ไขปัญหาที่จะเกิดขึ้นกับองค์กร 
ให้จัดทำกลยุทธ์ โดยให้สร้างนวัตกรรมใหม่ๆ ในการทำงานในองค์กรให้บรรลุตามเป้าหมายอย่างมีประสิทธิภาพสูงสุด
มอบหมายให้ค้นคิด ประดิษฐ์ หรือสร้างสรรค์รูปแบบ กระบวนการ ผลิตภัณฑ์ หรือบริการใหม่ๆ ที่ไม่เคยปรากฏมาก่อนและเป็นประโยชน์ต่อองค์กรหรือสังคมและประเทศชาติโดยรวม
มอบหมายให้เชื่อมโยงแนวคิดการบริหารองค์กรสมัยใหม่ เช่น เรื่องการกำหนด KPIs การกำหนดกลยุทธ์ขององค์กร มาประยุกต์เชื่อมโยงการปฏิบัติงานของหน่วยงานที่รับผิดชอบ 
การคิดและพฤติกรรม
ลองคิดถึงผู้นำที่มีหน้าที่ในการวางกลยุทธ์ให้องค์กร ทำความเข้าใจ    กลยุทธ์ดังกล่าวเพื่อช่วยพัฒนากลยุทธ์ในการทำงานของตนเพื่อสนับสนุนภาพใหญ่ขององค์กร
คิดนอกกรอบหรือสร้างกรอบความคิดใหม่ๆ ที่อาจไม่เป็นที่รู้จักของผู้อื่น และไม่ได้มาจากการเรียน มาใช้ในการอธิบายสถานการณ์ หรือคลี่คลายปัญหา
พิจารณาสิ่งต่างๆ ในงานด้วยมุมมองที่แตกต่าง และนำเสนอสิ่งเหล่านั้นด้วยกระบวนการที่เข้าใจง่าย และสามารถนำไปปฏิบัติได้จริง
เรียนรู้กระบวนการในการสร้างสรรค์ผลงานใหม่ จากบริษัทหรือองค์กรชั้นนำของโลก/ประเทศไทย แล้วนำเอากระบวนการดังกล่าวมาคิดประดิษฐ์สิ่งใหม่ๆ ที่จะเกิดประโยชน์สูงสุดต่อองค์กร', 'การแลกเปลี่ยนความรู้และประสบการณ์ (Knowledge & Experience 
Sharing)
พูดคุยและแลกเปลี่ยนความคิดเห็นและประสบการณ์กับผู้ทรงคุณวุฒิ หรือผู้เชี่ยวชาญที่สามารถวิเคราะห์ประเด็น และปัญหาได้อย่างรอบด้านและลึกซึ้ง
ทำงานอย่างใกล้ชิดกับผู้เชี่ยวชาญที่มีความรู้เฉพาะด้านระบบอุตสาหกรรม หรือเรื่องการบริหารจัดการองค์กร เพื่อให้สามารถประยุกต์ใช้ความรู้ และความเชี่ยวชาญนั้นๆ ให้เกิดประโยชน์ในงานและองค์กรได้
การฝึกอบรม
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการวางกลยุทธ์ภาครัฐ (Strategic Orientation- SO) 
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องวิสัยทัศน์ (Visioning-VS)', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(71, 1, '304', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ไปศึกษากฎ ระเบียบ หรือกระบวนการในการทำงานในหน่วยงานที่สังกัด เพื่อให้เรียนรู้กระบวนการทำงานที่ถูกต้อง
ให้เข้าร่วมกิจกรรมเพื่อความเป็นระเบียบของสถานที่ทำงาน อาทิ กิจกรรม 5 ส. เป็นต้น
หมุนเวียนให้ไปเรียนรู้งานกับบุคคลที่ได้ชื่อว่าเป็นผู้มีความละเอียดถี่ถ้วน เพื่อให้เข้าใจกระบวนการทำงานของเขาเหล่านั้น
การโค้ช (Coaching)
ให้คำแนะนำและสอนงานให้เข้าใจกระบวนการทำงานที่ถูกต้อง และมีมาตรฐาน 
เน้นย้ำความสำคัญของการทำงานที่ถูกต้อง สะอาดและเรียบร้อย
การฝึกอบรม
ความรู้เรื่อง 5 ส.', 'ชื่อหลักสูตรการฝึกอบรม: ความรู้เรื่อง 5 ส. 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่อง 5 ส.
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
5 ส. คืออะไร
วัตถุประสงค์และประโยชน์ของกิจกรรม 5 ส
แนวคิดเรื่อง 5 ส. (1. สะสาง (SEIRI) 2. สะดวก (SEITON)                         3. สะอาด  (SEISO) 4. สุขลักษณะ (SEIKETSU)และ 5. สร้างนิสัย (SHITSUKE))
แนวทางการดำเนินงานและการจัดตั้งคณะกรรมการ 5 ส.
ระยะเวลาของหลักสูตร
1/2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(72, 2, '304', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้มีการตรวจทานความถูกต้องของงานอย่างละเอียดรอบคอบทุกครั้งก่อนส่งงาน
ให้วางแผนหรือกระบวนการในการลดข้อผิดพลาดที่เคยเกิดขึ้นแล้วจากความไม่ตั้งใจ
มอบหมายให้รวมกลุ่มกับเพื่อนในหน่วยงานเดียวกันที่เป็นที่ยอมรับในการทำงานที่มีคุณภาพและถูกต้อง แล้วให้คอยสังเกต ตั้งคำถามและขอความเห็นจากบุคคลนั้นอยู่เสมอเพื่อปรับปรุงงานในหน้าที่ที่รับผิดชอบ
การโค้ช (Coaching)
เน้นย้ำความสำคัญของการตรวจทานความถูกต้องของงานอย่างละเอียดรอบคอบ เพื่อให้งานมีความถูกต้องสูงสุด
การฝึกอบรม
On-the-job training', 'ชื่อหลักสูตรการฝึกอบรม: On-the-job training
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจมาตรฐาน วิธีการทำงาน และกระบวนการในการทำงานของตำแหน่งงานของตนเองอย่างถูกต้อง และชัดเจน
เพื่อให้โอกาสผู้เข้าอบรมมีโอกาสสั่งสมความชำนาญในการทำงาน และสามารถปฏิบัติงานได้อย่างถูกต้อง โดยไม่มีข้อผิดพลาด และตรงตามมาตรฐานที่กำหนด
กรอบเนื้อหาของหลักสูตร
อธิบายกฎระเบียบ วิธีการปฏิบัติงาน และมาตรฐานความถูกต้องของงานในตำแหน่งงานที่รับผิดชอบ
จัดทำคู่มือ ระเบียบปฏิบัติ และกระบวนการทำงานของตำแหน่งงาน
ดำเนินการฝึกอบรมถึงหน้าที่ความรับผิดชอบ ขั้นตอนการปฏิบัติงาน โดยเน้นเรื่องความถูกต้องของงานควบคู่ไปกับการปฏิบัติงานจริง 
มีกิจกรรม และแบบทดสอบ รวมทั้งทดลองให้ปฏิบัติงานจริง เพื่อให้ผู้รับการฝึกอบรมเข้าใจในวิธีการปฏิบัติงาน สามารถปฏิบัติงานได้ถูกต้อง และสามารถนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร ครึ่งวัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(73, 3, '304', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้ดูแลความถูกต้องของงานของผู้อื่นในทีมงานที่อยู่ภายใต้ความรับผิดชอบ 
มอบหมายให้ไปตรวจสอบความถูกต้องโดยรวมของงานผู้อื่นหรือหน่วยงานอื่นตามอำนาจหน้าที่ โดยใช้มาตรฐานการปฏิบัติงาน หรือกฎหมาย ข้อบังคับ กฎระเบียบที่เกี่ยวข้อง
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางหรือกระบวนการในการเข้าไปทบทวนและตรวจสอบความถูกต้องรวมถึงแก้ไขงานของผู้อื่นที่มีประสิทธิภาพสูงสุดและเกิดการพัฒนาคุณภาพในอนาคตร่วมกัน
การฝึกอบรม
7 อุปนิสัยของผู้มีประสิทธิผลสูง ', 'ชื่อหลักสูตรการฝึกอบรม: 7 อุปนิสัยของผู้มีประสิทธิผลสูง 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจกรอบความคิด หลักการสำคัญของการใช้ชีวิตอย่างมีประสิทธิผลและสมดุล (ของ Stephen R. Covey) 
เพื่อให้ผู้เข้าอบรมสามารถนำ 7 อุนิสัยไปใช้ในชีวิตประจำวันให้เกิดประโยชน์
กรอบเนื้อหาของหลักสูตร
กรอบความคิด แนวคิด และหลักการพื้นฐาน รวมทั้งคุณลักษณะของความมีประสิทธิผลและความสมดุล และการนำ 7 อุปนิสัยไปใช้ในชีวิตประจำวัน 
อุปนิสัยที่ 1: บี โปรแอคทีฟ หยุดเพื่อคิดและตอบสนองตามหลักการ ใช้ภาษาแบบโปรแอคทีฟขยายขอบเขตแห่งอิทธิผล และเป็นผู้นำการเปลี่ยนแปลง
อุปนิสัยที่ 2: เริ่มต้นด้วยจุดมุ่งหมายในใจ สร้างวิสัยทัศน์ของผลลัพธ์ก่อนลงมือกระทำ สร้างและดำเนินชีวิตตามคำปณิธานส่วนตน
อุปนิสัยที่ 3: ทำสิ่งที่สำคัญก่อน มุ่งเน้นสิ่งที่มีความสำคัญมากในลำดับต้นๆ ขจัดสิ่งที่ไม่สำคัญออกไป วางแผนรายสัปดาห์ และวางแผนรายวัน
อุปนิสัยที่ 4: คิดแบบชนะ – ชนะ รักษาความสมดุลระหว่างความกล้าหาญและ ความใส่ใจต่อผู้อื่น แสวงหาผลประโยชน์ร่วมกัน สร้างข้อตกลงแบบชนะ – ชนะ 
อุปนิสัยที่ 5: เข้าใจผู้อื่นก่อน แล้วจึงให้ผู้อื่นเข้าใจเรา วิเคราะห์ก่อนให้คำแนะนำ ฟังอย่างเข้าอกเข้าใจ ทำให้ผู้อื่นเข้าใจเราจากมุมมองของเขา
อุปนิสัยที่ 6: ผนึกพลังประสานความต่าง ให้คุณค่าและร่วมยินดีกับความแตกต่าง ฝึกฝนการร่วมมืออย่างสร้างสรรค์ 
อุปนิสัยที่ 7: ลับเลื่อยให้คมอยู่เสมอ หมั่นเติมพลังอย่างสม่ำเสมอใน 4 มิติของชีวิต เข้มแข็งในช่วงเวลาที่ท้าทาย
คำมั่นสัญญา 7 อุปนิสัย การทำกิจกรรม และบทสรุป
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการเตรียมความพร้อมก่อนสัมมนา โดยต้องตอบแบบสอบถามก่อน รวมทั้งวางแผนร่วมกับผู้บังคับบัญชา ซึ่งจะช่วยให้ได้รับคุณค่าจากการเข้าสัมมนามากขึ้น หลังการฝึกอบรมจะมีการติดตามผลถึงคำมั่นสัญญา 7 อุปนิสัย และในขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(74, 4, '304', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้กำกับตรวจสอบขั้นตอนการปฏิบัติงานของทั้งหน่วยงานโดยละเอียด
มอบหมายให้เป็นผู้เสนอความคิดเห็นหรือข้อเสนอแนะในการปรับปรุงงานของผู้อื่นหรือหน่วยงานอื่นให้มีความถูกต้องตามขั้นตอนงานที่กำหนดไว้ 
มอบหมายให้เป็นผู้ปฏิบัติหน้าที่ในการตรวจสอบความก้าวหน้าและความถูกต้อง/คุณภาพของผลลัพธ์ของโครงการตามกำหนดเวลาที่วางไว้ 
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องกระบวนการในการตรวจสอบ ประเมินผลและติดตามที่มีประสิทธิภาพ
การฝึกอบรม
การบริหารโครงการ (Project Management)', 'ชื่อหลักสูตรการฝึกอบรม: การบริหารโครงการ (Project Management)
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจกระบวนการในการบริหารจัดการ และวางแผนงานโครงการ รวมทั้งได้เรียนรู้ทักษะการนำไปปฏิบัติ การติดตามตรวจสอบ และประเมินผลในการวางแผนโครงการ การบริหารบุคลากร การบริหารงบประมาณ และการบริหารทรัพยากรต่างๆ ที่เกี่ยวข้องในงานโครงการต่างๆ
กรอบเนื้อหาของหลักสูตร
การบริหารจัดการ การพัฒนา และการวางแผนโครงการที่มีประสิทธิภาพ
การจัดสรรงบประมาณ การบริหารทรัพยากร และการบริหารจัดการเวลา        (Time Management) ในการบริหารจัดการโครงการให้แล้วเสร็จตามเวลา
เครื่องมือและวงจรในการตรวจสอบการบริหารโครงการ และประเมินผลงานโครงการ
มีกิจกรรม แบบทดสอบ และทดลองให้ปฏิบัติจริงในการวางแผนและการบริหารจัดการโครงการ ตลอดการฝึกอบรมเพื่อให้ผู้รับการฝึกอบรมเข้าใจในกรอบแนวคิด ทฤษฎี และวิธีการนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(75, 5, '304', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้วางแผนและสร้างความชัดเจนของความถูกต้องและคุณภาพในขั้นตอนการทำงานภายในหน่วยงานทั้งหมด เพื่อเป็นต้นแบบให้พนักงานในหน่วยงานปฏิบัติตามได้
มอบหมายให้วางแผนการประเมินและติดตามผลงานหรือโครงการโดยละเอียดเพื่อควบคุมให้ผู้อื่นปฏิบัติตามขั้นตอนการทำงานที่วางไว้อย่างถูกต้องและเกิดความโปร่งใสตรวจสอบได้ 
มอบหมายให้สร้างระบบและวิธีการที่สามารถกำกับตรวจสอบความก้าวหน้า ความถูกต้องและคุณภาพของผลงานตามวัตถุประสงค์ของโครงการหรือภารกิจของหน่วยงาน ได้อย่างมีประสิทธิภาพสูงสุด
มอบหมายให้เป็นผู้ควบคุมความถูกต้องและคุณภาพทั้งหมดของเนื้องานส่วนใดส่วนหนึ่งหรือทุกส่วนในหน่วยงานที่รับผิดชอบ', 'การแลกเปลี่ยนความรู้และประสบการณ์ (Knowledge & Experience 
Sharing)
มีการแลกเปลี่ยนความรู้ และประสบการณ์กับผู้ทรงคุณวุฒิ หรือผู้เชี่ยวชาญเพื่อแลกเปลี่ยนประสบการณ์ในวางแผนอย่างชัดเจนเพื่อ ระบุหน้าที่รับผิดชอบ ระยะเวลาและหลักสำคัญๆ ในโครงการ เพื่อให้สามารถกำกับดูแลให้โครงการหรือการปฏิบัติงานมีความคืบหน้าไปตามที่กำหนดไว้และมั่นใจได้ว่าโครงการหรือการปฏิบัติงานสามารถเสร็จสมบูรณ์ได้ในระยะเวลาที่กำหนด
เน้นให้มีการทำงานร่วมกันอย่างใกล้ชิด ระหว่างผู้ทรงคุณวุฒิและผู้ต้องการการพัฒนา ซึ่งจะทำให้เกิดการเรียนรู้จากประสบการณ์จริง เพื่อสั่งสมประสบการณ์จริงในการสร้างแผนงานและความชัดเจนว่ามาตรฐานของความถูกต้องและคุณภาพในแต่ละขั้นตอนการทำงานเป็นอย่างไร และหมั่นติดตามกำกับดูแลเพื่อให้ได้มาตรฐานตามนั้น', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(76, 1, '305', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ค้นหา รวบรวม และศึกษาองค์ความรู้ ข้อมูล หรือข่าวสารต่างๆ ที่เกี่ยวข้องผู้รับบริการ ผู้ประกอบการ องค์กรคู่ค้า หรือองค์กรพันธมิตรต่างๆ ของหน่วยงาน หรือองค์กร
มอบหมายให้ไปติดต่อและสร้างสัมพันธ์กับผู้รับบริการ ผู้ประกอบการ องค์กรคู่ค้า หรือองค์กรพันธมิตรต่างๆ
หมุนเวียนให้ไปอยู่ในหน่วยงานที่ต้องพบปะและปฏิสัมพันธ์กับผู้รับบริการ ผู้ประกอบการ องค์กรคู่ค้า หรือองค์กรพันธมิตรต่างๆ
มอบหมายให้ศึกษา และวิเคราะห์ความต้องการองค์ความรู้ขั้นพื้นฐานของผู้รับบริการ หรือผู้ประกอบการ เพื่อให้สามารถให้องค์ความรู้ คำแนะนำแก่ผู้ประกอบการ หรือเครือข่ายให้เกิดประโยชน์ได้
การคิดและพฤติกรรม
หมั่นแสวงหาความรู้ ข้อมูล หรือติดตามข่าวสารต่างๆ ที่อาจเป็นประโยชน์ในการปฏิบัติงานของตน หรือของผู้อื่น เพื่อให้ความรู้ คำแนะนำ และข้อมูลต่างๆ แก่ผู้รับบริการ ผู้ประกอบการ องค์กรคู่ค้า หรือองค์กรพันธมิตรต่างๆ 
หมั่นแสวงหาโอกาส และช่องทางในการให้องค์ความรู้ คำแนะนำต่างๆ แก่ผู้ประกอบการ หรือเครือข่ายอย่างสม่ำเสมอ
หมั่นสื่อสารข้อมูลหรือข่าวสารที่จำเป็นให้ผู้รับบริการ ผู้ประกอบการ องค์กรคู่ค้า หรือองค์กรพันธมิตรต่างๆ อย่างสม่ำเสมอ
การโค้ช (Coaching)
ดูแล ให้คำแนะนำถึงความจำเป็น และความสำคัญในการให้องค์ความรู้ คำแนะนำต่างๆ ที่เป็นประโยชน์แก่ผู้ประกอบการ หรือเครือข่าย 
สอนกระบวนการในการดูแลและสร้างสัมพันธ์กับลูกค้า
การฝึกอบรม
On-the-job Training', 'ชื่อหลักสูตรการฝึกอบรม: On-the-job training
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจกระบวนการการทำงานในตำแหน่งงานของตนอย่างชัดเจน รวมถึงประโยชน์และความจำเป็นในการปฏิบัติงาน (โดยเน้นเรื่องการให้ความรู้ คำแนะนำ ข้อมูล และเทคโนโลยีต่างๆ แก่ผู้รับบริการ หรือผู้ประกอบการ)
เพื่อให้ผู้เข้าอบรมตระหนัก มีจิตสำนึก และเห็นความสำคัญของการปฏิบัติงาน (โดยเน้นเรื่องการให้ความรู้ คำแนะนำ ข้อมูล และ    เทคโนโลยีต่างๆ แก่ผู้รับบริการ หรือผู้ประกอบการ)
เพื่อให้โอกาสผู้เข้าอบรมมีโอกาสสั่งสมความชำนาญในการทำงาน
กรอบเนื้อหาของหลักสูตร
จัดทำคู่มือและกระบวนการทำงานในตำแหน่งงาน
บรรยายกระบวนการ วิธีการ แนวทาง ความสำคัญ และประโยชน์ในการให้ความรู้ คำแนะนำ ข้อมูล และเทคโนโลยีต่างๆ แก่ผู้รับบริการ หรือผู้ประกอบการ
มีกิจกรรมและ Case Study ตลอดการฝึกอบรมเพื่อให้ผู้รับการฝึกอบรมเข้าใจในกรอบแนวคิด ทฤษฎี และวิธีการนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร
ครึ่งวัน - 1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร
', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(77, 2, '305', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นผู้นำเสนอผลงานของหน่วยงานแก่เพื่อนร่วมงาน ผู้บริหาร ผู้รับบริการ หรือผู้ประกอบการในการประชุมต่างๆ 
มอบหมายให้เป็นผู้รับผิดชอบโครงการหรือกิจกรรมต่างๆ ที่ต้องให้ความรู้แก่ผู้รับบริการ หรือผู้ประกอบการ
การคิดและพฤติกรรม
ลองคิดถึงสถานการณ์หรือผู้คนที่ท่านรู้สึกว่าเป็นผู้ที่ท่านรับฟังได้ยากลำบากที่สุด คิดทั้งก่อนและหลังเผชิญกับสถานการณ์ดังกล่าวแล้วคิดถึงทางเลือกอื่นๆ ที่จะสามารถแก้ปัญหา/สถานการณ์นั้นๆ ได้ ใช้การฟังให้เป็นประโยชน์ในการพัฒนาตนเอง นั่นคือ ฟังแล้วพยายามสร้างความสัมพันธ์ต่อไป
เมื่อจบการสนทนา หรือการให้ความรู้ คำแนะนำแต่ละครั้ง พยายามทำให้เป็นนิสัยในการคิดว่า คู่สนทนารู้สึกอย่างไรเมื่อเดินจากไป ลองคิดวิเคราะห์ว่าท่าทีของตนมีผลต่อปฏิกิริยาของคู่สนทนาอย่างไรบ้าง
ศึกษาว่าผู้คนเห็นว่าอะไรเป็นสิ่งสำคัญสำหรับพวกเขาและมีอะไรเป็นแรงผลักดัน อาสาที่จะให้คำแนะนำหรือคำปรึกษาเพื่อช่วยแก้ไขปัญหาของพวกเขาได้
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการเป็นผู้นำเสนอที่ดี 
การฝึกอบรม
เทคนิคการนำเสนอ การให้ความรู้ และคำแนะนำ', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการนำเสนอ การให้ความรู้ และ
คำแนะนำ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมได้รู้จักการกำหนดเป้าหมาย และวัตถุประสงค์ในการนำเสนอ การให้ความรู้ และการแนะนำต่างๆ แก่ผู้อื่น
เพื่อให้ผู้เข้าอบรมเข้าใจขบวนการสังเกตและปรับแนวทางการนำเสนอ การให้ความรู้ และการให้คำแนะนำด้วยการวิเคราะห์ผู้ฟังอย่างมีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมสามารถจัดลำดับความคิดเห็นและขบวนการนำเสนอ การให้ความรู้ และการให้คำแนะนำอย่างมีขั้นตอน และเข้าใจง่าย
เพื่อให้ผู้เข้าอบรมสามารถจัดลำดับข้อมูลได้สมบูรณ์ พร้อมประยุกต์เครื่องมือ และอุปกรณ์ต่าง ในการนำเสนอ การให้ความรู้ และการให้คำแนะนำได้อย่างมีประสิทธิภาพ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการและความสำคัญของการนำเสนอ การให้ความรู้ และการให้คำแนะนำ
รูปแบบการนำเสนอที่มีประสิทธิผล
ทักษะและเทคนิคการนำเสนอที่เหมาะสมกับสถานการณ์
การวางแผนและการเตรียมการก่อนนำเสนอ การให้ความรู้ และการให้คำแนะนำ
ทักษะที่ใช้ในการนำเสนอ การให้ความรู้ และการให้คำแนะนำ
การเพิ่มประสิทธิภาพในการพูดเพื่อนำเสนอ และการให้ความรู้
ระยะเวลาของหลักสูตร 1-2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(78, 3, '305', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ดูแลและสร้างสัมพันธ์กับผู้รับบริการ หรือผู้ประกอบการ โดยมุ่งเน้นการสร้างความร่วมมือหรือความสัมพันธ์ที่เป็นประโยชน์กับทั้งสองฝ่าย
มอบหมายให้จัดกิจกรรมที่สร้างประโยชน์ให้กับผู้รับบริการ หรือผู้ประกอบการ 
มอบหมายให้คิดแผนงานที่จะสามารถให้ความสนับสนุน ความช่วยเหลือ หรือให้ความรู้ คำแนะนำ และเทคนิคต่างๆ แก่ผู้รับบริการ หรือผู้ประกอบการ เพื่อให้งานที่ตั้งเป้าหมายร่วมกันประสบความสำเร็จ
มอบหมายให้รับฟังปัญหาหรือความต้องการของผู้รับบริการ หรือผู้ประกอบการ แล้วหาทางออกที่เกิดประโยชน์กับผู้รับบริการ หรือผู้ประกอบการสูงสุด
มอบหมายให้เป็นวิทยากรในการสัมมนา การฝึกอบรม หรือการให้ความรู้แก่ผู้อื่นที่มีความแตกต่าง และหลากหลาย
การคิดและพฤติกรรม
ระลึกอยู่เสมอว่าแต่ละคนต่างก็มีภูมิหลังที่แตกต่างกัน อันนำมาสู่ค่านิยมและความเชื่อที่แตกต่างกันด้วย เมื่อลูกค้าหรือคู่ค้าพูดถึงภูมิหลัง หรือความเชื่อที่แตกต่างให้รับฟังอย่างเป็นกลางและไม่ตัดสิน โดยสงวนท่าทีและใช้ความรู้ที่ท่านได้รับจากการสนทนาหารือกันเกี่ยวกับความเชื่อและค่านิยมต่างๆ มาใช้ให้เป็นประโยชน์ในการเข้าใจความต้องการและความคาดหวังของลูกค้าหรือคู่ค้านั้น
หมั่นรักษาความสัมพันธ์หรือความร่วมมือที่ดีกับลูกค้า หรือคู่ค้าผ่านกิจกรรมหรือการติดต่อสัมพันธ์ที่สร้างสรรค์', 'การคิดและพฤติกรรม (ต่อ)
ใส่ใจรักษาสายสัมพันธ์ที่ดีให้ต่อเนื่องและยาวนานโดยการเอื้อเฟื้อให้ความช่วยเหลือหรือให้คำแนะนำที่เป็นประโยชน์ด้วยความจริงใจในโอกาสต่างๆ ที่เหมาะสม
หมั่นปรับเปลี่ยนเทคนิค วิธีการ รูปแบบ และแนวทางในการพัฒนา และการให้ความรู้ให้เหมาะสม และสอดคล้องตามความต้องการของผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายอย่างแท้จริง  
หมั่นเยี่ยมเยียน ลงพื้นที่ และไปมาหาสู่ผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายอย่างสม่ำเสมอ เพื่อให้รู้ความต้องการที่แท้จริง และสร้างสายสัมพันธ์ให้แน่นแฟ้นมากยิ่งขึ้น
การโค้ช (Coaching)
เน้นให้เห็นถึงประโยชน์และความสำคัญของการแลกเปลี่ยนข้อมูลหรือความคิดเห็นกันระหว่างองค์กรกับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายอย่างสม่ำเสมอเพื่อให้เกิดความเข้าใจและความร่วมมือที่ดีต่อ กันมากยิ่งขึ้น
ดูแล แนะนำ และให้คำปรึกษาเรื่องการดูแลและรักษาสัมพันธภาพกับผู้รับบริการ ผู้ประกอบการ หรือเครือข่าย
การฝึกอบรม
การเป็นวิทยากรที่ดีชื่อหลักสูตรการฝึกอบรม: การเป็นวิทยากรที่ดี
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถค้นคว้า รวบรวม กลั่นกรองข้อมูล ความรู้ และประสบการณ์อย่างเป็นระบบ เพื่อใช้ในการเผยแพร่ ถ่ายทอด และให้ความรู้แก่ผู้อื่นได้อย่างถูกต้อง และชัดเจน
เพื่อให้ผู้เข้าอบรมสามารถเป็นวิทยากรในการฝึกอบรม สอนงาน ให้ความรู้ และกิจกรรมการพัฒนาต่างๆ ได้
เพื่อให้ผู้เข้าอบรมสามารถวางแผนการพัฒนา การฝึกอบรม ตลอดจนการให้ความรู้ได้อย่างเป็นระบบ จนเกิดประโยชน์ในงาน และผู้อื่น
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการ วิธีการ และกระบวนการเป็นวิทยากรที่ดี
กลยุทธ์ และเทคนิคต่างๆ ในการฝึกอบรม
เทคนิคการสอน และการเป็นวิทยากรที่ดี
การวางแผนการฝึกอบรมและการพัฒนา และการเตรียมการสอน 
การสร้างและการใช้สื่อการสอน และการให้ความรู้
การปฏิบัติ: การฝึกบรรยาย และการฝึกบรรยายประกอบเทคนิคการฝึกอบรมอื่นๆ
ระยะเวลาของหลักสูตร
3 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(79, 4, '305', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้วางแผนว่าจะสร้างผลประโยชน์ร่วมกันกับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายอย่างยั่งยืนได้อย่างไร แล้วให้นำแผนนั้นไปปฏิบัติให้เกิดขึ้นจริงตามแผนที่วางไว้
ให้คิดแนวทางในระยะสั้นและระยะยาวที่องค์กรสามารถสร้างสรรค์ผลประโยชน์ร่วมกับกับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายรายใหม่ๆ ได้ 
มอบหมายให้ไปช่วยเหลือผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายยามวิกฤติ เพื่อให้เข้าใจความต้องการที่แท้จริงของผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายและแสดงน้ำใจยามจำเป็น
การคิดและพฤติกรรม
พิจารณาว่าจะสรรสร้างผลประโยชน์ร่วมกันระหว่างองค์กรกับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายตนรับผิดชอบได้อย่างไร ที่จะส่งเสริมให้เกิดมิตรภาพและผลประโยชน์ร่วมกันในระยะยาว
พยายามสร้างความเชื่อถือและมิตรภาพระยะยาว โดยในบางครั้งอาจจำเป็นต้องใช้ความพยายามอย่างหนักหรือเสียสละผลประโยชน์ในระยะสั้นๆ
หยิบยื่นความช่วยเหลือให้กับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายในยามที่พวกเขาประสบวิกฤติโดยไม่ต้องร้องขอ เพื่อแสดงความมีน้ำใจและใส่ ใจต่อการรักษาสัมพันธภาพที่ดีระหว่างกัน
สัมพันธภาพที่ดีเกิดจากการเปิดใจและความซื่อตรง ดังนั้นพยายามปฏิบัติต่อผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายด้วยความจริงใจอย่างสม่ำเสมอ และร่วมกันสรรสร้างให้เกิดประโยชน์แก่ทั้งสองฝ่าย', 'การคิดและพฤติกรรม (ต่อ)
หมั่นวิเคราะห์ ข้อจำกัด ข้อบกพร่อง และโอกาส ฯลฯ ที่เป็นผลกระทบต่อการพัฒนาและการเพิ่มประสิทธิภาพในการประกอบการของผู้ประกอบการ หรือเครือข่ายอยู่เสมอ
หมั่นสร้าง รักษา และมีความสัมพันธ์อันดี และแน่นแฟ้นกับผู้ประกอบการ หรือเครือข่ายในความรับผิดชอบ
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาด้านการวิเคราะห์ข้อจำกัด ข้อบกพร่อง โอกาส และจุดแข็ง จุดอ่อน (SWOT Analysis)
การฝึกอบรม
Client Relationship Managementชื่อหลักสูตรการฝึกอบรม: Client Relationship Management
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความรู้ และความเข้าใจที่ถูกต้องเกี่ยวกับการบริหารลูกค้าสัมพันธ์ 
เพื่อให้ผู้เข้าอบรมสามารถประยุกต์ใช้แนวคิดให้เกิดประโยชน์ในงานได้
เพื่อให้ผู้เข้าอบรมสามารถสามารถบริหารความสัมพันธ์ที่ดีกับลูกค้าได้ในระยะยาว
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
“CRM การบริหารลูกค้าสัมพันธ์แห่งโลกธุรกิจยุคปัจจุบัน” 
เป้าหมายของ CRM ส่วนประกอบของ CRM ประโยชน์ของ CRM 
แนวคิดเกี่ยวกับ CRM และ CRM คืออะไร 
การคาดหวังของลูกค้าและการวิเคราะห์พฤติกรรมผู้บริโภค (Customer Expectation and Consumer Behavior analysis) แบบจำลองการจัดการลูกค้าสัมพันธ์ (A Customer Relationship Management Model)              
ความสำคัญของคุณค่าของลูกค้า (The Importance of Customer Value) การเป็นองค์กรเน้นลูกค้า (Being Customer Oriented) การจัดการคุณภาพบริการ (Managing Service Quality)
การประยุกต์การวิจัยตลาดเพื่อ CRM แนวคิดการสร้าง Customer Share กิจกรรมการตลาดเพื่อสร้างสัมพันธ์กับลูกค้าในระยะยาว (Retention Strategies for Long-term Relationship) 
แนวคิด Retention and Customer Loyalty Introduction: Strategy in CRM (แนวคิดเบื้องต้นของกลยุทธ์ของ CRM) กรอบเนื้อหาของหลักสูตร (ต่อ)
กลยุทธ์ลูกค้า (Customer Strategy) กลยุทธ์ตราสินค้าที่มีต่อ CRM (Brand Strategy forefront of Next-Generation CRM) 
กลยุทธ์ CRM ในการสร้าง Customer Experience การบูรณาการกลยุทธ์ CRM (Integrating CRM strategies) 
แนวคิดตลาดบริการ (Service Marketing) และ The Customer Marketing Model 
จากแนวคิดการตลาดแบบแลกเปลี่ยนมาสู่แนวคิดการตลาดสร้างสัมพันธ์ (Relationship Marketing) แนวคิดการสร้าง Customer Share 
การใช้เทคโนโลยีในการจัดการ CRM : Today and Tomorrow Database Marketing, Data Warehouse and Data Mining 
Customer Pyramid: Profitable Customer เหตุใด CRM จึงไม่สำเร็จ (Why CRM doesn't work?) 
กลยุทธ์ CRM (Integrating CRM strategies) การรักษาลูกค้าปัจจุบัน การหาลูกค้าใหม่ และจูงใจลูกค้าเก่า 
การสร้างสัมพันธ์กับกลุ่มลูกค้า พันธมิตรทางธุรกิจ กิจกรรมการตลาดเพื่อสร้างสัมพันธ์กับลูกค้าในระยะยาว 
กิจกรรมภาคปฏิบัติ และการวิเคราะห์กรณีศึกษา และนโยบาย  CRM  ของบริษัทต่างๆ (Best Practice)
ระยะเวลาของหลักสูตร 3 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(80, 5, '305', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้วางแผนว่าจะรักษามิตรภาพกับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายในระยะยาวจนเกิดเป็นความไว้ใจและเป็นพลังที่เข้มแข็งเพื่อสรรสร้างให้เกิดประโยชน์สูงสุดร่วมกันอย่างไร แล้วให้นำแผนนั้นไปปฏิบัติให้เกิดขึ้นจริงตามแผนที่วางไว้
สร้างหรือหมั่นให้งานและโอกาสที่จะทำให้เป็นที่รู้จักอย่างกว้างขวางในแวดวงที่เกี่ยวข้อง
มอบหมายให้สร้างวัฒนธรรมหรือบรรยากาศของหน่วยงาน หรือองค์กรที่เน้นการส่งเสริมและพัฒนา การให้ความรู้ และการแลกเปลี่ยนความรู้อย่างเป็นรูปธรรม
การคิดและพฤติกรรม
หยิบยื่นความช่วยเหลือให้กับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายในยามที่พวกเขาประสบวิกฤติโดยไม่ต้องร้องขอ เพื่อแสดงความมีน้ำใจและใส่ ใจต่อการรักษาสัมพันธภาพที่ดีระหว่างกัน
สัมพันธภาพที่ดีเกิดจากการเปิดใจและความซื่อตรง ดังนั้นพยายามปฏิบัติต่อผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายด้วยความจริงใจอย่างสม่ำเสมอ และร่วมกันสรรสร้างให้เกิดประโยชน์แก่ทั้งสองฝ่าย
หมั่นรักษาความน่าเชื่อถือไว้และความเป็นมืออาชีพกับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายทุกรายอย่างสม่ำเสมอ 
รักษามิตรภาพกับผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายในระยะยาว โดยสร้างความไว้ใจและประโยชน์สูงสุดร่วมกัน', 'การคิดและพฤติกรรม (ต่อ)
ผูกมิตรและสานสัมพันธ์ ตลอดจนสานประโยชน์อย่างจริงใจแก่ผู้รับบริการ ผู้ประกอบการ หรือเครือข่ายจำนวนมากอย่างสม่ำเสมอและ ต่อเนื่องเป็นระยะเวลานาน
การโค้ช (Coaching)
ให้คำแนะนำ และแลกเปลี่ยนประสบการณ์กับผู้เชี่ยวชาญด้านการกำหนดนโยบาย ยุทธศาสตร์ และกลยุทธ์ด้านการพัฒนาผู้อื่นในระยะยาว เพื่อนำมาประยุกต์ใช้ในการปฏิบัติงาน
การฝึกอบรม
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องบริการที่ดี (Service Mind- SERV) 
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องความร่วมแรงร่วมใจ (Teamwork- TW)
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการสั่งสมความเชี่ยวชาญในงานอาชีพ (Expertise- EXP)', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(81, 1, '306', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้จัดทำขั้นตอนการทำงาน และกระบวนการปฏิบัติงานต่างๆ ของหน่วยงานที่สังกัดอยู่ 
มอบหมายให้จัดทำแผนงานก่อนการทำงานในโครงการของหน่วยงาน
มอบหมายให้วางแผนงานโครงการของหน่วยงาน โดยให้มีการกำหนดผลลัพธ์ที่ชัดเจน สิ่งที่ต้องจัดเตรียม และกิจกรรมต่างๆ ที่จะเกิดขึ้นอย่างถูกต้อง
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการใช้เครื่องมือ และระบบต่างๆ ในหน่วยงาน
สอนงานในเรื่องการวางแผนงาน
การฝึกอบรม
การวางแผนงานเบื้องต้น', 'ชื่อหลักสูตรการฝึกอบรม: การวางแผนงานเบื้องต้น
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการวางแผนงานในเบื้องต้น
เพื่อให้ผู้เข้าอบรมเข้าใจหลักการกำหนดเป้าหมายและผลงาน และสามารถวางแผนตามลำดับความสำคัญของงาน
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการกำหนดเป้าหมายและผลงาน เพื่อเตรียมการวางแผน
การตั้งความคาดหวังของงาน (Performance Expectations)
7 คำถามเพื่อตรวจสอบความเข้าใจและความพึงพอใจในงานของทีมงาน
การกำหนดเป้าหมาย (Goal Setting) 
การวางแผนและจัดลำดับความสำคัญของเป้าหมาย (Planning and Prioritizing) 
การตั้งเป้าหมายส่วนบุคคลแบบ SMART (Personal Objective Setting) 
แผนการควบคุมและการติดตามงาน (Following Up) 
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(82, 2, '306', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้ระบุกิจกรรม หรือผลลัพธ์ต่างๆ ที่จะเกิดขึ้นภายในงานหรือโครงการ 
มอบหมายงานที่มีความหลากหลายและมีความสำคัญเท่าเทียมกันในช่วงเวลาพร้อมๆ กัน เพื่อพัฒนาการวางแผนงานด้านการจัดลำดับความสำคัญหรือความเร่งด่วนของงานได้อย่างมีประสิทธิภาพ
มอบหมายงานให้จัดแผนงานการดำเนินโครงการในหน่วยงาน ขั้นตอนการดำเนินงาน ตารางเวลา และผลลัพธ์ของโครงการ เพื่อให้สามารถจัดการโครงการได้บรรลุตามแผนและเวลาที่วางไว้
มอบหมายให้ดำเนินการวิเคราะห์หาข้อดี ข้อเสียและผลต่อเนื่องของแผนงานที่วางไว้ในโครงการที่หน่วยงานรับผิดชอบ
มอบหมายให้มีการปรับเปลี่ยนรูปแบบการทำงาน ให้สามารถตอบโจทย์แผนงานที่เปลี่ยนไป
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการวางแผนงาน การวางแผนขั้นตอนการทำงาน หรือวางแผนงานโครงการ
สอนงานให้สามารถจัดลำดับความสำคัญหรือความเร่งด่วนของงานได้
การฝึกอบรม
การวางแผนงานและการตั้งเป้าหมาย (Goal Setting)
การวางแผนงาน ', 'ชื่อหลักสูตรการฝึกอบรม: การวางแผนงานและการตั้งเป้าหมาย
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความรู้และเข้าใจในเรื่องการกำหนดเป้าหมาย
เพื่อให้ผู้เข้าอบรมมีเครื่องมือในการวางแผนงานและกิจกรรมต่างๆ ให้มีประสิทธิภาพสูงสุด
กรอบเนื้อหาของหลักสูตร
กระบวนการและหลักการกำหนดเป้าหมายการทำงานที่มีประสิทธิภาพ
เครื่องมือและแนวทางในการวางแผนงาน กิจกรรม ผลลัพธ์ และระยะเวลาให้สอดคล้องกับเป้าหมาย
การติดตามและจัดลำดับความสำคัญของงาน เพื่อให้ได้เป้าหมายที่มีประสิทธิภาพมากขึ้น
มีกิจกรรมและ Case Study ตลอดการฝึกอบรมเพื่อให้ผู้รับการฝึกอบรมเข้าใจในกรอบแนวคิด ทฤษฎี และวิธีการนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร
ชื่อหลักสูตรการฝึกอบรม: การวางแผนงาน
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความรู้ ความเข้าใจในแนวคิด และหลักการของการวางแผน
เพื่อให้ผู้เข้าอบรมมีทักษะในการวางแผนในการปฏิบัติงานอย่างมีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมมีความรู้ ความเข้าใจ และทักษะในเรื่องการทำงานในภาวะวิกฤติและการจูงใจ
กรอบเนื้อหาของหลักสูตร
กรณีศึกษาการวางแผนเพื่อการแก้ไขปัญหาการทำงาน 
เนื้อหา กรณีศึกษาเกี่ยวกับปัญหาในการบริหารงานซึ่งต้องแก้ไขปัญหาด้วยการวางแผน
วิธีการ ใช้กรณีศึกษาการประชุมระดมสมองของกลุ่มย่อย และการนำเสนอแนวคิด
แนวคิด หลักการ วิธีการในการวางแผน 
เนื้อหา ความหมาย ความสำคัญ ประโยชน์ และเทคนิควิธีการในการวางแผน
วิธีการ ใช้การบรรยาย การถามตอบ  
ฝึกปฏิบัติการวางแผนเพื่อการแก้ไขปัญหาในการทำงาน 
เนื้อหา การค้นหาปัญหาในการทำงาน และการวิเคราะห์ปัญหาในการทำงานด้วยการใช้เทคนิคการวิเคราะห์งาน
วิธีการ การประชุมระดมสมองของกลุ่มย่อย และการนำเสนอแนวคิด
ฝึกปฏิบัติการวางแผนรายบุคคล 
เนื้อหา แต่ละบุคคลคัดเลือกปัญหาในข้อ 3 มาจัดทำแผนการดำเนินการรายบุคคล
วิธีการ ฝึกปฏิบัติรายบุคคล และการนำเสนอแนวคิดกรอบเนื้อหาของหลักสูตร (ต่อ)
การบริหารงาน/ทำงานภายใต้ภาวะวิกฤติ 
เกมเพื่อการเรียนรู้มีวัตถุประสงค์เพื่อเรียนรู้การทำงานในภาวะวิกฤติ
แนวคิด และเทคนิคการทำงานในภาวะวิกฤติ
เทคนิคการจูงใจผู้ใต้บังคับบัญชา/ผู้อื่น
เนื้อหา ทฤษฎีความต้องการของมนุษย์  หลักการและเทคนิคในการจูงใจ          
วิธีการ ใช้กรณีศึกษา การประชุมเชิงปฏิบัติ (Workshop) การวางแผนเพื่อการจูงใจแก้ปัญหา Turnover และการนำเสนอแนวคิด
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(83, 3, '306', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ให้ปรับปรุงระบบการทำงาน วิธีการ ขั้นตอน และกระบวนการดำเนินงานในหน่วยงาน
มอบหมายให้วางแผนงานโครงการขนาดใหญ่ที่ต้องทำงานร่วมกับเครือข่ายภาคี ผู้ประกอบการ หรือเจ้าหน้าที่จากหลายสำนัก
มอบหมายให้วางแผนงานที่มีความเชื่อมโยงหรือซับซ้อนกันหลายๆ งานหรือหลายๆ โครงการ
มอบหมายให้วางแผนงานให้สำนัก 
มอบหมายงานที่ยุ่งยากและซับซ้อนโดยในงานจะต้องมี
การระบุถึงปัญหาและประเด็นเบื้องลึกต่างๆ (Issues)
แนวทางหรือทางเลือกต่างๆ ในการแก้ไขปัญหา
การวิเคราะห์ข้อดี ข้อเสียในแต่ละทางเลือก
แผนการในการดำเนินงานหลังจากเลือกทางเลือกแล้ว
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการวางแผนอย่างมีประสิทธิภาพ
การฝึกอบรม
การวางแผนอย่างมีประสิทธิภาพ', 'ชื่อหลักสูตรการฝึกอบรม: การวางแผนอย่างมีประสิทธิภาพ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจถึงกรอบแนวคิดในการวางแผนงาน
เพื่อให้ผู้เข้าอบรมสามารถนำเครื่องมือและกระบวนการการวางแผนงานไปใช้ให้เกิดประโยชน์กับองค์กร
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย 
การบรรยายเพื่อให้เห็นถึงปัญหาของการ                                                  จัดทำแผนงานที่ไม่มีประสิทธิภาพและแนวทาง                          แก้ไข
หลักการและความสำคัญของการวางแผนงาน
เทคนิคการวิเคราะห์หาตัวชี้วัดและกำหนด                     เป้าหมายของหน่วยงาน
ขั้นตอนการวางแผนอย่างมีประสิทธิภาพ
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าฝึกอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(84, 4, '306', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ศึกษากระแสหรือสถานการณ์ภายนอกที่จะกระทบต่อองค์กร แล้วนำผลการศึกษามากำหนด/วางแผนว่าจะสามารถปรับเปลี่ยนกระบวนการ ระบบ เทคโนโลยีขององค์กรได้อย่างไรให้สามารถตอบสนองต่อสถานการณ์ภายนอกเหล่านั้นได้อย่างมีประสิทธิภาพสูงสุด
มอบหมายให้ศึกษาและทบทวนเพื่อสรุปความสำเร็จหรือความผิดพลาดของกระบวนการการทำงานในปีที่ผ่านมา และนำเสนอแผนการปรับปรุงและเตรียมความพร้อมที่มีประสิทธิภาพ
มอบหมายให้เตรียมแผนรับมือกับปัญหาเศรษฐกิจในพื้นที่
มอบหมายให้วางแผนงานที่มีความเชื่อมโยงหรือซับซ้อนกันหลายๆ งานหรือหลายๆ โครงการ
การฝึกอบรม
Scenario Planning', 'ชื่อหลักสูตรการฝึกอบรม: Scenario Planning 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถเข้าใจถึงกรอบแนวคิดในเรื่องการวางแผนภาพในอนาคต 
เพื่อให้ผู้เข้าอบรมมีเครื่องมือในการบริหารจัดการเชิงรุก
กรอบเนื้อหาของหลักสูตร
กรอบแนวคิดในเรื่อง Scenario Planning
เครื่องมือและกระบวนการคิดแบบ Scenario Planning เช่น การสังเคราะห์แนวโน้ม การกำหนดตัวแปรที่ไม่แน่นอนในอนาคต (Uncertainty) 
การคัดสรรทางเลือกที่จะจัดการกับปัญหาหรือโอกาสในแต่ละ Scenario
ความสัมพันธ์ของ Scenario Planning กับการดำเนินงานเชิงรุก และการคิดเชิงกลยุทธ์
มีกิจกรรมต่างๆ เพื่อให้ผู้เข้าอบรมได้เข้าใจถึงกรอบแนวคิดและนำ Scenario Planning ไปใช้
ระยะเวลาของหลักสูตร ไม่น้อยกว่า 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(85, 5, '306', 'การมอบหมายงานและการหมุนเวียนงาน
ให้เป็นผู้นำในการวางกลยุทธ์ขององค์กร โดยพิจารณาจากสถานการณ์เฉพาะหน้าที่เกิดขึ้นอย่างเป็นระบบ
ให้มีส่วนร่วมในโครงการขนาดใหญ่ขององค์กร/กระทรวงอุตสาหกรรม และเป็นผู้นำในการวางยุทธศาสตร์การดำเนินงาน 
ให้เป็นผู้นำในการบริหารการเปลี่ยนแปลงในเชิงนโยบายของโครงการขนาดใหญ่ในองค์กร
ให้วางแผนงานเชิงนโยบายที่จะมีผลกระทบต่อการเปลี่ยนแปลงในภาพรวมขององค์กรและกระทรวงอุตสาหกรรมให้เติบโตอย่างยั่งยืน
มอบหมายให้ปรับกลยุทธ์และวางแผนอย่างรัดกุมและเป็นระบบให้เข้ากับสถานการณ์ที่เกิดขึ้นอย่างไม่คาดคิด 
มอบหมายให้เป็นที่ปรึกษาในการปฏิบัติงานให้กับหน่วยงานอื่นๆ เพื่อให้สามารถสั่งสมประสบการณ์จนเกิดเป็นความเชี่ยวชาญในงาน
การฝึกอบรม
การวางแผนเชิงกลยุทธ์
การกำหนดวิสัยทัศน์ และการวางแผนกลยุทธ์', 'ชื่อหลักสูตรการฝึกอบรม: การวางแผนเชิงกลยุทธ์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด และให้ความสำคัญของการคิดเชิงกลยุทธ์
เพื่อให้ผู้เข้าอบรมเข้าใจ และสามารถนำไปใช้ถึงวิธีการคิด วิเคราะห์ และมองหาโอกาสในเชิงกลยุทธ์ โดยใช้ข้อมูล และหลักการทฤษฎีมาประยุกต์ให้เกิดประโยชน์
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญ และองค์ประกอบของการคิดเชิงกลยุทธ์ เพื่อความสำเร็จขององค์กร
ขั้นตอน และกระบวนการในการ Moving from Operational Manager to a Strategic Thinker 
หลักการวิเคราะห์จุดแข็ง จุดอ่อน โอกาส และข้อจำกัดของธุรกิจ (SWOT Analysis) รวมทั้งการวิเคราะห์คู่แข่ง และตลาด
ข้อมูลที่จำเป็นต้องใช้เพื่อการคิด และมองปัญหาในเชิงกลยุทธ์และโอกาสในทางธุรกิจ
ข้อจำกัดของการที่ผู้บริหารไม่สามารถคิดในเชิงกลยุทธ์ได้ และวิธีการขจัดข้อจำกัด
แบบทดสอบ (Case Study) ก่อนการเข้ามีการสัมมนา เพื่อวัดการคิดเชิงกลยุทธ์เพื่อให้ผู้บริหารได้ศึกษาและลองใช้ข้อมูล เพื่อตัดสินใจในเชิงกลยุทธ์
การจำลองสถานการณ์ และแบบฝึกหัดการออกแบบธุรกิจ และการตัดสินใจเชิงธุรกิจ เพื่อสร้างข้อได้เปรียบทางธุรกิจ และสร้างผลประโยชน์ในระยะยาว
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
ผู้เข้าอบรมจะถูกประเมินด้วยแบบทดสอบก่อนการเข้าสัมมนาเพื่อวัดระดับความสามารถ และในระหว่างการสัมมนาจะมีแบบฝึกหัดเพื่อวัดผลการคิดเชิง    กลยุทธ์ด้านการออกแบบธุรกิจ และเมื่อสิ้นสุดการฝึกอบรมจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้ชื่อหลักสูตรการฝึกอบรม: การกำหนดวิสัยทัศน์และการวางแผนกลยุทธ์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมได้รับทราบแนวคิดและประสบการณ์ที่จำเป็นต่อการจัดการผลการดำเนินงานองค์กรบนฐานยุทธศาสตร์การพัฒนาองค์กรที่สอดคล้องกับแนวทางการปฏิรูประบบการบริหารภาครัฐรวมทั้งแนวโน้มการเปลี่ยนแปลงที่สำคัญ 
เพื่อให้ผู้เข้าอบรม มีความรู้ความเข้าใจในกระบวนการ สามารถนำไปปรับใช้ภายในหน่วยงานได้ 
เพื่อให้ผู้เข้าอบรมมีทักษะความสามารถ ดังนี้
สามารถจัดทำวิสัยทัศน์ขององค์กร 
สามารถจัดทำแผนกลยุทธ์ขององค์กร 
กำหนดดัชนีชี้วัดผลการดำเนินงานขององค์กร 
สามารถเสนอแนวทางการปรับปรุงกระบวนการและแนวทางการทำงาน
เพื่อให้ผู้เข้าอบรมเข้าใจและพัฒนางานเพื่อการนำองค์กรให้บรรลุวิสัยทัศน์
เพื่อให้ผู้เข้าอบรมสามารถสรุปและเชื่อมโยงภาพความสัมพันธ์ของกระบวนการและนำไปประยุกต์ใช้ในการทำงานด้านอื่นๆ ได้อย่างมีประสิทธิภาพ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
บริบทการบริหารจัดการองค์กร
	1. แนวคิดของการบริหารในยุคเปลี่ยนแปลง
	2. แนวคิดในการปฏิรูปการบริหาร
	3. การวิเคราะห์การบริหารองค์กรตามแบบจำลองในการพัฒนา
	4. การจัดการเชิงกลยุทธ์
	5. แนวคิดในการพัฒนาบุคลากร
การวิเคราะห์ปัจจัยแวดล้อมขององค์กร (SWOT Analysis) และการวิเคราะห์ปัจจัยแวดล้อมภายในและภายนอกกรอบเนื้อหาของหลักสูตร (ต่อ)
การจัดทำวิสัยทัศน์ (Vision) และแผนกลยุทธ์ (Strategic Plan)
	1. การกำหนดเป้าหมายองค์กร
	2. การจัดทำวิสัยทัศน์
	3. การจัดทำแผนกลยุทธ์
การแปลงแผนสู่การปฏิบัติ
	1. การจัดทำโครงการ/แผนงาน
	2. การวัดความสำเร็จของการดำเนินงานและการกำหนดดัชนีชี้วัดความสำเร็จ
	3. การประเมินผลการดำเนินงานโดยใช้ Balance Scorecard
	4. การเชื่อมโยง Strategy Map
สรุปผลการสัมมนาและนำเสนอ
	1. นำเสนอผลงานจากการระดมความคิด
	2. การบูรณาการความรู้
ระยะเวลาของหลักสูตร 3 วัน
แนวทางการประเมินผล
ผู้เข้าอบรมจะถูกประเมินด้วยแบบทดสอบก่อนการเข้าสัมมนาเพื่อวัดระดับความสามารถ และในระหว่างการสัมมนาจะมีแบบฝึกหัดเพื่อให้จัดทำวิสัยทัศน์ และแผนกลยุทธ์ และเมื่อสิ้นสุดการฝึกอบรมจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(86, 1, '307', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้วางแผนและวิเคราะห์ความคุ้มค่าของการดำเนินการในหน่วยงาน
มอบหมายให้ศึกษาและปฏิบัติงานตามกระบวนการขั้นตอนที่กำหนดไว้ โดยเน้นย้ำให้เห็นความสำคัญของการใช้ทรัพยากรที่ไม่เกินขอบเขตที่กำหนด
การคิดและพฤติกรรม
ทุกครั้งเมื่อปฏิบัติงาน ให้คำนึงถึงความคุ้มค่าและค่าใช้จ่ายที่เกิดขึ้นเสมอจนเป็นนิสัย
ในการปฏิบัติงานนั้น ศึกษาจากผู้ที่มีผลงานที่เด่นและ/หรือใช้ทรัพยากรอย่างคุ้มค่าที่สุด แล้วเรียนรู้กระบวนการทำงานของพวกเขาเหล่านั้นเพื่อนำมาใช้ปฏิบัติในงานของตน
การโค้ช (Coaching)
ให้คำแนะนำในเรื่องการปฏิบัติงานที่ถูกต้อง
เน้นให้ความสำคัญและตระหนักถึงการทำงานโดยใช้ทรัพยากรให้คุ้มค่าสูงสุด
การฝึกอบรม
การใช้ทรัพยากรอย่างคุ้มค่า (Costs and Benefits Analysis)
', 'ชื่อหลักสูตรการฝึกอบรม: การใช้ทรัพยากรอย่างคุ้มค่า
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมตระหนักถึงประสิทธิภาพของการใช้ทรัพยากรให้เกิดประโยชน์สูงสุด
เพื่อให้ผู้เข้าอบรมมีความสามารถในการวิเคราะห์และดำเนินการในเชิงของ Costs/Benefits 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดในการบริหารทรัพยากร
กระบวนการและเครื่องมือในการวิเคราะห์ Costs/Benefits
นอกจากนั้นยังควรมีการจัดกิจกรรมเป็น Workshop ให้ผู้เข้าอบรมนำเสนอกิจกรรมเกี่ยวกับการใช้ทรัพยากรและคำนวณ Cost/Benefits ที่เป็นประโยชน์กับองค์กร
ระยะเวลาของหลักสูตร
12 ชั่วโมง
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้ในการบริหารทรัพยากรที่คุ้มค่าหรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(87, 2, '307', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ควบคุมค่าใช้จ่ายที่เกิดขึ้นในการปฏิบัติงานของหน่วยงานโดยให้พยายามหาวิธีที่จะลดค่าใช้จ่ายที่เกิดขึ้น
สร้างกิจกรรมในการรณรงค์ให้ลดค่าใช้จ่ายต่างๆ ในหน่วยงานให้ลดลง
มอบหมายให้ดำเนินการจัดสรรงบประมาณ ค่าใช้จ่าย และทรัพยากรในหน่วยงาน ให้มีความคุ้มค่าและเกิดประโยชน์สูงสุด
ให้ร่วมกันในทีมตั้งเป้าหมายของการประหยัดต้นทุนค่าใช้จ่ายในหน่วยงาน
การคิดและพฤติกรรม
วางโครงการที่ต้องมีการวิเคราะห์ต้นทุนและผลตอบแทนที่ได้รับ
รับหน้าที่บริหารจัดการให้โครงการหรือกิจกรรมที่ได้รับมอบหมายเป็นไปตามงบประมาณที่ได้รับการอนุมัติ
เป็นผู้นำทีม หรือร่วมเป็นสมาชิกในทีมที่เกี่ยวข้องเพื่อดำเนินการให้เกิดการประหยัดและ/หรือลดต้นทุนในองค์กร
ปฏิบัติงานโดยคำนึงถึงค่าใช้จ่ายที่เกิดขึ้น และมีความพยายามที่จะลดค่าใช้จ่ายเบื้องต้น
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางหรือกระบวนการในการประหยัดหรือลดค่าใช้จ่ายในหน่วยงาน
การฝึกอบรม
Process Re-engineering', 'ชื่อหลักสูตรการฝึกอบรม: Process Re-engineering 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่อง Process Reengineering
เพื่อให้ผู้เข้าอบรมได้มีโอกาสทดลองปฏิบัติจริง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กระบวนการเก็บข้อมูลเพื่อให้เข้าใจระบบงานเดิม
กระบวนการวิเคราะห์ Outcome Analysis
กระบวนการวิเคราะห์ Technology analysis
เทคนิคต่างๆ ในการปรับปรุงกระบวนงาน เช่น Activity Elimination Assess Potential Business Value การกำหนดต้นทุน (Determine Project Cost) การกำหนดความเสี่ยง (Determine Risk of Failure)
กระบวนการในการพัฒนาแนวคิดสำหรับระบบงานใหม่และกำหนดสิ่งที่ต้องปรับปรุง (TO BE Approach)
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(88, 3, '307', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้วางแผนงานในโครงการที่สำคัญของหน่วยงาน โดยให้ประมาณการงบประมาณที่ใช้ และผลลัพธ์ที่จะได้ในแต่ละกิจกรรม
มอบหมายให้เป็นผู้ตรวจสอบและประเมินผลงานที่ผ่านมาในกิจกรรมหรือโครงการที่รับผิดชอบแล้ววิเคราะห์ว่าจะสามารถปรับปรุงการจัดสรรงาน หรือการใช้งบประมาณอย่างไรให้ได้มาซึ่งผลผลิตที่มากขึ้น หรือลดค่าใช้จ่ายลง
ให้วางแผนและนำเสนอกระบวนการในการปรับปรุงหรือจัดสรรทรัพยากรในหน่วยงาน เพื่อให้การทำงานที่มีประสิทธิภาพมากขึ้น หรือมีค่าใช้จ่ายที่ลดลง
การคิดและพฤติกรรม
ทุกๆ ครั้งที่มีการดำเนินการในกิจกรรมหรือโครงการใหม่ๆ ของหน่วยงาน/องค์กร ให้พยายามไตร่ตรองจนเป็นนิสัยว่าจำเป็นต้องมีการวางแผนก่อนล่วงหน้าถึงผลสัมฤทธิ์ที่ควรจะเป็นและต้นทุน/เวลาที่ใช้ไป
หมั่นวิเคราะห์ข้อดี ข้อเสียของกระบวนการการทำงานและกำหนดการใช้ทรัพยากรที่สัมพันธ์กับผลลัพธ์ที่ต้องการโดยมองผลประโยชน์ขององค์กรเป็นหลัก
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางในการวิเคราะห์ Costs/Benefits และกระบวนการในการใช้ทรัพยากรให้เกิดประโยชน์สูงสุด
การฝึกอบรม
การติดตามและประเมินผลโครงการ', 'ชื่อหลักสูตรการฝึกอบรม: การติดตามและประเมินผล
วัตถุประสงค์
เพื่อให้ผู้เข้ารับการอบรมมีความรู้และเข้าใจวิธีการและเทคนิคการประเมินและติดตามผลโครงการ
เพื่อให้ผู้เข้ารับการอบรมสามารถทำการประเมินและติดตามผลการโครงการได้อย่างถูกต้อง 
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
แนวคิดเกี่ยวกับการประเมินผลโครงการ
แนวคิดแผนการประเมินโครง
เทคนิคการประเมินประสิทธิภาพ และประสิทธิผลโครงการ 
เทคนิคการวิเคราะห์ข้อดี และข้อเสียของโครงการ
เทคนิคการประเมินผลลัพธ์โครงการ
หลักการใช้สถิติเพื่อการประเมินโครงการ
ระยะเวลาของหลักสูตร 
3 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(89, 4, '307', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เป็นผู้วางแผนการทำงานร่วมกันระหว่างหลายหน่วยงานโดยในการทำงานต้องออกแบบว่าจะใช้ทรัพยากรร่วมกันในแต่ละหน่วยงานได้อย่างไรเพื่อให้ได้ผลงานที่คุ้มค่าสูงสุด
มอบหมายให้ค้นคิดกระบวนการในการปรับปรุงกระบวนการทำงานที่เกิดประสิทธิภาพสูงสุดกับหลายหน่วยงาน และไม่กระทบกระบวนการทำงานอื่นๆ  ภายในองค์กร
ให้ไปศึกษาองค์กรอื่นๆ ในการบริหารทรัพยากรที่เกิดประโยชน์สูงสุด แล้วนำมาปรับใช้เพื่อให้การบริหารทรัพยากรโดยรวมขององค์กรเป็นไปอย่างคุ้มค่าสูงสุด
ให้จัดทำแผนและกระบวนการนำไปปฏิบัติใช้เรื่องการกำหนดการใช้งบประมาณที่คุ้มค่าระหว่างผลลัพธ์และเงินที่ใช้ลงทุน
กำหนดนโยบายที่สนับสนุนให้เกิดการประหยัดการใช้ทรัพยากรที่สอดคล้องกันทั่วทั้งองค์กร
การคิดและพฤติกรรม
ในการทำงาน สืบค้นและศึกษาว่าจะสามารถใช้ทรัพยากรของหน่วยงานอื่นที่มีความคล้ายคลึงกันให้เกิดประโยชน์ร่วมกันได้หรือไม่ อย่างไร 
เชื่อมโยงภารกิจของหน่วยงานตนเองกับหน่วยงานอื่น (Synergy) เพื่อประสานงานให้บรรลุตามพันธกิจร่วมกัน 
ศึกษากระบวนการบริหารจัดการเพื่อให้ได้มูลค่าเพิ่มทางเศรษฐศาสตร์ (Economic Value Added) แล้วนำมาปรับใช้กับการบริหารทรัพยากรในองค์กร
การฝึกอบรม
การบริหารโครงการ
ทักษะการบริหารจัดการ', 'ชื่อหลักสูตรการฝึกอบรม: การบริหารโครงการ (Project Management)
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจกระบวนการในการบริหารจัดการ และวางแผนงานโครงการ รวมทั้งได้เรียนรู้ทักษะการนำไปปฏิบัติ การติดตามตรวจสอบ และประเมินผลในการวางแผนโครงการ การบริหารบุคลากร การบริหารงบประมาณ และการบริหารทรัพยากรต่างๆ ที่เกี่ยวข้องในงานโครงการต่างๆ
กรอบเนื้อหาของหลักสูตร
การบริหารจัดการ การพัฒนา และการวางแผนโครงการที่มีประสิทธิภาพ
การจัดสรรงบประมาณ การบริหารทรัพยากร และการบริหารจัดการเวลา        (Time Management) ในการบริหารจัดการโครงการให้แล้วเสร็จตามเวลา
เครื่องมือและวงจรในการตรวจสอบการบริหารโครงการ และประเมินผลงานโครงการ
มีกิจกรรม แบบทดสอบ และทดลองให้ปฏิบัติจริงในการวางแผนและการบริหารจัดการโครงการ ตลอดการฝึกอบรมเพื่อให้ผู้รับการฝึกอบรมเข้าใจในกรอบแนวคิด ทฤษฎี และวิธีการนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไรชื่อหลักสูตรการฝึกอบรม: ทักษะการบริหารจัดการ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีทักษะและความสามารถด้านการบริหารจัดการในด้านต่างๆ เช่น  การบริหารทีมงาน โครงการ งบประมาณ และทรัพยากรต่างๆ รวมทั้งสามารถมอบหมายงานให้ทีมงานทำงานให้สำเร็จราบรื่น มีทิศทาง ตลอดจนมีการสั่งการที่ถูกต้อง และการจัดลำดับกระบวนการบริหารดำเนินงานได้อย่างเหมาะสม
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
Team Building & Development
Positive Thinking and Conflict Management
Problem Solving & Decision Making
Assignment & Delegation
Work Planning
Communication System
Work Controlling & Follow up
Leadership 
Logistic Management
Supply Chain Management
Strategic Management (basic review)
Result Based Management 
Value Management
Feasibility Study (basic review)
Resource Management, People Management, and Financial Management
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(90, 5, '307', 'การมอบหมายงานและการหมุนเวียนงาน
พัฒนาปรับปรุงกระบวนการในการลงทุนขององค์กร เพื่อให้เสนอกระบวนการใหม่ๆ ในการทำงานให้มีประสิทธิภาพยิ่งขึ้นเพื่อให้สามารถแข่งขันกับคู่แข่งได้ในระยะยาว
จากวิสัยทัศน์ขององค์กร มอบหมายให้ปรับปรุงการทำงาน การตั้งเป้าหมาย หรือกระบวนการในการบริการ เพื่อให้องค์กรสามารถแข่งขันกับองค์กรอื่นๆ ได้อย่างมีประสิทธิภาพสูงสุด 
ให้หากระบวนการเพื่อลดภาระการบริหารงานให้สามารถแข่งขันกับคู่แข่งได้ในระยะยาว
ให้นำเสนอวิธีการใหม่ๆ ในการเพิ่มผลผลิตหรือเพิ่มผลิตภาพขององค์กรในภาพรวม  
การคิดและพฤติกรรม
ศึกษา หากระบวนการ/วิธีการและนำเสนอกระบวนการใหม่ๆ ในการทำงานให้มีประสิทธิภาพยิ่งขึ้นเพื่อให้สามารถแข่งขันกับคู่แข่งได้ในระยะยาว
ศึกษาหรือจัดทำ Feasibility Study ในทุกๆ การตัดสินใจลงทุนเพื่อให้มั่นใจว่างานทุกอย่างที่องค์กรได้ดำเนินการในภาพรวมนั้นเป็นไปอย่างมีประสิทธิภาพและเกิดประโยชน์อย่างยั่งยืนกับองค์กร
สังเคราะห์ข้อมูลการทำงานที่ผ่านมา ข้อมูลจากประสบการณ์ หรือข้อมูล Best Practice จากองค์กรอื่นๆ เพื่อนำมาสร้างสรรค์งานใหม่ ที่โดดเด่นแตกต่างให้กับองค์กร โดยใช้ทรัพยากรเท่าเดิม', '', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(91, 1, '308', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ทำงานร่วมกับบุคคลอื่นๆ โดยต้องผสมผสานความคิดของตนให้เข้ากับความคิดหรือมุมมองของบุคคลอื่นๆ ในทีม 
มอบหมายงานให้จัดทำสรุปรายงานการประชุม สรุปเนื้อหาสาระ สรุปประเด็น หรือสรุปใจความสำคัญ เป็นต้น
มอบหมายงานให้เป็นผู้สัมภาษณ์ผู้บริหาร หรือกลุ่มบุคคลต่างๆ เพื่อเก็บข้อมูลเบื้องต้นเรื่องใดเรื่องหนึ่ง
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางในการปรับตัว และการทำงานร่วมกับผู้อื่น 
ดูแล แนะนำ ให้คำปรึกษา เรื่องการฟัง และการสื่อสารที่มีประสิทธิภาพ
การคิดและพฤติกรรม
ในแต่ละวัน ให้ลองประเมินและพิจารณาว่าตัวเองมีความเข้าใจความหมายของผู้ที่มาติดต่อสื่อสารด้วยหรือไม่ สามารถจับประเด็นหรือสรุปเนื้อหาสาระที่บุคคลเหล่านั้นสื่อสารได้หรือไม่ ความตั้งใจฟังผู้อื่นจะช่วยให้ท่านสามารถเข้าใจความหมายของผู้อื่น และสามารถสรุปประเด็นและใจความสำคัญได้
เวลาอยู่ในที่ประชุมหรือช่วงเวลาของการติดต่อสื่อสารกับลูกค้า หมั่นจดบันทึก สรุปเนื้อหา และใจความสำคัญให้ครบถ้วนถูกต้อง', 'การคิดและพฤติกรรม (ต่อ)
ฝึกตนให้เป็นผู้ที่มีความคล่องตัวในการปฏิบัติงาน
ในขณะที่ประสบความยากลำบากในงาน ให้พยายามปรับตัวให้เคยชิน โดยอาจต้องตัดภาพความสะดวกสบายที่เคยได้รับในอดีต
อ่านหนังสือธรรมะ เพื่อให้เลิกยึดติดกับวัตถุแสดงฐานะทางสังคม หรือระดับอาวุโสในงาน
พยายามจดบันทึกเมื่อมีการไปขอคำแนะนำจากผู้อื่น แล้วพิจารณาว่าเวลาใดหรือลักษณะการให้คำปรึกษาแบบใดที่ตนเชื่อและถือปฏิบัติ หาเหตุผลเพื่อนำมาปรับปรุงให้ใจยอมรับความคิดเห็นของผู้อื่น
การฝึกอบรม
การปรับตัว
การฟังและการสื่อสารอย่างมีประสิทธิภาพชื่อหลักสูตรการฝึกอบรม: การฟังและการสื่อสารอย่างมีประสิทธิภาพ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี 
เพื่อให้ผู้เข้าอบรมตระหนักและเข้าใจผลของการสื่อสารที่บกพร่อง (Error Communication Consequence)
เพื่อให้ผู้เข้าอบรมเกิดการพัฒนา และเปลี่ยนแปลงการสื่อสารให้มีคุณภาพยิ่งขึ้น
กรอบเนื้อหาของหลักสูตร
หลักการ ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี และหลักการในจดบันทึกข้อมูลให้ครบถ้วน และเป็นประโยชน์ 
การค้นหาความเข้าใจ การจำใจความ
หลักการสื่อสารที่มีประสิทธิภาพ: สื่อสารอย่างไร ให้ผู้รับสารเข้าใจในสิ่งที่เราสื่อได้อย่างถูกต้อง
เกมและแบบฝึกหัดการฟัง และการสื่อสารที่มีประสิทธิภาพ รวมทั้งการสรุปผล
ระยะเวลาของหลักสูตร 
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไรชื่อหลักสูตรการฝึกอบรม: การปรับตัว
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด หลักการ และวิธีการการปรับตัวให้สอดคล้องในแต่ละสถานการณ์ รวมทั้งสามารถปรับตัว และทำงานร่วมกับผู้อื่นที่มีหลากหลายได้ดี
กรอบเนื้อหาของหลักสูตร
ภาคทฤษฎี: กรอบแนวคิด หลักการ และวิธีการปรับตัวให้ถูกต้องในแต่ละสถานการณ์ 
ภาคปฏิบัติ: การกำหนดสถานการณ์จริงที่มีความแตกต่าง และทดลองให้ปฏิบัติจริง
ระยะเวลาของหลักสูตร 
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(92, 2, '308', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ทำงานร่วมกับบุคคลอื่นๆ โดยต้องผสมผสานความคิดของตนให้เข้ากับความคิดหรือมุมมองของบุคคลอื่นๆ ในการทำงาน
มอบหมายให้ทำงานเป็นส่วนหนึ่งในโครงการ หรือกิจกรรมพิเศษต่างๆ ที่ทำงานร่วมกับผู้รับบริการ ผู้ประกอบการ หรือองค์กรพันธมิตรต่างๆ
มอบหมายให้ทำการสำรวจว่ามีกระบวนการใดในหน่วยงานที่ควรจะต้องปรับเปลี่ยนเพื่อให้สามารถทำงานได้อย่างมีประสิทธิภาพขึ้น
หมุนเวียนงานให้ไปรับผิดชอบงานในหน่วยงานที่ต้องทำงานร่วมกับผู้รับบริการ ผู้ประกอบการ หรือองค์กรพันธมิตรต่างๆ 
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการเปลี่ยนแปลงและประโยชน์ของการปรับเปลี่ยน
การคิดและพฤติกรรม
สังเกต และหมั่นศึกษาอวัจนภาษา เช่น ท่าทาง การแสดงออกทางสีหน้า หรือน้ำเสียงของบุคคลต่างๆ ที่สนทนาหรือสื่อสารด้วย และจดบันทึกเก็บเป็นข้อมูลเพื่อการพัฒนา รวมทั้งหมั่นติดตามว่าตนเองมีความเข้าใจในอารมณ์ความรู้สึกและคำพูดของบุคคลอื่นมากน้อยเพียงใด และมีความเข้าใจที่ถูกต้องหรือไม่ 
สอบถามผู้อื่นหรือบุคคลที่ท่านสนทนาด้วยว่าท่านมีความเข้าใจอย่างถูกต้องในเนื้อหาของสารและนัยเชิงอารมณ์ของบุคคลเหล่านั้น เพื่อให้แน่ใจว่าท่านมีความเข้าใจที่ถูกต้องและสามารถพัฒนาความสามารถด้านนี้ให้เพิ่มขึ้น', 'การคิดและพฤติกรรม (ต่อ)
เข้าไปมีส่วนร่วมในการประชุมเจรจาต่อรองหรือการประชุมทั่วๆไปกับลูกค้า ผู้บริหาร หรือบุคคลต่างๆ เพื่อศึกษาและวิเคราะห์อารมณ์ความรู้สึกและคำพูดของบุคคลเหล่านั้น เพื่อพัฒนาการเข้าใจอารมณ์ความรู้สึก คำพูด และนัยเชิงอารมณ์ได้ดียิ่งขึ้น
แบ่งปันข้อมูลร่วมกับเพื่อนร่วมงานว่าหลักในการสร้างความเข้าใจผู้อื่นในด้านอารมณ์ และความรู้สึกที่ถูกต้องมีหลักการอย่างไรบ้าง เพื่อนำประยุกต์ใช้ในการปฏิบัติงาน การสื่อสารหรือการตอบสนองความต้องการกับผู้อื่นได้อย่างมีประสิทธิภาพ
เมื่อมีการทำงานร่วมกันในทีม พยายามเปิดใจรับฟังความคิดเห็นของบุคคลอื่นๆ ก่อนว่าประเด็นหรือความคิดเห็นของเขามีข้อดีข้อเสียอย่างไร โดยไม่ไปตัดสินก่อน นอกจากนั้นหากความคิดเห็นนั้นเป็นประโยชน์ต่อการทำงานก็ควรที่จะยอมรับและปรับเปลี่ยนกระบวนการหรือข้อเสนอของกลุ่ม เพื่อให้ผลงานที่ได้รับเกิดประโยชน์สูงสุดต่อองค์กร 
เมื่อมีข้อมูล หรือการเปลี่ยนแปลงเกิดขึ้น พิจารณาว่าสิ่งใหม่ๆ นี้มีประโยชน์ต่อองค์กรอย่างไร หากมีประโยชน์ก็ให้เริ่มพยายาม ยอมรับและปรับตัวเพื่อสนับสนุนให้องค์กรบรรลุเป้าหมายที่กำหนด
ยอมรับความจำเป็นที่จะต้องปรับเปลี่ยน
หมั่นถามเพื่อนร่วมงานถึงความคิดเห็น (Feedback) แล้วพิจารณาไตร่ตรองว่าจะสามารถปรับปรุงตัวได้อย่างไรให้มีผลงานที่มีประสิทธิภาพดีขึ้น
การฝึกอบรม
การเข้าใจผู้อื่นชื่อหลักสูตรการฝึกอบรม: การเข้าใจผู้อื่น
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี รวมทั้งสามารถสื่อสารได้อย่างมีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด หลักการเข้าใจผู้อื่น และอุปสรรคสำคัญต่างๆ รวมทั้งแนวทางในการพัฒนาการเข้าใจผู้อื่น
กรอบเนื้อหาของหลักสูตร
หลักการ ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี และหลักการในจดบันทึกข้อมูลให้ครบถ้วน และเป็นประโยชน์ รวมทั้งหลักการสื่อสารที่มีประสิทธิภาพ
แนวคิดเบื้องต้นเกี่ยวกับภาษาและพฤติกรรมมนุษย์ (Myers-Briggs Type Indicator) เพื่อให้สามารถตอบสนองผู้อื่นและสื่อสารได้อย่างมีประสิทธิภาพสูงสุด
ข้อแนะนำในการพัฒนาการเข้าใจผู้อื่น และการชนะใจคน
เครื่องมือ แนวคิด หลักการของการเข้าใจผู้อื่น อุปสรรคที่สำคัญ และการสร้างความเข้าใจผู้อื่นเกิดขึ้นได้โดย:
การยอมรับอารมณ์ของผู้อื่น และ
การแสดงให้ผู้อื่นเห็นว่าท่านเข้าใจ แม้ว่าท่าน ไม่จำเป็นต้องเห็นด้วยกับคำพูดหรือความรู้สึกของผู้นั้นก็ตาม


การจำลองสถานการณ์จริง และทดลองให้ปฏิบัติ รวมทั้งมีเกมและแบบฝึกหัดเพื่อฝึกการฟัง การสื่อสาร และการเข้าใจผู้อื่น ตลอดจนสรุปผล
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(93, 3, '308', 'การมอบหมายงานและการหมุนเวียนงาน
เมื่อมีเหตุการณ์ที่ต้องใช้วิจารณญาณในการปรับใช้กฎระเบียบอย่างยืดหยุ่น มอบหมายให้ไปทำงานนั้นโดยคอยตามดูแลและให้คำปรึกษาอย่างใกล้ชิด
มอบหมายให้ควบคุมงานในโครงการที่คล้ายคลึงกับโครงการที่ผ่านมาแต่อาจมีความจำเป็นต้องใช้ความสามารถในการประยุกต์ใช้กฎเกณฑ์ กระบวนการปฏิบัติงานอย่างยืดหยุ่น เพื่อปรับให้สามารถส่งมอบผลงานตามวัตถุประสงค์ของโครงการได้ 
เมื่อมีเหตุการณ์ใหม่ๆ เกิดขึ้น มอบหมายให้วางแผนการปรับกระบวนการทำงาน หรือพฤติกรรมในการทำงาน เพื่อให้สอดคล้องและเหมาะสมกับเหตุการณ์เหล่านั้น
เมื่อมีการเปลี่ยนแปลงเกิดขึ้น มอบหมายให้ไปรับฟังความเปลี่ยนแปลงดังกล่าวแล้วสรุปการเปลี่ยนแปลง พร้อมรวบรวมข้อคิดเห็นต่างๆ ของแต่ละกลุ่ม/บุคคล เพื่อให้เข้าใจว่าหน่วยงานจะปรับเปลี่ยนอย่างไรให้สอดคล้องกับการเปลี่ยนแปลงดังกล่าว
มอบหมายให้ทำการสำรวจว่ามีกระบวนการใดในหน่วยงานที่ควรจะต้องปรับเปลี่ยนเพื่อให้สามารถทำงานได้อย่างมีประสิทธิภาพขึ้น
การโค้ช (Coaching)
แนะนำหรือแลกเปลี่ยนประสบการณ์ในการทำงานด้วยความยืดหยุ่นผ่อนปรนและผลที่ได้รับ 
ดูแล แนะนำ และชี้ให้เห็นถึงประโยชน์ของการเข้าใจความหมายแฝงในอากัปกิริยาและคำพูดของผู้อื่นทั้งที่ไม่ได้แสดงออกมาอย่างชัดเจน
ดูและ แนะนำ และให้คำแนะนำในการสร้างสัมพันธภาพหรือผูกมิตรกับผู้อื่น', 'การคิดและพฤติกรรม
หมั่นศึกษาลักษณะนิสัยหรือจุดเด่นอย่างใดอย่างหนึ่งของเพื่อนร่วมงาน ผู้บริหาร ผู้รับบริการ หรือผู้ที่มีมาติดต่อด้วย เพื่อสามารถตีความหมายเบื้องลึกได้อย่างถูกต้องและตอบสนองบุคคลเหล่านั้นได้อย่างเหมาะสม
หมั่นสังเกตพฤติกรรม อากัปกิริยา ความคิด และคำพูดแฝงเบื้องลึกจากบุคคลรอบๆ ตัว แล้วจดบันทึกเป็นข้อมูล เพื่อสามารถตอบสนองและเข้าใจความหมายแฝงในอากัปกิริยาและคำพูดเหล่านั้นได้
ไม่ควรตัดสินหรือปฏิเสธบุคคลอื่นจากการสนทนาเพียงครั้งเดียว เพราะจะทำให้ท่านมีความเข้าใจผู้อื่นที่ไม่ถูกต้องทั้งในเรื่องพฤติกรรม ความชอบส่วนตัว อารมณ์ความรู้สึก และคำพูด เป็นต้น
การสร้างสัมพันธภาพและการผูกมิตรกับผู้อื่น จะช่วยให้ท่านสามารถเข้าใจผู้อื่น สามารถตีความเบื้องลึกที่ไม่ได้แสดงออกอย่างชัดเจนในคำพูดหรือน้ำเสียง และสามารถระบุลักษณะนิสัยของผู้อื่นได้ถูกต้อง
เมื่อเจออุปสรรคในงาน ให้ปรึกษาเพื่อนร่วมงานและร่วมกันคิดวิเคราะห์ (Brainstorm) ถึงทางเลือกต่างๆ ในการแก้ไขปัญหาโดยพยายามคิดหาทางที่แตกต่างจากกระบวนการเดิมที่ใช้อยู่ เพื่อพัฒนาให้องค์กรมีประสิทธิภาพในการทำงานมากขึ้น 
สามารถเลือกทางเลือก วิธีการ หรือกระบวนการโดยปกติทั่วไปมาปรับใช้กับสถานการณ์ที่เฉพาะเจาะจงได้อย่างมีประสิทธิภาพ 
ให้มองทางเลือกในหลายๆ มุมมองโดยคิดเสมอว่าในการแก้ไขปัญหาหรือดำเนินงานนั้น สามารถทำได้หลายวิธี ซึ่งได้ผลลัพธ์ไม่เหมือนกันตามลักษณะของเหตุการณ์ที่เจอ
การฝึกอบรม
เชาว์อารมณ์ (Emotional Intelligence)
ชื่อหลักสูตรการฝึกอบรม: เชาว์อารมณ์ (Emotional Intelligence) 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องเชาว์อารมณ์
เพื่อให้ผู้เข้าอบรมได้มีโอกาสทดลองปฏิบัติจริงเมื่อมีการพบปะกับผู้อื่น
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความหมายและความสำคัญของเชาว์อารมณ์
การบริหาร Emotional Intelligence ทั้งในส่วนที่เป็นการเข้าใจตน (Self Awareness) การบริหารจัดการตนเอง (Self Management) การเข้าใจคนอื่น (Social Awareness) และการบริหารความสัมพันธ์กับคนอื่น (Social Management) 
กระบวนการพัฒนาเชาว์อารมณ์
การทำ Role Play ในสถานการณ์สมมติ
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(94, 4, '308', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้วางแผนปรับเปลี่ยนวิธีการดำเนินงานในหน่วยงานให้เข้ากับสถานการณ์หรือการเปลี่ยนแปลงที่เกิดขึ้น เพื่อให้สามารถรักษาเป้าหมายเดิมไว้
เมื่อมีการเปลี่ยนแปลงเกิดขึ้น ให้ร่วมกันทบทวนว่ามีระเบียบหรือขั้นตอนใดที่ไม่เหมาะสม และสามารถปรับแก้ได้ เพื่อเพิ่มประสิทธิภาพของหน่วยงาน หรือองค์กร
มอบหมายให้ไปศึกษาความรู้หรือเทคโนโลยีใหม่ๆ ที่เกี่ยวข้องกับการทำงานให้หน่วยงาน และให้มานำเสนอว่าจะประยุกต์ใช้องค์ความรู้หรือเทคโนโลยีใหม่ๆ นั้นกับหน่วยงานได้อย่างไรให้เกิดประโยชน์สูงสุด 
เมื่อมีเหตุการณ์ใหม่ๆ เกิดขึ้น มอบหมายให้วางแผนการปรับกระบวนการทำงาน หรือพฤติกรรมในการทำงาน เพื่อให้สอดคล้องและเหมาะสมกับเหตุการณ์เหล่านั้น
ด้านความคิดและพฤติกรรม
การสร้างสัมพันธภาพและการผูกมิตรอย่างใกล้ชิดสนิทสนมหรือแบบเพื่อนจะช่วยให้ท่านสามารถมีความเข้าใจผู้อื่นในนัยของพฤติกรรม อารมณ์ความรู้สึกและความหมายแฝงต่างๆ
เป็นผู้นำในการเขียนสุนทรพจน์ในเรื่องต่างๆ ให้บุคคลอื่นๆ ในองค์กร หรือเป็นตัวแทนในการนำเสนอข้อเสนอต่างๆ ให้แก่ผู้บริหารระดับสูง
ไม่รีรอที่จะเข้าแก้ไขปัญหาให้ลูกน้อง หรือเพื่อนร่วมงานที่กำลังมีความขัดแย้งกัน เพราะจะช่วยให้ท่านมีความเข้าใจผู้อื่นทั้งในเชิงพฤติกรรม นัยแฝง อารมณ์ความรู้สึก และคำพูด', 'ด้านความคิดและพฤติกรรม (ต่อ)
เมื่อไม่เห็นด้วยกับความคิดหรือข้อเสนอของบุคคลหรือหน่วยงานอื่น ให้ถอยมาคิดว่าอะไรเป็นข้อดี ข้อเสียของความคิดหรือข้อเสนอดังกล่าว แล้วพยายามปรับจุดยืนของตนให้สานต่อข้อดีหรือประโยชน์ของความคิดนั้น เพื่อสร้างสรรค์ให้เกิดการยอมรับร่วมกันในความคิดเห็นหรือข้อเสนอนั้น 
เมื่อต้องการเจรจาหรือชักจูงบุคคลหรือหน่วยงานอื่นๆ ให้พิจารณาก่อนว่าอะไรเป็นความต้องการหลักของบุคคลหรือหน่วยงานเหล่านั้น พยายามปรับกระบวนการคิดและนำเสนอให้เหมาะสมกับสิ่งที่เขาต้องการ โดยรักษาไว้ซึ่งผลลัพธ์ที่ต้องการและประโยชน์ที่ตกอยู่กับบุคคลหรือหน่วยงานนั้น
การโค้ช (Coaching)
แนะนำหรือแลกเปลี่ยนประสบการณ์ในการทำงานด้วยความยืดหยุ่นผ่อนปรน การปรับตัว และผลที่ได้รับ รวมทั้งการบริหารการเปลี่ยนแปลงที่เกิดขึ้นงาน กิจกรรม หรือโครงการพิเศษต่างๆ
แลกเปลี่ยนความรู้ ทักษะ และประสบการณ์ในการทำงานด้านการบริการที่ดีและสร้างความแตกต่างแก่ผู้รับบริการ
การฝึกอบรม
การบริหารการเปลี่ยนแปลง
การบริการด้วยใจชื่อหลักสูตรการฝึกอบรม: การบริหารการเปลี่ยนแปลง
วัตถุประสงค์
เพื่อให้ผู้เข้ารับการอบรมมีกรอบแนวคิด ความรู้ ความเข้าใจ รวมทั้งกระบวนการในการบริหารความเปลี่ยนแปลง (Step by Step Approach to Change Management)
เพื่อให้ผู้เข้ารับการอบรมสามารถช่วยหน่วยงานตน/หน่วยงานอื่น ในการดำเนินการเปลี่ยนแปลง 
เพื่อให้ผู้เข้ารับการอบรมตระหนักถึงความสำคัญของการเปลี่ยนแปลง และเริ่มสร้างความมีส่วนร่วมในการบริหารการเปลี่ยนแปลง (Increase Ownership of the Change Programme)
กรอบเนื้อหาของหลักสูตร
กรอบแนวคิดในเรื่องการบริหารความเปลี่ยนแปลง (Change Management) และหลักความพร้อมในการเปลี่ยนแปลง (Change Readiness Model)







การเตรียมความพร้อมเพื่อการเปลี่ยนแปลง (Readiness for Change)
ทำไมคนจึงต่อต้านการเปลี่ยนแปลง และจะมีวิธีการอย่างไรในการรับมือกับการต่อต้านและสร้างให้เกิดการยอมรับ (Commitment)
การบริหารความขัดแย้ง ตามทฤษฎีของ Thomas-Kilmann (Competing, Accommodating, Avoiding, Compromising และ Collaborating)กรอบเนื้อหาของหลักสูตร (ต่อ)
บทบาทในการบริหารความเปลี่ยนแปลง (Roles in Change)
หน้าที่ของบุคคลต่างๆ ในการเปลี่ยนแปลง (Solver, Doer, Checker, Care Giver และ Knower) และกระบวนการต่างๆ ในการสร้างบทบาทหน้าที่และความรับผิดชอบ (Responsibility Codes) เช่น ใครมีหน้าที่ตัดสินใจเรื่องใด (D) ใครเป็นเจ้าภาพ (O) ใครเป็นผู้ติดตามผล (P) เป็นต้น
กระบวนการในการกำหนดผู้ที่มีส่วนได้ส่วนเสียในการเปลี่ยนแปลง
ประเด็นต่างๆ ในการเปลี่ยนแปลง (Issues in Implementing Change)
กระบวนการและเครื่องมือในการสื่อสารประชาสัมพันธ์และสร้างการยอมรับ
กระบวนการและเครื่องมือในการประเมินผลกระทบ (Impact Analysis) 
ระยะเวลาของหลักสูตร
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไรชื่อหลักสูตรการฝึกอบรม: การบริการด้วยใจ (Service Solution)
วัตถุประสงค์
เพื่อให้ผู้เข้ารับการอบรมเข้าใจในกรอบความคิดเรื่อง Customer Service ต่อความสำเร็จขององค์กร และสามารถนำไปใช้ถึงวิธีการคิด และกระบวนการในการบริการลูกค้า
กรอบเนื้อหาของหลักสูตร
ลักษณะของลูกค้าและความสำคัญของการบริการลูกค้า 
กรอบแนวคิดในเรื่องการสร้างและรักษาสัมพันธ์กับลูกค้าปัจจุบันและลูกค้าใหม่ 
กระบวนการในการสร้างความแตกต่างซึ่งเป็นคุณค่า (Different Advantage) ขององค์กรให้กับลูกค้า
ข้อผิดพลาดในการบริหารลูกค้า และกระบวนการป้องกัน/แก้ไขข้อผิดพลาด
กรอบแนวคิดเรื่อง Service Solution ซึ่งเป็นการเชื่อมโยง Emotional Intelligence กับทฤษฎีการบริการลูกค้า
Turn in yourself: Learn to manage your personal thermostat
Stay Cool: Learn to stay calm in the face of pressure
Connect with your customer: Learn to turn in to others and make a positive connection
Provide Great Service: Learn to influence others to achieve an outcome beneficial to them and you
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(95, 5, '308', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ปรับแผนกลยุทธ์ทั้งหมดขององค์กร เพื่อให้เหมาะสมกับสถานการณ์เฉพาะหน้าที่ต้องเผชิญในปีถัดไป
มอบหมายให้ทบทวนและสังคายนากฎระเบียบและวิธีการทำงานของหน่วยงานที่ดูแลรับผิดชอบอยู่ใหม่ทั้งหมด เพื่อหาทางปรับปรุงให้สามารถสนับสนุนการทำงานของหน่วยงานนั้นๆ ได้อย่างมีประสิทธิภาพมากขึ้น 
มอบหมายให้วางแผนการปรับเปลี่ยนองค์กร (เช่น โครงสร้างองค์กร สายการบังคับบัญชา) เพื่อให้สามารถตอบสนองต่อสถานการณ์เฉพาะหน้าได้อย่างเหมาะสม
การโค้ช (Coaching)
ส่งไปเรียนรู้กับผู้ที่มีประสบการณ์ในเรื่องการปรับเปลี่ยนกลยุทธ์หรือส่งไปดูงานในองค์กรที่ประสบความสำเร็จต่างๆ เพื่อให้เข้าใจแนวคิดและกระบวนการที่สามารถจะนำมาปรับใช้กับองค์กรได้
การคิดและพฤติกรรม
การสร้างสัมพันธภาพและการผูกมิตรอย่างระยะยาว จะช่วยให้ท่านสามารถเข้าใจเบื้องลึกถึงสาเหตุของพฤติกรรม ทัศนคติ หรือแรงจูงใจในระยะยาวของผู้อื่นได้
การทำงานเป็นทีมในโครงการใหม่ๆ ที่มีความยากลำบาก และซับซ้อนมากเป็นพิเศษหรือการทำงานในต่างประเทศร่วมกัน จะช่วยให้ท่านรู้จักและเข้าใจผู้อื่นมากขึ้นในเรื่องของพฤติกรรม การแสดง ปฏิกิริยา และนิสัยส่วนตัว
อคติส่วนตัวต่อบุคคลอื่นจะเป็นอุปสรรคที่สำคัญที่ทำให้ท่านไม่สามารถเข้าใจสาเหตุเบื้องลึกของพฤติกรรมผู้อื่น
การสอนงาน การมอบหมายงาน การพัฒนาบุคลากร หรือการให้ความรู้หรือให้บริการผู้อื่นจะเป็นพื้นฐานการทำงานที่สำคัญที่จะช่วยให้ท่านมีความเข้าใจนิสัยส่วนตัว ความชอบ จุดเด่น และจุดด้อยของผู้อื่น', 'การคิดและพฤติกรรม (ต่อ)
เมื่อกลยุทธ์ในปัจจุบันใช้งานได้ไม่สอดคล้องเหมาะสมกับสถานการณ์ที่เกิดขึ้น ให้หยุดและทบทวนว่าสิ่งใดยังคงมีประโยชน์และเหมาะสมก็ให้ดำเนินการต่อไป แต่หากสิ่งไหนควรจะปรับเปลี่ยนแล้ว ก็ให้พยายามวางแผนปรับเปลี่ยนแผนการ กระบวนการทำงาน หรือวัตถุประสงค์ที่กำหนดไว้เดิม เพื่อให้รักษาเป้าหมายที่ตั้งไว้ได้อย่างมีประสิทธิภาพสูงสุด
ฝึกฝนและศึกษาด้านมานุษยวิทยาและหลักจิตวิทยา
หมั่นฝึกฝนและปฏิบัติตนเสมือนเป็นที่ปรึกษาเพื่อแก้ไขปัญหาต่างๆ ที่นอกเหนือจากงานที่รับผิดชอบให้กับเพื่อนร่วมงาน ผู้บริหาร หรือผู้รับบริการ
หมั่นสร้างความสันติและผูกมิตรกับศัตรู
ระลึกว่าคนเรานั้นแตกต่างกันและปรับวิธีการสื่อสารของท่านตามความเข้าใจของท่านเกี่ยวกับความต้องการ ความชอบและข้อวิตกกังวลของคนที่ท่านสนทนาด้วย
ระลึกและหมั่นสร้างสัมพันธภาพในระยะยาวกับผู้อื่น เพราะจะทำให้ท่านมีความเข้าใจผู้อื่นอย่างลึกซึ้ง
การฝึกอบรม
การวางแผนเชิงกลยุทธ์ชื่อหลักสูตรการฝึกอบรม: การวางแผนเชิงกลยุทธ์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด และให้ความสำคัญของการคิดเชิงกลยุทธ์
เพื่อให้ผู้เข้าอบรมเข้าใจ และสามารถนำไปใช้ถึงวิธีการคิด วิเคราะห์ และมองหาโอกาสในเชิงกลยุทธ์ โดยใช้ข้อมูล และหลักการทฤษฎีมาประยุกต์ให้เกิดประโยชน์
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญ และองค์ประกอบของการคิดเชิงกลยุทธ์ เพื่อความสำเร็จขององค์กร
ขั้นตอน และกระบวนการในการ Moving from Operational Manager to a Strategic Thinker 
หลักการวิเคราะห์จุดแข็ง จุดอ่อน โอกาส และข้อจำกัดของธุรกิจ (SWOT Analysis) รวมทั้งการวิเคราะห์คู่แข่ง และตลาด
ข้อมูลที่จำเป็นต้องใช้เพื่อการคิด และมองปัญหาในเชิงกลยุทธ์และโอกาสในทางธุรกิจ
ข้อจำกัดของการที่ผู้บริหารไม่สามารถคิดในเชิงกลยุทธ์ได้ และวิธีการขจัดข้อจำกัด
แบบทดสอบ (Case Study) ก่อนการเข้ามีการสัมมนา เพื่อวัดการคิดเชิงกลยุทธ์เพื่อให้ผู้บริหารได้ศึกษาและลองใช้ข้อมูล เพื่อตัดสินใจในเชิงกลยุทธ์
การจำลองสถานการณ์ และแบบฝึกหัดการออกแบบธุรกิจ และการตัดสินใจเชิงธุรกิจ เพื่อสร้างข้อได้เปรียบทางธุรกิจ และสร้างผลประโยชน์ในระยะยาว
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
ผู้เข้าอบรมจะถูกประเมินด้วยแบบทดสอบก่อนการเข้าสัมมนาเพื่อวัดระดับความสามารถ และในระหว่างการสัมมนาจะมีแบบฝึกหัดเพื่อวัดผลการคิดเชิง    กลยุทธ์ด้านการออกแบบธุรกิจ และเมื่อสิ้นสุดการฝึกอบรมจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(96, 1, '309', 'การมอบหมายงานและการหมุนเวียนงาน
ศึกษาการใช้เทคโนโลยี ระบบและกระบวนการทำงานในหน่วยงานของตนว่าเป็นอย่างไร เพื่อให้แน่ใจว่ามีความเข้าใจที่ถูกต้อง
ติดตามและศึกษากฎระเบียบ ขั้นตอนการทำงาน และกระบวนการปฏิบัติงานต่างๆ ของหน่วยงานที่ตนสังกัดอยู่ เพื่อประยุกต์ใช้ความเข้าใจนี้มาเชื่อมโยงกับงานที่ตนปฏิบัติอยู่
ศึกษาเทคโนโลยี ระบบ กระบวนการทำงานและมาตรฐานในงานที่ตนรับผิดชอบและให้นำความเข้าใจนี้มาใช้ในการปฏิบัติงานหรือจัดทำรายงานในหน้าที่ให้ถูกต้อง

การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการใช้เทคโนโลยี เครื่องมือ และระบบต่างๆ ในหน่วยงาน
สอนงานในเรื่องกฎระเบียบ ขั้นตอนการปฏิบัติงานที่ถูกต้องภายในของหน่วยงานที่รับผิดชอบ

การฝึกอบรม
On-the-job Training', 'ชื่อหลักสูตรการฝึกอบรม: On-the-job training
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจมาตรฐาน วิธีการทำงาน และกระบวนการในการทำงานของตำแหน่งงานของตนเองอย่างถูกต้อง และชัดเจน
เพื่อให้โอกาสผู้เข้าอบรมมีโอกาสสั่งสมความชำนาญในการทำงาน และสามารถปฏิบัติงานได้อย่างถูกต้อง โดยไม่มีข้อผิดพลาด และตรงตามมาตรฐานที่กำหนด
กรอบเนื้อหาของหลักสูตร
อธิบายกฎระเบียบ วิธีการปฏิบัติงาน และมาตรฐานความถูกต้องของงานในตำแหน่งงานที่รับผิดชอบ
จัดทำคู่มือ ระเบียบปฏิบัติ และกระบวนการทำงานของตำแหน่งงาน
ดำเนินการฝึกอบรมถึงหน้าที่ความรับผิดชอบ ขั้นตอนการปฏิบัติงาน โดยเน้นเรื่องความถูกต้องของงานควบคู่ไปกับการปฏิบัติงานจริง 
มีกิจกรรม และแบบทดสอบ รวมทั้งทดลองให้ปฏิบัติงานจริง เพื่อให้ผู้รับการฝึกอบรมเข้าใจในวิธีการปฏิบัติงาน สามารถปฏิบัติงานได้ถูกต้อง และสามารถนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร ครึ่งวัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(97, 2, '309', 'การมอบหมายงานและการหมุนเวียนงาน
ให้ศึกษากระบวนการดำเนินงาน และขั้นตอนการปฏิบัติงานของหน่วยงานอื่นๆ แล้ววิเคราะห์เชื่อมโยงกระบวนการทำงานร่วมกันให้มีประสิทธิภาพสูงสุด 
ให้ติดต่อประสานงานกับหน่วยงานอื่นๆ เพื่อเชื่อมโยงระบบและกระบวนการทำงานร่วมกัน
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องระบบ เทคโนโลยี และกระบวนการทำงานในปัจจุบันของหน่วยงานอื่นๆ
สอนงานในเรื่องกฎระเบียบ ขั้นตอนการปฏิบัติงานที่ถูกต้องภายในของหน่วยงานอื่นๆ
การฝึกอบรม
การคิดเชิงสังเคราะห์ ', 'ชื่อหลักสูตรการฝึกอบรม: การคิดเชิงสังเคราะห์ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการคิดเชิงสังเคราะห์ (Conceptual Thinking)
เพื่อให้ผู้เข้าอบรมมีเครื่องมือช่วยคิดเรื่องการคิดเชิงสังเคราะห์ เช่น Critical Thinking Technique, Mind Mapping, etc.
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความหมายของการคิดเชิงสังเคราะห์
เครื่องมือช่วยคิดเรื่องการคิดเชิงสังเคราะห์ เช่น Critical Thinking Technique, Mind Mapping, etc.
การทำกิจกรรมเพื่อให้เข้าใจกระบวนการในการสังเคราะห์ความรู้
ระยะเวลาของหลักสูตร
ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(98, 3, '309', 'การมอบหมายงานและการหมุนเวียนงาน
ให้ศึกษาข้อจำกัดต่างๆ ขององค์กรหรือหน่วยงานอื่นๆ ที่ต้องติดต่อด้วยแล้วนำเสนอกระบวนการในการปรับเปลี่ยนหรือปรับปรุงข้อจำกัดต่างๆ เหล่านั้นให้น้อยลงหรือหมดไป 
มอบหมายให้หาจุดอ่อน และจุดแข็งของกระบวนการทำงานร่วมกันระหว่างหน่วยงาน แล้วออกแบบวิธีการในการปรับเปลี่ยนหรือปรับปรุงให้สามารถทำงานร่วมกันได้อย่างมีประสิทธิภาพสูงขึ้นได้ 
ในเหตุการณ์ฉุกเฉิน หรือเมื่อมีปัญหาเกิดขึ้นในหน่วยงาน ให้แก้ปัญหาดังกล่าวด้วยการใช้ความเข้าใจผลต่อเนื่องและความสัมพันธ์เชื่อมโยงของระบบและกระบวนการทำงานในหน่วยงานของตน
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องเทคนิคทางวิชาการในเบื้องลึกของระบบ กระบวนการ หรือเทคโนโลยีที่ใช้ในการปฏิบัติงานในองค์กร
การฝึกอบรม
การปรับปรุงกระบวนการทำงาน', 'ชื่อหลักสูตรการฝึกอบรม: การปรับปรุงกระบวนการทำงาน
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจถึงกระบวนการในการปรับปรุงระบบการทำงานให้มีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมสามารถนำเครื่องมือและกระบวนการการปรับปรุงกระบวนงานไปใช้ให้เกิดประโยชน์กับองค์กร
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย 
การบรรยายเพื่อให้เห็นถึงกระบวนการในการปรับปรุงกระบวนการด้วยเครื่องมือต่างๆ เช่น PDCA, Value Analysis, Total Quality Management (TQM) หรือ Six Sigma process improvement
กระบวนการในการเก็บข้อมูล วิเคราะห์ ตีความและนำเสนอข้อมูล เพื่อไปปรับปรุงกระบวนงานของหน่วยงาน เช่น การใช้ Pareto Diagrams การใช้ Histograms Run charts หรือ Force Field Analysis เป็นต้น
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(99, 4, '309', 'การมอบหมายงานและการหมุนเวียนงาน
ให้เป็นผู้ริเริ่มโครงการที่ต้องติดต่อสัมพันธ์และติดต่อประสานงานกับหลายๆ หน่วยงาน เพื่อศึกษาเรียนรู้ความสำเร็จหรือความผิดพลาดของระบบหรือกระบวนการการทำงานขององค์กรที่เกี่ยวข้องและนำมาปรับใช้กับการทำงานของหน่วยงานอย่างเหมาะสม
มอบหมายให้ศึกษากระแสหรือสถานการณ์ภายนอกที่จะกระทบต่อองค์กร แล้วนำผลการศึกษามากำหนด/วางแผนว่าจะสามารถปรับเปลี่ยนกระบวนการ ระบบ เทคโนโลยีขององค์กรได้อย่างไรให้สามารถตอบสนองต่อสถานการณ์ภายนอกเหล่านั้นได้อย่างมีประสิทธิภาพสูงสุด
มอบหมายดำเนินการปรับระบบ กระบวนการทำงาน หรือมาตรฐานการทำงานของหน่วยงาน เพื่อให้เตรียมรับมือกับนโยบายหรือระบบมาตรฐานที่เปลี่ยนแปลงไป ', 'การคิดและพฤติกรรม
ศึกษาและอ่านหนังสือที่เกี่ยวข้อง เช่น หนังสือพิมพ์ นิตยสาร หรือบทความที่เกี่ยวข้องกับความเคลื่อนไหวหรือความเป็นไปขององค์กรเพื่อนำความเข้าใจดังกล่าวมาปรับปรุงกระบวนการทำงานในหน่วยงานที่รับผิดชอบ
สอบถามและแลกเปลี่ยนความรู้ ความเข้าใจและประสบการณ์เกี่ยวกับองค์กรกับผู้รู้ที่มีความเข้าใจอย่างลึกซึ่งต่อองค์กรและระบบการทำงาน
หมั่นติดตามเจาะลึกความเคลื่อนไหวของระบบ หลักเกณฑ์ และมาตรฐานด้านอุตสาหกรรม แล้วนำความเข้าใจเหล่านั้นมานำเสนอหรือกำหนดแผนการดำเนินการในหน่วยงานหรือองค์กรเพื่อให้สามารถทำงานได้อย่างเหมาะสมกับการเปลี่ยนแปลงที่จะเกิดขึ้น', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(100, 5, '309', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ศึกษาวิสัยทัศน์ กลยุทธ์ และพันธกิจหลักที่สำคัญขององค์กรและองค์กรอื่นที่เกี่ยวข้องเพื่อนำความเข้าใจเหล่านั้นมากำหนดจุดยืนและภารกิจในหน้าที่ได้อย่างสอดคล้องเหมาะสมต่อสภาพและกระบวนการทำงานในปัจจุบันขององค์กร
ให้วางแผนเชิงกลยุทธ์ว่าจะดำเนินการเปลี่ยนแปลงระบบ หรือกระบวนการทำงานใดในองค์กร ที่สามารถนำไปสู่การเปลี่ยนแปลงเพื่อให้องค์กรเติบโตอย่างยั่งยืน 
ให้บูรณาการระบบหรือเทคโนโลยีต่างๆ ขององค์กร เพื่อเพิ่มประสิทธิภาพของผลงาน หรือเพื่อเพิ่มความสามารถในการแข่งขันให้กับองค์กร 
ให้คิดค้นและสร้างมาตรฐานการเพิ่มประสิทธิภาพในการทำงานที่จะเกิดประโยชน์สูงสุดต่อสังคมไทย', 'การคิดและพฤติกรรม
ศึกษาและเจาะลึกข้อมูลต่างๆ ในองค์กรเพื่อให้เข้าใจสถานะของระบบ เทคโนโลยี และกระบวนการการทำงานอย่างถ่องแท้ 
หมั่นติดตามแผนงาน แผนกลยุทธ์หลัก วิสัยทัศน์ พันธกิจและเป้าหมายหลักขององค์กร
เข้าโครงการใหม่ๆ ที่มีผลกระทบต่อภาพรวมขององค์กรแล้ววิเคราะห์วางแผนว่าจะปรับเปลี่ยนระบบ เทคโนโลยี มาตรฐาน หรือกระบวนการอย่างไรให้องค์กรเติบโตอย่างยั่งยืน', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(101, 1, '310', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เตรียมเอกสาร ข้อมูล หรือรายงานต่างๆ ที่เกี่ยวข้อง และให้พูดและเสนอผลงานต่อหน้าบุคคลต่างๆ หรือต่อหน้าที่ประชุม
เปิดโอกาสให้ได้ลองปฏิบัติงานที่มีลักษณะเกี่ยวข้องกับการเจรจาและการเสนอผลงาน
เปิดโอกาสให้มีส่วนร่วมในการเสนอความคิดเห็นหรือข้อเสนอแนะต่างๆ ที่เกี่ยวข้อง เพื่อพัฒนาความสามารถด้านการเสนอผลงานและความกล้าแสดงออกในการแสดงความคิดเห็นของแต่ละบุคคลต่อหน้ากลุ่มคน หรือที่ประชุม
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการเสนอผลงานอย่างมีประสิทธิภาพ
การฝึกอบรม
เทคนิคการนำเสนอ', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการนำเสนอ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมได้รู้จักการกำหนดเป้าหมาย และวัตถุประสงค์ในการนำเสนอแก่ผู้อื่น
เพื่อให้ผู้เข้าอบรมเข้าใจขบวนการสังเกตและปรับแนวทางการนำเสนอด้วยการวิเคราะห์ผู้ฟังอย่างมีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมสามารถจัดลำดับความคิดเห็นและขบวนการนำเสนออย่างมีขั้นตอน และเข้าใจง่าย
เพื่อให้ผู้เข้าอบรมสามารถจัดลำดับข้อมูลได้สมบูรณ์ พร้อมประยุกต์เครื่องมือ และอุปกรณ์ต่าง ในการนำเสนอได้อย่างมีประสิทธิภาพ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการและความสำคัญของการนำเสนอ 
รูปแบบการนำเสนอที่มีประสิทธิผล
ทักษะและเทคนิคการนำเสนอที่เหมาะสมกับสถานการณ์
การวางแผนและการเตรียมการก่อนนำเสนอ 
ทักษะที่ใช้ในการนำเสนอ
การเพิ่มประสิทธิภาพในการพูดเพื่อนำเสนอ
ระยะเวลาของหลักสูตร
1-2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(102, 2, '310', 'กิจกรรมเพื่อการพัฒนา (สำหรับระดับที่ 2)
การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานที่เกี่ยวข้องกับการเจรจา การนำเสนอข้อมูล การสร้างอิทธิพลต่อผู้อื่น และอาศัยทักษะการพูดเป็นสำคัญ
มอบหมายงานหรือหมุนเวียนงานให้ปฏิบัติหน้าที่ออกร้านเพื่อนำเสนอสินค้า 
เปิดโอกาสให้ปฏิบัติหน้าที่ในการสัมภาษณ์ผู้บริหารระดับสูง หรือให้เป็นผู้เตรียมข้อมูลในการนำเสนองาน/ สินค้าต่างๆ
ลองเปลี่ยนลักษณะความรับผิดชอบ เช่น ให้รับผิดชอบการสัมภาษณ์งานบุคคลเข้าทำงาน (ฝ่ายสรรหาบุคลากร)
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการโน้มน้าวใจโดยใช้หลักการและเหตุผล
การฝึกอบรม
Presentation Skill
', 'ชื่อหลักสูตรการฝึกอบรม: Presentation Skill
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด หลักการ และวิธีการในการทำ Presentation 
เพื่อให้ผู้เข้าอบรมสามารถทำ Presentation ได้อย่างถูกต้อง และน่าสนใจ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
แนวคิด หลักการ ส่วนประกอบ และรูปแบบในการทำ Presentation
ความแตกต่างและวิธีการเขียนหัวข้อของแต่ละสไลด์ (Claim Titles) รวมทั้งการเขียนหัวข้อย่อย Sub Titles
รูปแบบและประเภทการจัดทำสไลด์
หลักการเตรียมสไลด์ (Blank Slides) 
การออกแบบสไลด์ให้ถูกต้องและเหมาะสม
หลักการการนำเสนอผลข้อมูลต่างๆ เช่น กราฟ ตาราง การเปรียบเทียบข้อมูล และผลการวิเคราะห์ต่างๆ เป็นต้น 
กิจกรรม แบบฝึกหัด และทดลองให้จัดทำ Presentation จริง เพื่อให้ผู้เข้าอบรมมีความเข้าใจที่ถูกต้อง และสามารถจัดทำ Presentation ได้อย่างถูกต้องและน่าสนใจ
ระยะเวลาของหลักสูตร  1 วัน
แนวทางการประเมินผล 
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(103, 3, '310', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เข้าร่วมในงานที่เกี่ยวข้องกับการวางแผนงานการขายหรือการเจรจาต่อรองให้สัมฤทธิ์ผล
มอบหมายให้ทำงานกับบุคคลที่ทำงานได้ด้วยยากที่ต้องอาศัยการโน้มน้าวใจในการทำงาน
เปิดโอกาสให้ได้ลองปฏิบัติงานหรือโอนย้ายไปรับผิดชอบงานที่มีลักษณะเกี่ยวข้องกับการเจรจาโน้มน้าวใจ เช่น งานขาย งานการตลาด งานสื่อสารประชาสัมพันธ์ เป็นต้น
มอบหมายงานให้เป็นตัวแทน หรือตัวกลางในการเสนอทางเลือกหรือหาข้อสรุปการเจรจาให้กับกลุ่มบุคคล
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการเจรจาต่อรองอย่างสัมฤทธิ์ผล
สอนงานเรื่องศิลปะในการขาย การตลาด และการสื่อสารประชาสัมพันธ์
การฝึกอบรม
การนำเสนอและการพูดต่อสาธารณชนอย่างมีพลัง', 'ชื่อหลักสูตรการฝึกอบรม: การนำเสนอและการพูดต่อสาธารณชนอย่าง
มีพลัง
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิดเรื่องการสื่อสารที่มีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิดเรื่องการนำเสนอที่ชนะใจคน
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการพื้นฐานของการสื่อสารและนำเสนอที่มีประสิทธิภาพ
ข้อผิดพลาดในการสื่อสารและนำเสนอที่พบบ่อยและแนวทางในการป้องกัน
หลักการเรื่อง Emotional intelligence และการเข้าใจใจเขาใจเรากับการสื่อสาร
แนวคิดเบื้องต้นเกี่ยวกับภาษาและพฤติกรรมมนุษย์ (Myers-Briggs Type Indicator) เพื่อให้สามารถตอบสนองและสื่อสารได้อย่างมีประสิทธิภาพสูงสุด
กระบวนการในการฟังที่ดี และกระบวนการเขียนที่มีประสิทธิภาพ
กระบวนการในการตั้งคำถามและตอบสนองที่เหมาะสมเพื่อความชัดเจนในการสื่อสาร
เครื่องมือและแนวคิดเรื่องการโน้มน้าวและเข้าถึงใจคน 
กระบวนการนำเสนอที่ชนะใจคน (How To Make Winning Presentations) 
นอกจากนั้นยังควรมีการจัดกิจกรรมเป็น Workshop ให้ผู้ฝึกอบรมเข้าใจกรอบแนวคิดและเครื่องมืออย่างถูกต้อง
ระยะเวลาของหลักสูตร  ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล 
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(104, 4, '310', 'การมอบหมายงานและการหมุนเวียนงาน
ให้เข้าร่วมในงานที่เกี่ยวข้องกับการวางแผนเชิงกลยุทธ์ด้านการขาย การตลาด หรือการวางแผนกลยุทธ์ขององค์กรที่เน้นการโน้มน้าวจูงใจโดยอ้อมในเชิงกลยุทธ์
มอบหมายงานให้เสนอผลงานโดยต้องอาศัยการโน้มน้าวจูงใจผู้บริหารระดับสูงซึ่งเป็นเรื่องที่มีผลกระทบต่อฝ่ายงานหรือองค์กรในภาพรวม
มอบหมายงานหรือหมุนเวียนงานให้รับผิดชอบในด้านที่เกี่ยวข้องกับการวางกลยุทธ์ การนำเสนอกระบวนการ/ ความคิดใหม่ๆ เพื่อที่จะได้ฝึกฝนทักษะการนำเสนอให้ผู้อื่นคล้อยตามและการใช้กลยุทธ์การสื่อสารจูงใจทางอ้อมได้อย่างมีประสิทธิภาพสูงสุด
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการใช้กลยุทธ์ในการสื่อสารโน้มน้าวจูงใจทางอ้อม
การฝึกอบรม
การโน้มน้าวจูงใจ', 'ชื่อหลักสูตรการฝึกอบรม: การโน้มน้าวจูงใจ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดและเครื่องมือในการคิดกลยุทธ์ในการชักจูงใจ (Influence Strategies)
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบแนวคิดเรื่ององค์ประกอบในการชักจูงใจ (What create Influence) เช่น การมี Self Motivation การนำเสนอที่มีประสิทธิผล (Good Communication) และการมีความสามารถในการนำกระบวนการในการชักจูงใจ ผ่านการวิเคราะห์ อะไรคือสิ่งที่เราต้องการชักจูง (Want) ใครคือผู้รับ (Player) และสถานการณ์ (Is) 
ที่มาของขุมพลัง (Power) ในการจูงใจ รวมถึงกลยุทธ์ (Strategies) และเครื่องมือในการชักจูงใจข้อดี-ข้อเสียและความเหมาะสมในการนำไปใช้
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมิน                                                              เมื่อเริ่มการฝึกอบรม และสิ้น                                                                 สุดการฝึกอบรมว่ามีระดับการ                                                         พัฒนาความเข้าใจหรือไม่                                                              เพียงใด นอกจากนั้นให้                                                                   ผู้บังคับบัญชาประเมินว่าได้                                                                      มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(105, 5, '310', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นผู้รับผิดชอบในการพัฒนาและเสนอผลิตภัณฑ์ หรือโครงการใหม่ๆ ให้เกิดขึ้นภายในองค์กรอย่างมีผลสำเร็จ ที่ต้องอาศัยความร่วมมือกับบุคคลภายในองค์กรเป็นจำนวนมาก
โอนย้ายหรือหมุนเวียนให้ทำงานร่วมกับกลุ่มบุคคลที่ความขัดแย้งกัน หรือมอบหมายหน้าที่ให้เป็นผู้ประสานความขัดแย้งของกลุ่มบุคคล
มอบหมายงานให้เป็นตัวแทนขององค์กรในการเจรจาต่อรองในเรื่องผลประโยชน์ทางธุรกิจขององค์กร
เปิดโอกาสให้เป็นผู้นำในการล็อบบี้ (Lobby) ในเรื่องที่มีผลกระทบต่อองค์กรหรือฝ่ายงานที่ต้องอาศัยการประยุกต์หลักจิตวิทยาหรือกลยุทธ์ที่ซับซ้อนในการจูงใจ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการใช้กลยุทธ์ในการสื่อสารโน้มน้าวจูงใจทางอ้อม และการใช้หลักจิตวิทยามวลชนในการโน้มน้าวจูงใจ
การฝึกอบรม
การสื่อสารสาธารณะแบบมีส่วนร่วมทุกภาคส่วน
จิตวิทยามวลชนสัมพันธ์', 'ชื่อหลักสูตรการฝึกอบรม: การสื่อสารสาธารณะแบบมีส่วนร่วมทุกภาคส่วน
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวทางและวิธีการการสื่อสารสาธารณะแบบมีส่วนร่วมทุกภาคส่วน
เพื่อให้ผู้เข้าอบรมสามารถประยุกต์ใช้หลักการสื่อสารสาธารณะแบบมีส่วนร่วมทุกภาคส่วนได้อย่างมีประสิทธิภาพ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการ แนวทาง และวิธีการการสื่อสารสาธารณะแบบมีส่วนร่วม 
เทคนิคและตัวอย่างการสื่อสารสาธารณะแบบมีส่วนร่วม
เทคนิคและตัวอย่างการรับฟังความคิดเห็นอย่างมีส่วนร่วม
รูปแบบของกลุ่มเทคนิคการมีส่วนร่วม ตัวอย่างเทคนิคการมีส่วนร่วมในการให้ข้อมูล
เทคนิคและการปรึกษาหารือ
การสร้างความร่วมมือกับภาคีเครือข่ายด้านการสื่อสารมวลชน
หลักการสื่อสารข้อมูลต่อสาธารณชน และการสื่อสารแบบรอบทิศ 360 องศา
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไรชื่อหลักสูตรการฝึกอบรม: จิตวิทยามวลชนสัมพันธ์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความรู้ ความเข้าใจเกี่ยวกับหลักจิตวิทยามวลชน เครื่องมือ เทคนิค รูปแบบและการสร้างสัมพันธ์กับมวลชน และการสร้างเครือข่ายมวลชน
เพื่อให้ผู้เข้าอบรมได้แนวคิดในการจัดทำรูปแบบและแผนงาน หรือแผนปฏิบัติงาน เกี่ยวกับการสร้างจิตวิทยามวลชนสัมพันธ์ในพื้นที่รับผิดชอบ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ทฤษฎีและธรรมชาติมวลชน ทฤษฎีกลุ่ม
หลักจิตวิทยามวลชน และจิตวิทยากลุ่มสัมพันธ์
จิตวิทยาการสร้างสัมพันธภาพกับกลุ่ม ชุมชน และมวลชน
สิ่งเร้าที่มีผลต่อการรวมกลุ่มมวลชน
รูปแบบ วิธีการ เทคนิคการสร้างเครือข่าย
เครื่องมือ/กิจกรรมการสร้างกลุ่ม
เกมและกิจกรรมเพื่อการสร้างองค์กรชุมชน องค์กรมวลชนอย่างมีเป้าหมายและทิศทาง
กิจกรรม A-I-C Work shop เพื่อการสร้างทัศนคติและการบริหารแบบมีส่วนร่วม
กิจกรรม Mind Map และการประยุกต์ใช้เพื่อสร้างการมีส่วนร่วม
เทคนิคการสร้างและออกแบบการสอนหรือกระบวนการกลุ่ม เพื่อการสร้างกลุ่ม
สัมมนากลุ่มย่อย การจัดทำรูปแบบ และแผนงานเพื่อการสร้างจิตวิทยามวลชนสัมพันธ์ในการบริหารจัดการงาน
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(106, 1, '311', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ทดลองวิธีการทำงานหรือการวิจัยที่แตกต่างจากเดิม เพื่อให้ได้มาซึ่งความรู้ใหม่ๆ 
มอบหมายให้ไปเสาะหาความรู้หรือกระบวนการใหม่ๆ เพื่อนำมาใช้ทดแทนวิธีการที่ใช้อยู่เดิม
มอบหมายให้ดำเนินการใช้นวัตกรรมใหม่ๆ ในการปฏิบัติงาน 
เมื่อมีนวัตกรรมเกิดขึ้น มอบหมายให้ไปศึกษาดูงานเพื่อให้เข้าใจกระบวนการคิด
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่ององค์ความรู้หรือการใช้เทคโนโลยีใหม่ๆ ในงาน
การฝึกอบรม
ความคิดสร้างสรรค์', 'ชื่อหลักสูตรการฝึกอบรม: ความคิดสร้างสรรค์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมกล้าที่จะแสดงความคิดริเริ่มสร้างสรรค์ที่เป็นประโยชน์ในงาน
เพื่อให้ผู้เข้าอบรมสามารถประยุกต์วิธีการใหม่ๆ หรือปรับเปลี่ยนวิธีการคิดที่มีความแตกต่างและหลากหลายมาใช้ในงานได้
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการ และวิธีการในการเสนอความคิดใหม่ๆ หรือความคิดที่แตกต่างสร้างสรรค์ 
การคิดนอกกรอบเป็นอย่างไร และทำไมจึงควรคิดนอกกรอบ
ประโยชน์ของการคิดริเริ่มสร้างสรรค์
การนำความคิดสร้างสรรค์และการคิดนอกกรอบไปสู่การปฏิบัติจริงได้
มีกิจกรรม และแบบทดสอบ รวมทั้งทดลองให้ปฏิบัติจริง เพื่อให้ผู้รับการฝึกอบรมเข้าใจในหลักการ กระบวนการ และสามารถนำไปประยุกต์ใช้จริงในการปฏิบัติงานในหน่วยงานได้
ระยะเวลาของหลักสูตร
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(107, 2, '311', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ร่วมกันพัฒนาปรับปรุงให้ผลงานให้หน่วยงานมีคุณภาพหรือมีกระบวนการทำงานที่มีประสิทธิภาพมากขึ้น
มอบหมายให้เปลี่ยนแปลงรูปแบบหรือขั้นตอนการทำงานใหม่ๆ โดยอาจให้ไปคิดค้นมาใหม่หรือประยุกต์ต่อยอดจากแนวคิดเดิม
ควรมอบหมายงานที่เกี่ยวข้องกับการค้นคว้าสิ่งใหม่ๆ และการทดสอบกระบวนการ และระบบใหม่ๆ ก่อนนำมาใช้จริงในองค์กร
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องการปรับเปลี่ยนกระบวนการ
การฝึกอบรม
Process Re-Engineering', 'ชื่อหลักสูตรการฝึกอบรม: Process Re-Engineering 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่อง Process Reengineering
เพื่อให้ผู้เข้าอบรมได้มีโอกาสทดลองปฏิบัติจริง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กระบวนการเก็บข้อมูลเพื่อให้เข้าใจระบบงานเดิม
กระบวนการวิเคราะห์ Outcome Analysis
กระบวนการวิเคราะห์ Technology analysis
เทคนิคต่างๆ ในการปรับปรุงกระบวนงาน เช่น Activity Elimination Assess Potential Business Value, การกำหนดต้นทุน (Determine Project Cost), การกำหนดความเสี่ยง (Determine Risk of Failure)
กระบวนการในการพัฒนาแนวคิดสำหรับระบบงานใหม่และกำหนดสิ่งที่ต้องปรับปรุง (TO BE Approach)
ระยะเวลาของหลักสูตร 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(108, 3, '311', 'การมอบหมายงานและการหมุนเวียนงาน
ให้นำเสนอทางเลือก (Option) หรือแนวทางแก้ปัญหา (Solution) เมื่อมีงานในโครงการหรืองานประจำประสบอุปสรรค หรือต้องการข้อคิดเห็นที่สามารถนำไปพัฒนากระบวนการเดิมที่มีอยู่
มอบหมายให้ศึกษาคู่แข่งว่ามีวิธีการในการตอบสนองลูกค้าแตกต่างจากวิธีที่องค์กรใช้อย่างไร แล้วจะนำมาประยุกต์ใช้กับองค์กรได้อย่างไรบ้าง 
มอบหมายให้วิเคราะห์ผลิตภัณฑ์และบริการขององค์กรในปัจจุบันแล้วระบุช่องว่างที่สามารถปรับปรุงพัฒนาต่อไปได้ โดยอาจมีการวิเคราะห์ทรัพยากรที่ใช้สนับสนุนความคิด แรงกดดันจากการแข่งขัน ผลตอบแทนทางการเงินที่เป็นไปได้
การโค้ช (Coaching)
แนะนำและแลกเปลี่ยนประสบการณ์ในเรื่องกระบวนการในการสร้างนวัตกรรมหรือแนวคิดใหม่ๆ 
การฝึกอบรม
การบริหารนวัตกรรมสร้างสรรค์', 'ชื่อหลักสูตรการฝึกอบรม: การบริหารนวัตกรรมสร้างสรรค์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด เรื่องการบริหารนวัตกรรมสร้างสรรค์ 
กรอบเนื้อหาของหลักสูตร
ความสำคัญและกรอบแนวคิดในเรื่องการปรับปรุงและสร้างสรรค์สิ่งใหม่ 
Model กระบวนการและเครื่องมือในการปรับปรุงวิธีการใหม่ (Incremental Innovation) หรือการสร้างนวัตกรรมแบบ Radical Innovation 
กลยุทธ์ในการสนับสนุนให้เกิดนวัตกรรมใหม่ในองค์กร การวัดผล และการใช้ประโยชน์จากวิธีการใหม่หรือนวัตกรรมสร้างสรรค์ที่คิดขึ้น 
ระยะเวลาของหลักสูตร 8 ชั่วโมง
แนวทางการประเมินผล
ผู้เข้าอบรมจะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถสนับสนุนให้เกิดวิธีการหรือความสร้างสรรค์ใหม่ๆ ได้มากน้อยเพียงได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(109, 4, '311', 'การมอบหมายงานและการหมุนเวียนงาน
เมื่อมีการเปลี่ยนแปลงในอุตสาหกรรม มอบหมายให้ประยุกต์ใช้องค์ความรู้ ทฤษฎี หรือแนวคิดที่เคยใช้มา มาต่อยอดให้ได้ทางเลือก (Option) ที่จะสามารถรองรับการเปลี่ยนแปลงที่เกิดขึ้นได้
มอบหมายให้คิดค้นหาแนวทางในการแก้ปัญหา (Solution) หรือพัฒนาองค์กรให้มีประสิทธิภาพสูงขึ้น ในเรื่องที่บุคคลผู้นั้นถนัด
มอบหมายงานที่เกี่ยวข้องกับการวิเคราะห์ธุรกิจ วิเคราะห์คู่แข่ง และวางแผนกลยุทธ์
การดูงาน
การให้ไปดูงานเพื่อเรียนรู้องค์กรหรือหน่วยงานที่ได้รับการยกย่องว่ามีนวัตกรรมยอดเยี่ยม
การคิดและพฤติกรรม
หาประเด็นและมุมมองใหม่ๆ เพื่อมาศึกษาและวิจัยผลิตภัณฑ์หรือบริการใหม่ๆ ที่ยังไม่มีผู้ใดคิดค้นมาก่อนในองค์กร
หมั่นศึกษาแนวทางใหม่ๆ หรือ Best Practice ในองค์กรอื่นๆ (ภาครัฐหรือเอกชน) ทั้งในและต่างประเทศเพื่อนำมาริเริ่มสร้างสรรค์แนวทางใหม่ๆ ในการปฏิบัติงานหรือดำเนินการต่างๆ
การฝึกอบรม
การวางแผนเชิงกลยุทธ์', 'ชื่อหลักสูตรการฝึกอบรม: การวางแผนเชิงกลยุทธ์
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิด และให้ความสำคัญของการคิดเชิงกลยุทธ์
เพื่อให้ผู้เข้าอบรมเข้าใจ และสามารถนำไปใช้ถึงวิธีการคิด วิเคราะห์ และมองหาโอกาสในเชิงกลยุทธ์ โดยใช้ข้อมูล และหลักการทฤษฎีมาประยุกต์ให้เกิดประโยชน์
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ความสำคัญ และองค์ประกอบของการคิดเชิงกลยุทธ์ เพื่อความสำเร็จขององค์กร
ขั้นตอน และกระบวนการในการ Moving from Operational Manager to a Strategic Thinker 
หลักการวิเคราะห์จุดแข็ง จุดอ่อน โอกาส และข้อจำกัดของธุรกิจ (SWOT Analysis) รวมทั้งการวิเคราะห์คู่แข่ง และตลาด
ข้อมูลที่จำเป็นต้องใช้เพื่อการคิด และมองปัญหาในเชิงกลยุทธ์และโอกาสในทางธุรกิจ
ข้อจำกัดของการที่ผู้บริหารไม่สามารถคิดในเชิงกลยุทธ์ได้ และวิธีการขจัดข้อจำกัด
แบบทดสอบ (Case Study) ก่อนการเข้ามีการสัมมนา เพื่อวัดการคิดเชิงกลยุทธ์เพื่อให้ผู้บริหารได้ศึกษาและลองใช้ข้อมูล เพื่อตัดสินใจในเชิงกลยุทธ์
การจำลองสถานการณ์ และแบบฝึกหัดการออกแบบธุรกิจ และการตัดสินใจเชิงธุรกิจ เพื่อสร้างข้อได้เปรียบทางธุรกิจ และสร้างผลประโยชน์ในระยะยาว
ระยะเวลาของหลักสูตร 1 วัน
แนวทางการประเมินผล
ผู้เข้าอบรมจะถูกประเมินด้วยแบบทดสอบก่อนการเข้าสัมมนาเพื่อวัดระดับความสามารถ และในระหว่างการสัมมนาจะมีแบบฝึกหัดเพื่อวัดผลการคิดเชิง    กลยุทธ์ด้านการออกแบบธุรกิจ และเมื่อสิ้นสุดการฝึกอบรมจะจัดให้มี Individual Case Practice ซึ่งอิงจากความรับผิดชอบงานที่จะมีผลต่อความสำเร็จองค์กร เพื่อให้แนวทางในการนำความรู้ไปใช้ในงานได้', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(110, 5, '311', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ทำสิ่งใหม่ในระบบอุตสาหกรรมหรือต่อประเทศโดยรวม
การโค้ช (Coaching)
สนับสนุนให้เกิดบรรยากาศแห่งความคิดสร้างสรรค์หรือสร้างโอกาสใหม่ทางธุรกิจในองค์กร ด้วยการให้การสนับสนุนทางทรัพยากร หรือจัดกิจกรรมต่างๆ ที่จะช่วยกระตุ้นให้เกิดการแสดงออกทางความคิดสร้างสรรค์
การคิดและพฤติกรรม
คิดนอกกรอบเพื่อหาไอเดีย (Idea) ใหม่ๆ แล้วดำเนินการวิจัย หรือประดิษฐ์คิดค้นต้นแบบ สูตร หรือองค์ความรู้ใหม่ที่ไม่เคยปรากฏมาก่อนในวงการ
การฝึกอบรม
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการดำเนินการเชิงรุก (Proactiveness- PRO) 
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการคิดวิเคราะห์ (Analytical Thinking- AT)
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องศักยภาพเพื่อนำการปรับเปลี่ยน (Change Leadership- CL)', '', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(111, 1, '312', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เข้าร่วมเป็นส่วนหนึ่งของการแก้ไขปัญหาที่เกิดขึ้นในองค์กรหรือในหน่วยงานที่รับผิดชอบ
ควรมอบหมายงานที่มีกำหนดเวลาระยะสั้น และต้องการผลลัพธ์โดยเร็ว
มอบหมายให้แก้ปัญหาที่ได้ทำผิดพลาดมาให้กลับเป็นประสบความสำเร็จ
ให้โอกาสทำงานโครงการเฉพาะกิจที่เน้นการแก้ไขปัญหาและต้องอาศัยการพลิกแพลง ปรับเปลี่ยนกระบวนการใหม่ๆ เป็นสำคัญ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางหรือกระบวนการในการแก้ปัญหาที่เกิดขึ้น รวมถึงให้การสนับสนุนและคำชมเชย หากสามารถแก้ไขปัญหาได้สำเร็จ
การฝึกอบรม
On-the-Job Training', 'ชื่อหลักสูตรการฝึกอบรม: On-the-Job Training
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจมาตรฐาน วิธีการทำงาน และกระบวนการในการทำงานของตำแหน่งงานของตนเองอย่างถูกต้อง และชัดเจน
เพื่อให้โอกาสผู้เข้าอบรมมีโอกาสสั่งสมความชำนาญในการทำงาน และสามารถปฏิบัติงานได้อย่างถูกต้อง โดยไม่มีข้อผิดพลาด และตรงตามมาตรฐานที่กำหนด
กรอบเนื้อหาของหลักสูตร
อธิบายกฎระเบียบ วิธีการปฏิบัติงาน และมาตรฐานความถูกต้องของงานในตำแหน่งงานที่รับผิดชอบ
จัดทำคู่มือ ระเบียบปฏิบัติ และกระบวนการทำงานของตำแหน่งงาน
ดำเนินการฝึกอบรมถึงหน้าที่ความรับผิดชอบ ขั้นตอนการปฏิบัติงาน โดยเน้นเรื่องความถูกต้องของงานควบคู่ไปกับการปฏิบัติงานจริง 
มีกิจกรรม และแบบทดสอบ รวมทั้งทดลองให้ปฏิบัติงานจริง เพื่อให้ผู้รับการฝึกอบรมเข้าใจในวิธีการปฏิบัติงาน สามารถปฏิบัติงานได้ถูกต้อง และสามารถนำไปใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร ครึ่งวัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(112, 2, '312', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้แก้ปัญหาวิกฤติในหน่วยงานที่รับผิดชอบหรือหน่วยงานอื่นที่เกี่ยวข้อง
มอบหมายงานที่ยุ่งยากและซับซ้อนโดยในงานจะต้องมี
การระบุถึงปัญหาและประเด็นเบื้องลึกต่างๆ (Issues)
แนวทางหรือทางเลือกต่างๆ ในการแก้ไขปัญหา
การวิเคราะห์ข้อดี ข้อเสียในแต่ละทางเลือก
แผนการในการดำเนินงานหลังจากเลือกทางเลือกแล้ว
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการแก้ปัญหาวิกฤติ หรือสถานการณ์ที่สำคัญในองค์กร
ให้คำแนะนำในการบริหารความขัดแย้งหรือการแก้ปัญหาที่ซับซ้อนอย่างเป็นระบบ
การฝึกอบรม
การบริหารความขัดแย้ง', 'ชื่อหลักสูตรการฝึกอบรม: การบริหารความขัดแย้ง 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถเข้าใจถึงการบริหารจัดการความขัดแย้ง (Conflict Management)
เพื่อให้ผู้เข้าอบรมมีเครื่องมือในการบริหารจัดการความขัดแย้งและแก้ปัญหาอย่างถูกต้อง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
การบริหาร Conflict โดยตามทฤษฎีของ Thomas-Kilmann (Competing, Accommodating, Avoiding,                                                        Compromising และ Collaborating)
การกำหนดทางเลือกในการตัดสินใจ                                                            และการประเมินความขัดแย้ง
การพิจารณาความเสี่ยงที่อาจเกิดขึ้น                                                                      และระดับที่ยอมรับได้/ไม่ได้                                                                          จากผลการตัดสินใจ
การนำสิ่งที่ตัดสินใจเข้าสู่การปฏิบัติ
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(113, 3, '312', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นผู้นำในแก้ไขปัญหา/สถานการณ์วิกฤตที่สำคัญขององค์กรหรือหน่วยงาน
มอบหมายให้วางแผนงานประจำปีของหน่วยงานที่รับผิดชอบ
มอบหมายให้วิเคราะห์หาปัญหาหรือสถานการณ์ที่ทำให้หน่วยงาน/องค์กรไม่บรรลุเป้าหมายที่กำหนดไว้ แล้วให้นำเสนอแนวทางในการแก้ไขปัญหาดังกล่าวที่มีประสิทธิภาพสูงสุดและปฏิบัติได้จริง
การโค้ช (Coaching)
ชี้ให้เห็นถึงโอกาสหรือปัญหาที่จะเกิดขึ้นกับองค์กรและร่วมกันดำเนินการให้ได้มาซึ่งแนวทางในการแก้ไปปัญหา
ให้การสนับสนุนและแสดงความชื่นชมหากการดำเนินการล่วงหน้าประสบความสำเร็จ
การฝึกอบรม
Scenario Planning Workshop', 'ชื่อหลักสูตรการฝึกอบรม: Scenario Planning 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถเข้าใจถึงกรอบแนวคิดในเรื่องการวางแผนภาพในอนาคต 
เพื่อให้ผู้เข้าอบรมมีเครื่องมือในการบริหารจัดการเชิงรุก
กรอบเนื้อหาของหลักสูตร
กรอบแนวคิดในเรื่อง Scenario Planning
เครื่องมือและกระบวนการคิดแบบ Scenario Planning เช่น การสังเคราะห์แนวโน้ม การกำหนดตัวแปรที่ไม่แน่นอนในอนาคต (Uncertainty) 
การคัดสรรทางเลือกที่จะจัดการกับปัญหาหรือโอกาสในแต่ละ Scenario
ความสัมพันธ์ของ Scenario Planning กับการดำเนินงานเชิงรุก และการคิดเชิงกลยุทธ์
มีกิจกรรมต่างๆ เพื่อให้ผู้เข้าอบรมได้เข้าใจถึงกรอบแนวคิดและนำ Scenario Planning ไปใช้
ระยะเวลาของหลักสูตร ไม่น้อยกว่า 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(114, 4, '312', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เริ่มหน่วยงานหรือเริ่มโครงการใหม่ๆ ที่ต้องวางแผนงานให้เชื่อมโยงกับกลยุทธ์ระยะยาวขององค์กร โดยวางแผนว่าทำอะไรก่อนหลังอย่างไร อะไรเป็นผลงานที่สำคัญกว่า (Priority) และจะมีการวางแผนทรัพยากรอย่างไรให้สามารถบรรลุผลได้ตามเป้าหมายที่กำหนดไว้
มอบหมายให้วางแผนและนำเสนอแผนงาน 5 ปีแก่ผู้บริหารระดับสูงขององค์กร
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการเป็นผู้นำในการริเริ่มสร้างสรรค์แนวคิดใหม่ กระบวนการทำงานใหม่หรือนวัตกรรมต่างๆ รวมถึงสนับสนุนและให้รางวัลกับการทำงานที่ประสบความสำเร็จ
ให้โอกาสและไม่ตำหนิหากความคิดริเริ่มนั้นไม่ประสบความสำเร็จตามที่คาดหมายไว้ 
การคิดและพฤติกรรม
คาดการณ์ไปถึงหนึ่งปีข้างหน้าโดยพิจารณาถึงโอกาสที่สามารถจะกระทำการได้ และประสบความสำเร็จ โดยทำการจัดลำดับโอกาส และทำการวางแผนงานอย่างเฉพาะเจาะจงเพื่อที่จะสามารถสร้างข้อได้เปรียบในโอกาสเหล่านั้นได้
ทำรายการของปัจจัยภายนอกที่อาจมีผลกระทบต่อหน่วยงาน เช่น สถานการณ์บ้านเมือง นโยบายรัฐบาล แนวโน้มระบบอุตสาหกรรม เป็นต้น แล้วระบุถึงแนวทางในการเตรียมความพร้อมและกระบวนการในการนำไปใช้
การฝึกอบรม
การแก้ไขปัญหาอย่างเป็นระบบ ', 'ชื่อหลักสูตรการฝึกอบรม: การแก้ไขปัญหาอย่างเป็นระบบ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถกำหนดขอบเขต (Parameter) ของข้อมูลในการวิเคราะห์ได้ครอบคลุม ถูกต้องและทุกระดับ
เพื่อให้ผู้เข้าอบรมสามารถสร้างความสัมพันธ์อย่างเป็นระบบของตัวแปร ปัจจัยในเชิงเหตุและผล
เพื่อให้ผู้เข้าอบรมสามารถแยกแยะสาเหตุและอาการ รวมทั้งผลของปัญหา
เพื่อให้ผู้เข้าอบรมสามารถวิเคราะห์ทางเลือกและประเมินผลกระทบระยะสั้น ระยะยาว ข้อดี ข้อเสีย ข้อด้อย ทั้งในเชิงคุณภาพและปริมาณ
เพื่อให้ผู้บริหารสามารถกำหนดวิธีการติดตามผลได้
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบความคิดในการพิจารณาปัญหาที่ต้องตัดสินใจ และการให้คำจำกัดความต่อปัญหา
การกำหนดวัตถุประสงค์ที่ต้องการบรรลุผลสำเร็จในการตัดสินใจ
การกำหนดขอบเขตข้อมูลที่ต้องใช้วิเคราะห์ และสร้างความสัมพันธ์ระหว่างปัจจัยต่างๆ ในเชิงเหตุและผลที่เป็นระบบ
การใช้กระบวนการความคิดที่เป็นระบบ ทั้งในเชิงแยกส่วนและองค์รวมในการวิเคราะห์ และการกำหนดทางเลือกในการตัดสินใจและการประเมิน
การประเมินผลลัพธ์ที่ต้องการอย่างต่อเนื่อง
การวิเคราะห์สิ่งที่มีความไม่แน่นอนและมีผลต่อกระบวนการตัดสินใจ
การพิจารณาความเสี่ยงที่อาจเกิดขึ้น และระดับที่ยอมรับได้/ไม่ได้ จากผลการตัดสินใจ
การนำสิ่งที่ตัดสินใจเข้าสู่การปฏิบัติ
ระยะเวลาของหลักสูตร ไม่น้อยกว่า 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(115, 5, '312', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เป็นผู้นำในโครงการหรือพันธกิจที่สำคัญขององค์กรให้ประสบความสำเร็จตามเป้าหมายที่องค์กรกำหนด
มอบหมายงานให้คิดแผนยุทธศาสตร์ 5-10 ปี ขององค์กร
มอบหมายให้วางแผนโครงการระยะยาวหรือการลงทุนระยะยาวขององค์กรเพื่อให้ได้ผลสัมฤทธิ์ตามเป้าหมายอย่างยั่งยืน
การคิดและพฤติกรรม
ทำการสืบสวนความเปลี่ยนแปลงทั้งปัจจัยภายใน และภายนอกที่ระบุไว้ แล้วจัดทำรายการของปัญหา และทางแก้ไขโดยลงรายละเอียดที่รวมถึงขั้นตอนที่จะกระทำการเพื่อให้ได้ผลประโยชน์สูงสุดจากโอกาสเหล่านั้น หรือเพื่อป้องกันปัญหาที่อาจเกิดขึ้นในระยะเวลา 5 - 10 ปีข้างหน้า
หมั่นอ่านแนวโน้มของระบบอุตสาหกรรม เทคโนโลยีใหม่ๆ หรือ Article ใน Journal ต่างๆ เพื่อให้สามารถเข้าใจสถานการณ์ที่อาจเกิดขึ้นในอนาคตและวางแผนเตรียมการรับมือได้อย่างถูกต้อง
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการเป็นผู้นำในการริเริ่มสร้างสรรค์แนวคิดใหม่ กระบวนการทำงานใหม่หรือนวัตกรรมต่างๆ รวมถึงสนับสนุนและให้รางวัลกับการทำงานที่ประสบความสำเร็จ', 'การฝึกอบรม
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการวางกลยุทธ์ภาครัฐ (Strategic Orientation- SO) 
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการคิดวิเคราะห์ (Analytical Thinking- AT)
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการคิดวิเคราะห์และการแก้ไขปัญหาแบบมืออาชีพ (Analyze and Solve Problems Professionally– ASP)
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการวิเคราะห์และบูรณาการ (Synthesis Thinking - ST)', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(116, 1, '313', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้สืบหาข้อมูลเบื้องต้นที่สามารถหาข้อมูลโดยจากการสอบถาม หรือจากแหล่งข้อมูลที่มีอยู่ และให้สรุปหรือแสดงผลข้อมูลในรูปแบบต่างๆ
เปิดโอกาสให้ได้ลองปฏิบัติงานที่ต้องใช้การสืบหาข้อมูล ที่มีขอบเขตในการศึกษาไม่ยากมากนัก และสามารถใช้ข้อมูลที่มีอยู่ในการศึกษาได้ เช่น หาข้อมูลได้จากการสอบถามจากผู้ที่เกี่ยวข้อง หรือการใช้ข้อมูลที่มีอยู่ เป็นต้น
การโค้ช (Coaching)
สอนให้รู้จักตั้งคำถามที่เหมาะสมในการสนทนาเวลาที่ต้องการข้อมูลเพิ่มเติม
การฝึกอบรม
การฟังและการสื่อสารอย่างมีประสิทธิภาพ', 'ชื่อหลักสูตรการฝึกอบรม: การฟังและการสื่อสารอย่างมีประสิทธิภาพ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจแนวคิด ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี รวมทั้งสามารถสื่อสารได้อย่างมีประสิทธิภาพ
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการ ข้อดี ข้อเสีย และประโยชน์ของการเป็นผู้ฟังที่ดี และหลักการในจดบันทึกข้อมูลให้ครบถ้วน และเป็นประโยชน์ รวมทั้งหลักการสื่อสารที่มีประสิทธิภาพ
เกมและแบบฝึกหัดการฟัง และการสื่อสารที่มีประสิทธิภาพ รวมทั้งการสรุปผล
ระยะเวลาของหลักสูตร 
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(117, 2, '313', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้จัดทำรายงานที่ต้องการวิเคราะห์และประเมินผลเพื่อให้เกิดข้อมูลที่มีความลึกซึ้งมากที่สุด โดยต้องอาศัยการสืบเสาะหาข้อมูล ปัญหา หรือสถานการณ์อย่างลึกซึ้งมากกว่าการตั้งคำถามตามปกติธรรมดา
หมุนเวียนงานให้ได้ลองปฏิบัติงานในฝ่ายงานที่ต้องอาศัยการค้นคว้าหาข้อมูลที่มีขอบเขตในการศึกษาค่อนข้างกว้าง และไม่สามารถใช้ข้อมูลที่มีอยู่เท่านั้น
มอบหมายงานที่มีซับซ้อนมากขึ้นกว่างานปกติธรรมดาที่ต้องรับผิดชอบอยู่ เพื่อพัฒนาและกระตุ้นให้มีการสืบหาข้อมูลจากผู้เชี่ยวชาญในงานนั้นๆเพิ่มเติมมากขึ้น
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการสื่อสาร 2 ทาง 
สอนให้ตั้งคำถามเพื่อเจาะประเด็นในเชิงลึก
การฝึกอบรม
Building 2-way Communication', 'ชื่อหลักสูตรการฝึกอบรม: Building 2-way Communication
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจหลักการ แนวคิด และประโยชน์ของการสื่อสาร 2 ทาง รวมทั้งสามารถสื่อสารได้อย่างมีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมสามารถเปิดบทสนทนา (Open Good Dialogue) หรือตั้งคำถามที่เป็นประโยชน์เพื่อให้ได้คำตอบหรือข้อมูลที่ต้องการได้
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
หลักการ แนวคิด หัวใจสำคัญของการสื่อสาร และวิธีการสื่อสาร 2 ทางให้มีประสิทธิภาพ
ประโยชน์ของการสื่อสาร 2 ทาง
วิธีการเปิดบทสนทนาที่น่าประทับใจ
หลักการ และวิธีการในการตั้งคำถามที่ได้ข้อมูลเชิงลึก และคำตอบที่ตรงประเด็น
เกม แบบฝึกหัด และทดลองสื่อสาร 2 ทาง รวมทั้งการตั้งคำถาม และสรุปผล
ระยะเวลาของหลักสูตร 
1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(118, 3, '313', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานที่ต้องอาศัยการค้นหาหรือการสอบถามข้อมูลอย่างเจาะลึกจากแหล่งข้อมูลต่างๆ เช่น หนังสือ หนังสือพิมพ์ นิตยสาร เป็นต้น เพื่อพัฒนาการหาข้อมูลในเบื้องลึก
หมุนเวียนงานให้ได้ลองปฏิบัติงานในฝ่ายงานที่ต้องอาศัยการค้นคว้าหาข้อมูลที่มีขอบเขตในการศึกษาค่อนข้างกว้างและมีความซับซ้อน และไม่สามารถใช้ข้อมูลที่มีอยู่เท่านั้น ต้องอาศัยการค้นหาข้อมูลอย่างต่อเนื่องและเจาะลึก
มอบหมายงานที่มีขอบเขตในการศึกษาค่อนข้างกว้าง และไม่สามารถใช้ข้อมูลที่มีอยู่เท่านั้นได้
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการค้นคว้าหาข้อมูลทาง Internet หรือเว็บไซท์ต่างๆ
การฝึกอบรม
เทคนิคการหาข้อมูลที่มีประสิทธิภาพ', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการหาข้อมูลที่มีประสิทธิภาพ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความเข้าใจการหาข้อมูลจากแหล่งต่างๆ ได้อย่างมีประสิทธิภาพสูงสุด
เพื่อให้ผู้เข้าอบรมทดลองปฏิบัติการในการหาข้อมูลที่กำหนด
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
รูปแบบของการค้นหาทั้งในรูปแบบ Index Directory และการค้นหาในรูปแบบ Search Engine 
เทคนิคการค้นหาให้ได้ผลลัพธ์ตามต้องการ  (เช่น การบีบประเด็นให้แคบลง การใช้คำที่ใกล้เคียง การใช้คำหลัก ( Keyword) ช่วยคำหลัก (Keyword) หรือการใช้เครื่องหมายบวกและลบช่วย เป็นต้น)
Search Engine ทั้งในประเทศและต่างประเทศ
ตัวอย่างการใช้งาน Search Engine 
การใช้ฐานข้อมูลของหน่วยงานและการเชื่อมโยงกับฐานข้อมูลหลักอื่นๆ ขององค์กร
ทดลองหาข้อมูลจริง จาก Case Study ที่กำหนดให้
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถสนับสนุนให้เกิดการหาข้อมูลเพิ่มขึ้นมากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(119, 4, '313', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานที่มีลักษณะเป็นการค้นคว้าข้อมูล เพื่อนำมาวิเคราะห์วิจัยเป็นผลลัพธ์ต่อไป
หมุนเวียนงานหรือเปลี่ยนลักษณะความรับผิดชอบไปอยู่ฝ่ายงานค้นคว้าวิจัยงานใหม่ๆ ที่ต้องอาศัยการหาข้อมูลอย่างเป็นระบบ
เปิดโอกาสให้เป็นผู้นำการสรรสร้างสิ่งใหม่ๆ ให้กับฝ่ายงานที่รับผิดชอบ ที่ต้องอาศัยการศึกษาวิจัยข้อมูลอย่างเป็นระบบ
มอบหมายงานให้พัฒนาหรือค้นคว้าวิจัยสิ่งใหม่ๆ ที่ต้องอาศัยหลักการทางสถิติ และข้อมูลในเชิงลึกและเป็นระบบที่เป็นระบบ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการสืบค้นข้อมูลจากแหล่งต่างๆ อย่างเป็นระบบเพื่อนำมาจัดทำงานการศึกษาวิจัยต่างๆ ได้อย่างมีประสิทธิภาพ
สอนงานเรื่องการศึกษาวิจัยข้อมูล
การฝึกอบรม
การจัดการความรู้ ', 'ชื่อหลักสูตรการฝึกอบรม: การจัดการความรู้ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการบริหารความรู้ที่มีประสิทธิภาพสูงสุด
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ประเภทความรู้และองค์ประกอบของความรู้
ความสำคัญของการบริหารความรู้และกระบวนการในการพัฒนาระบบบริหารจัดการความรู้
โมเดลหรือวงจรการจัดการความรู้
ขั้นตอนจัดทำเหมืองความรู้หรือระบบฐานข้อมูลความรู้
พฤติกรรมและแผนการดำเนินงานที่ทำให้เกิดหรือเป็นอุปสรรคไม่ให้เกิดการจัดการความรู้
การทำกิจกรรมเพื่อให้เข้าใจกระบวนการในการบริหารจัดการความรู้
ระยะเวลาของหลักสูตร
ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถสนับสนุนให้เกิดการบริหารจัดการความรู้มากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(120, 5, '313', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้วางระบบในการสืบค้นข้อมูลอย่างเป็นระบบและต่อเนื่องในฝ่ายงานหรือขององค์กร
มอบหมายงานหรือโครงการที่ขยายขอบเขตของโครงการให้กว้างมากขึ้นและมีผลกระทบต่อธุรกิจขององค์กร โดยต้องอาศัยข้อมูลที่เกินและมากกว่าฝ่ายงานที่มีอยู่ เพื่อให้เกิดการติดตามข้อมูลที่ทันสมัยอย่างเป็นระบบและต่อเนื่อง
หมุนเวียนงานหรือเปลี่ยนลักษณะความรับผิดชอบไปอยู่ฝ่ายงานค้นคว้าวิจัยงานใหม่ๆ ที่ไม่เคยเกิดขึ้นในองค์กรมาก่อน ที่ต้องอาศัยการหาข้อมูลอย่างเป็นระบบและต่อเนื่อง เพื่อให้ได้มาซึ่งข้อมูลที่มีความทันสมัยและทันต่อเหตุการณ์
เปิดโอกาสให้เป็นผู้นำโครงการในการพัฒนาและบริหารจัดการระบบการสืบค้นข้อมูลที่มีอยู่ในองค์กร
มอบหมายงานให้ศึกษาวิจัยความเคลื่อนไหวของตลาด คู่แข่ง สังคม การเมือง และสิ่งแวดล้อมอย่างต่อเนื่อง และต้องการข้อมูลที่ทันเหตุการณ์และมีความทันสมัย เพื่อนำข้อมูลเหล่านั้นมาใช้ได้อย่างทันเวลา', 'การดูงาน
การมีโอกาสได้ไปดูงานหรือศึกษาระบบเทคโนโลยีสารสนเทศอย่างเป็นรูปธรรมจากหน่วยงาน/องค์กรอื่นๆ ที่มีความเชี่ยวชาญด้านการพัฒนาและวางระบบบริหารจัดการข้อมูลที่ยึดโยงกับเทคโนโลยีอย่างเป็นรูปธรรมจะช่วยให้องค์กรมีระบบบริหารจัดการข้อมูลที่มีประสิทธิภาพมากขึ้น', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(121, 1, '314', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้ศึกษาการใช้เทคโนโลยี ระบบและกระบวนการทำงานในหน่วยงานของตนว่าเป็นอย่างไร เพื่อให้แน่ใจว่ามีความเข้าใจที่ถูกต้อง
มอบหมายให้จัดทำขั้นตอนการทำงาน และกระบวนการปฏิบัติงานต่างๆ ของหน่วยงานที่สังกัดอยู่ 
มอบหมายให้จัดทำแผนงานก่อนการทำงานในโครงการของหน่วยงาน
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องการใช้เทคโนโลยี เครื่องมือ และระบบต่างๆ ในหน่วยงาน
สอนงานในเรื่องกฎระเบียบ ขั้นตอนการปฏิบัติงานที่ถูกต้องภายในของหน่วยงานที่รับผิดชอบ
การฝึกอบรม
การเขียนผังงาน', 'ชื่อหลักสูตรการฝึกอบรม: การเขียนผังงาน 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่องการเขียนผังงานเพื่อแสดงกระบวนการทำงาน
เพื่อให้ผู้เข้าอบรมได้มีโอกาสทบทวนกระบวนงานของตน
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
ทางเดินของกระบวนงานทั้งปัจจัยนำเข้าและการรับข้อมูล (Input) การดำเนินการและการประมวลผล (Process) และผลผลิตและผลกระทบต่างๆ ของกระบวนงาน (Output/Outcome)
สัญลักษณ์ที่ใช้ในการเขียนผังงานและหลักเกณฑ์ทั่วไปของการเขียนผังงาน
ระยะเวลาของหลักสูตร
1/2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(122, 2, '314', 'กิจกรรมเพื่อการพัฒนา (สำหรับระดับที่ 2)
การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้ระบุกิจกรรม หรือผลลัพธ์ต่างๆ ที่จะเกิดขึ้นภายในงานหรือโครงการ 
มอบหมายงานที่มีความหลากหลายและมีความสำคัญเท่าเทียมกันในช่วงเวลาพร้อมๆ กัน เพื่อพัฒนาการวางแผนงานด้านการจัดลำดับความสำคัญหรือความเร่งด่วนของงานได้อย่างมีประสิทธิภาพ
มอบหมายงานให้จัดแผนงานการดำเนินโครงการในหน่วยงาน ขั้นตอนการดำเนินงาน ตารางเวลา และผลลัพธ์ของโครงการ เพื่อให้สามารถจัดการโครงการได้บรรลุตามแผนและเวลาที่วางไว้
มอบหมายให้ดำเนินการวิเคราะห์หาข้อดี ข้อเสียและผลต่อเนื่องของแผนงานที่วางไว้ในโครงการที่หน่วยงานรับผิดชอบ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษาเรื่องการวางแผนงาน การวางแผนขั้นตอนการทำงาน หรือวางแผนงานโครงการ
สอนงานให้สามารถจัดลำดับความสำคัญหรือความเร่งด่วนของงานได้
การฝึกอบรม
การวางแผนงานและการตั้งเป้าหมาย (Goal Setting)', 'ชื่อหลักสูตรการฝึกอบรม: การวางแผนงานและการตั้งเป้าหมาย
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความรู้และเข้าใจในเรื่องการกำหนดเป้าหมาย
เพื่อให้ผู้เข้าอบรมมีเครื่องมือในการวางแผนงานและกิจกรรมต่างๆ ให้มีประสิทธิภาพสูงสุด
กรอบเนื้อหาของหลักสูตร
กระบวนการและหลักการกำหนดเป้าหมายการทำงานที่มีประสิทธิภาพ
เครื่องมือและแนวทางในการวางแผนงาน กิจกรรม ผลลัพธ์ และระยะเวลาให้สอดคล้องกับเป้าหมาย
การติดตามและจัดลำดับความสำคัญของงาน เพื่อให้ได้เป้าหมายที่มีประสิทธิภาพมากขึ้นมีกิจกรรมให้ผู้รับการฝึกอบรมเข้าใจในกรอบแนวคิด และนำไป                              ใช้จริงในการปฏิบัติงานในหน่วยงาน
ระยะเวลาของหลักสูตร: 1 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(123, 3, '314', 'การมอบหมายงานและการหมุนเวียนงาน
ให้ศึกษากระบวนการดำเนินงาน และขั้นตอนการปฏิบัติงานของหน่วยงานอื่นๆ แล้ววิเคราะห์เชื่อมโยงกระบวนการทำงานร่วมกันให้มีประสิทธิภาพสูงสุด 
ให้ติดต่อประสานงานกับหน่วยงานอื่นๆ เพื่อเชื่อมโยงระบบและกระบวนการทำงานร่วมกัน
ให้ปรับปรุงระบบการทำงาน วิธีการ ขั้นตอน และกระบวนการดำเนินงานในหน่วยงาน
ร่วมกันทำโครงการ เพื่อระบุ และอธิบายเหตุปัจจัย ผลกระทบ ปัญหา และข้อจำกัดต่างๆ ที่เกิดขึ้นในงานและหน่วยงานของตนได้ 
การโค้ช (Coaching)
ดูแล แนะนำ และให้คำปรึกษาเรื่องระบบ เทคโนโลยี และกระบวนการทำงานในปัจจุบันของหน่วยงานอื่นๆ
การฝึกอบรม
การปรับปรุงกระบวนงานให้มีประสิทธิภาพยิ่งขึ้น (Process Improvement)', 'ชื่อหลักสูตรการฝึกอบรม: การปรับปรุงกระบวนงานให้มี
ประสิทธิภาพยิ่งขึ้น (Process Improvement)
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมเข้าใจถึงกระบวนการในการปรับปรุงระบบการทำงานให้มีประสิทธิภาพ
เพื่อให้ผู้เข้าอบรมสามารถนำเครื่องมือและกระบวนการการปรับปรุงกระบวนงานไปใช้ให้เกิดประโยชน์กับองค์กร
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย 
การบรรยายเพื่อให้เห็นถึงกระบวนการในการปรับปรุงกระบวนการด้วยเครื่องมือต่างๆ เช่น PDCA, Value Analysis, Total Quality Management (TQM) หรือ Six Sigma Process Improvement
กระบวนการในการเก็บข้อมูล วิเคราะห์ ตีความและนำเสนอข้อมูล เพื่อไปปรับปรุงกระบวนงานของหน่วยงาน เช่น การใช้ Pareto Diagrams การใช้ Histograms Run Charts หรือ Force Field Analysis เป็นต้น
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(124, 4, '314', 'การมอบหมายงานและการหมุนเวียนงาน
ให้เป็นผู้ริเริ่มโครงการที่ต้องติดต่อสัมพันธ์และติดต่อประสานงานกับหลายๆ หน่วยงาน เพื่อศึกษาเรียนรู้ความสำเร็จหรือความผิดพลาดของระบบหรือกระบวนการการทำงานขององค์กร ที่เกี่ยวข้องและนำมาปรับใช้กับการทำงานของหน่วยงานอย่างเหมาะสม
มอบหมายให้ศึกษากระแสหรือสถานการณ์ภายนอกที่จะกระทบต่อองค์กร แล้วนำผลการศึกษามากำหนด/วางแผนว่าจะสามารถปรับเปลี่ยนกระบวนการ ระบบ เทคโนโลยีขององค์กรได้อย่างไรให้สามารถตอบสนองต่อสถานการณ์ภายนอกเหล่านั้นได้อย่างมีประสิทธิภาพสูงสุด
มอบหมายให้ศึกษาและทบทวนเพื่อสรุปความสำเร็จหรือความผิดพลาดของกระบวนการการทำงานในปีที่ผ่านมา และนำเสนอแผนการปรับปรุงและเตรียมความพร้อมที่มีประสิทธิภาพ
มอบหมายดำเนินการปรับระบบ กระบวนการทำงาน หรือมาตรฐานการทำงานของหน่วยงาน เพื่อให้เตรียมรับมือกับนโยบายหรือระบบมาตรฐานที่เปลี่ยนแปลง
การฝึกอบรม
Process Re-Engineering', 'ชื่อหลักสูตรการฝึกอบรม: Process Re-Engineering 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีกรอบความคิดเรื่อง Process Reengineering
เพื่อให้ผู้เข้าอบรมได้มีโอกาสทดลองปฏิบัติจริง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กระบวนการเก็บข้อมูลเพื่อให้เข้าใจระบบงานเดิม
กระบวนการวิเคราะห์ Outcome Analysis
กระบวนการวิเคราะห์ Technology Analysis
เทคนิคต่างๆ ในการปรับปรุงกระบวนงาน เช่น Activity Elimination Assess Potential Business Value, การกำหนดต้นทุน (Determine Project Cost), การกำหนดความเสี่ยง (Determine Risk of Failure)
กระบวนการในการพัฒนาแนวคิดสำหรับระบบงานใหม่และกำหนดสิ่งที่ต้องปรับปรุง (TO BE Approach)
ระยะเวลาของหลักสูตร
2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าได้มีการนำไปใช้หรือไม่', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(125, 5, '314', 'การมอบหมายงานและการหมุนเวียนงาน
ให้เป็นผู้นำในการวางกลยุทธ์ขององค์กร โดยพิจารณาจากสถานการณ์เฉพาะหน้าที่เกิดขึ้นอย่างเป็นระบบ
ให้มีส่วนร่วมในโครงการขนาดใหญ่ขององค์กร หรือกระทรวงอุตสาหกรรม และเป็นผู้นำในการวางยุทธศาสตร์การดำเนินงาน 
ให้เป็นผู้นำในการบริหารการเปลี่ยนแปลงในเชิงนโยบายของโครงการขนาดใหญ่ในองค์กร
ให้วางแผนงานเชิงนโยบายที่จะมีผลกระทบต่อการเปลี่ยนแปลงในภาพรวมขององค์กรและกระทรวงอุตสาหกรรมให้เติบโตอย่างยั่งยืน
มอบหมายให้เขียนบทความทางวิชาการหรือทำการวิจัยด้านกฎระเบียบในองค์กร
มอบหมายให้เป็นที่ปรึกษาในการปฏิบัติงานให้กับหน่วยงานอื่นๆ เพื่อให้สามารถสั่งสมประสบการณ์จนเกิดเป็นความเชี่ยวชาญในงาน', 'การฝึกอบรม
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการวางกลยุทธ์ภาครัฐ (Strategic Orientation- SO) 
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องวิสัยทัศน์ (Visioning-VS)
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องศักยภาพเพื่อนำการปรับเปลี่ยน (Change Leadership- CL)', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(126, 1, '315', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้เข้าร่วมเป็นส่วนหนึ่งของการแก้ไขปัญหาที่เกิดขึ้นในองค์กรหรือในหน่วยงานที่รับผิดชอบ
ให้โอกาสทำงานโครงการเฉพาะกิจที่เน้นการแก้ไขปัญหาและต้องอาศัยการพลิกแพลง ปรับเปลี่ยนกระบวนการใหม่ๆ เป็นสำคัญ
มอบหมายให้หาข้อมูลใหม่ๆ หรือข้อมูลที่จำเป็นในการทำวิจัย
มอบหมายให้ศึกษาและอ่านหนังสือที่เกี่ยวข้องกับการสั่งสมความเชี่ยวชาญในสายอาชีพ
มอบหมายให้เกิดการสนทนาแลกเปลี่ยนความรู้กับผู้อื่น จนเป็นนิสัย เพื่อให้ก้าวทันวิทยาการ องค์ความรู้และเทคโนโลยีใหม่ๆ ในงานที่ตนรับผิดชอบ
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา เรื่องแนวทางหรือกระบวนการในการแก้ปัญหาที่เกิดขึ้น รวมถึงให้การสนับสนุนและคำชมเชยหากสามารถแก้ไขปัญหาได้สำเร็จ
การฝึกอบรม
เทคนิคการหาข้อมูลที่มีประสิทธิภาพ', 'ชื่อหลักสูตรการฝึกอบรม: เทคนิคการหาข้อมูลที่มีประสิทธิภาพ
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมมีความเข้าใจการหาข้อมูลจากแหล่งต่างๆ ได้อย่างมีประสิทธิภาพสูงสุด
เพื่อให้ผู้เข้าอบรมทดลองปฏิบัติการในการหาข้อมูลที่กำหนด
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
รูปแบบของการค้นหาทั้งในรูปแบบ Index Directory และการค้นหาในรูปแบบ Search Engine 
เทคนิคการค้นหาให้ได้ผลลัพธ์ตามต้องการ  (เช่น การบีบประเด็นให้แคบลง การใช้คำที่ใกล้เคียง การใช้คำหลัก ( Keyword) ช่วยคำหลัก (Keyword) หรือการใช้เครื่องหมายบวกและลบช่วย เป็นต้น)
Search Engine ทั้งในประเทศและต่างประเทศ
ตัวอย่างการใช้งาน Search Engine 
ทดลองหาข้อมูลจริง จาก Case Study ที่กำหนดให้
ระยะเวลาของหลักสูตร
ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด นอกจากนั้นให้ผู้บังคับบัญชาประเมินว่าในการปฏิบัติงานจริงนั้นสามารถสนับสนุนให้เกิดการหาข้อมูลเพิ่มขึ้นมากน้อยเพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(127, 2, '315', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายให้แก้ปัญหาวิกฤติในหน่วยงานที่รับผิดชอบหรือหน่วยงานอื่นที่เกี่ยวข้อง
หมั่นศึกษาประสบการณ์ในการแก้ไขปัญหาต่างๆ ในองค์กรเพื่อนำมาประยุกต์กับสถานการณ์หรือปัญหาที่เจอในหน่วยงาน
ฝึกการจัดเตรียมแผนการรองรับ (Basic Contingency Plan) เพื่อเตรียมการหากเกิดเหตุฉุกเฉินขึ้น 
สร้างความคิดที่ยืดหยุ่นและพลิกแพลงในการแก้ไขปัญหาหรือดำเนินการทำงานในหน่วยงาน
ฝึกทักษะในการประเมินสถานการณ์และกล้ารับผิดชอบที่จะแก้ปัญหา (หากอยู่ภายใต้หน้าที่รับผิดชอบ) หรือส่งต่อให้บุคคลที่เกี่ยวข้อง
วิเคราะห์ข้อมูล และหาเหตุผลตามแนวคิด และหลักการในวิชาชีพ เพื่อตัดสินใจดำเนินการแก้ไขปัญหาที่เกิดขึ้นอย่างมีประสิทธิภาพสูงสุด
พลิกแพลงหรือประยุกต์แนวทางในการแก้ปัญหา โดยอ้างอิงจากข้อมูล หลักการ และแนวคิดในสายวิชาชีพ หรือประสบการณ์ในการทำงาน
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการแก้ปัญหาวิกฤติ หรือสถานการณ์ที่สำคัญในองค์กร
การฝึกอบรม
การแก้ไขปัญหาอย่างเป็นระบบ ', 'ชื่อหลักสูตรการฝึกอบรม: เรื่องการแก้ไขปัญหาอย่างเป็นระบบ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถกำหนดขอบเขต (Parameter) ของข้อมูลในการวิเคราะห์ได้ครอบคลุม ถูกต้องและทุกระดับ
เพื่อให้ผู้เข้าอบรมสามารถแยกแยะสาเหตุและผลของปัญหาจนสามารถวิเคราะห์ทางเลือกและประเมินผลสำเร็จได้อย่างถูกต้อง
กรอบเนื้อหาของหลักสูตร
เนื้อหาหลักประกอบด้วย การบรรยายเพื่อให้เห็นถึง
กรอบความคิดในการพิจารณาปัญหาที่ต้องตั้ดสินใจ 
การกำหนดวัตถุประสงค์ที่ต้องการบรรลุผลสำเร็จในการตัดสินใจ
การกำหนดขอบเขตข้อมูลที่ต้องใช้วิเคราะห์ และสร้างความสัมพันธ์ระหว่างปัจจัยต่างๆ ในเชิงเหตุและผลที่เป็นระบบ
การใช้กระบวนการความคิดที่เป็นระบบ ทั้งในเชิงแยกส่วนและองค์รวมในการวิเคราะห์
การกำหนดทางเลือกในการตัดสินใจและการประเมินผลลัพธ์ที่ต้องการอย่างต่อเนื่อง
การวิเคราะห์สิ่งที่มีความไม่แน่นอนและมีผลต่อกระบวนการตัดสินใจ
การนำสิ่งที่ตัดสินใจเข้าสู่การปฏิบัติ
ระยะเวลาของหลักสูตร
ไม่ต่ำกว่า 2 วัน
แนวทางการประเมินผล
ผู้เข้าอบรม จะถูกประเมินเมื่อเริ่มการฝึกอบรม และสิ้นสุดการฝึกอบรมว่ามีระดับการพัฒนาความเข้าใจหรือไม่ เพียงใด', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(128, 3, '315', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้จัดแผนงานการดำเนินโครงการ ขั้นตอนการปฏิบัติงาน ตารางเวลา และผลลัพธ์ที่เกี่ยวข้องกับหลายๆ กลุ่ม/ฝ่ายงานเพื่อสามารถวางแผนงานหรือเชื่อมโยงงานหรือกิจกรรมต่างๆ ที่มีความซับซ้อนได้บรรลุตามเป้าหมาย/แผนงานที่กำหนดไว้ได้
หมุนเวียนงานให้รับผิดชอบงานการเชื่อมโยง (Integration) ระบบงาน กระบวนการปฏิบัติงาน หรือโครงการที่หลากหลายต่างๆ เข้าด้วยกัน
มอบหมายให้วิเคราะห์หาปัญหาหรือสถานการณ์ที่ทำให้หน่วยงาน/องค์กรไม่บรรลุเป้าหมายที่กำหนดไว้ แล้วให้นำเสนอแนวทางในการแก้ไขปัญหาดังกล่าวที่มีประสิทธิภาพสูงสุดและปฏิบัติได้จริง
มอบหมายให้วิเคราะห์ข้อมูล ปัญหา หรือสถานการณ์ โดยอาศัยประสบการณ์ และความเชี่ยวชาญที่สั่งสมมาในสายอาชีพ เพื่อไปกำหนดแผนป้องกันและหลีกเลี่ยงปัญหาที่อาจเกิดขึ้น 
มอบหมายให้วางแผน และทดลองใช้วิธีการ องค์ความรู้ หรือเทคโนโลยีใหม่ๆ ในสายอาชีพ ในการป้องกัน หลีกเลี่ยงหรือแก้ไขปัญหาให้เกิดขึ้นของผู้ประกอบการ
การโค้ช (Coaching)
สอนงานในเรื่องการวิเคราะห์ข้อดี ข้อเสีย และผลกระทบต่างๆ ที่เกี่ยวข้องกับการวางแผนงาน
ไปพบผู้ประกอบการและแก้ไขปัญหาเชิงยุทธศาสตร์ของหน่วยงานผู้ประกอบการร่วมกัน
การฝึกอบรม
Scenario Planning ', 'ชื่อหลักสูตรการฝึกอบรม: Scenario Planning 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถเข้าใจถึงกรอบแนวคิดในเรื่องการวางแผนภาพในอนาคต 
เพื่อให้ผู้เข้าอบรมมีเครื่องมือในการบริหารจัดการเชิงรุก
กรอบเนื้อหาของหลักสูตร
กรอบแนวคิดในเรื่อง Scenario Planning
เครื่องมือและกระบวนการคิดแบบ Scenario Planning เช่น การสังเคราะห์แนวโน้ม การกำหนดตัวแปรที่ไม่แน่นอนในอนาคต (Uncertainty) 
การคัดสรรทางเลือกที่จะจัดการกับปัญหาหรือโอกาสในแต่ละ Scenario
ความสัมพันธ์ของ Scenario Planning กับการดำเนินงานเชิงรุก และการคิดเชิงกลยุทธ์
มีกิจกรรมต่างๆ เพื่อให้ผู้เข้าอบรมได้เข้าใจถึงกรอบแนวคิดและนำ Scenario Planning ไปใช้
ระยะเวลาของหลักสูตร ไม่น้อยกว่า 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(129, 4, '315', 'การมอบหมายงานและการหมุนเวียนงาน
มอบหมายงานให้เริ่มหน่วยงานหรือเริ่มโครงการใหม่ๆ ที่ต้องวางแผนงานให้เชื่อมโยงกับกลยุทธ์ระยะยาวขององค์กร โดยวางแผนว่าทำอะไรก่อนหลังอย่างไร อะไรเป็นผลงานที่สำคัญกว่า (Priority) และจะมีการวางแผนทรัพยากรอย่างไรให้สามารถบรรลุผลได้ตามเป้าหมายที่กำหนดไว้
มอบหมายให้วางแผนและนำเสนอแผนงาน 5 ปีแก่ผู้บริหารระดับสูงของหน่วยงานหรือองค์กร.
มอบหมายให้วิเคราะห์ และผสมผสานศาสตร์หลายๆ แขนงในการแก้ไขปัญหาให้กับหน่วยงานผู้ประกอบการซึ่งมีความซับซ้อนสูง
ให้คิดนอกกรอบและริเริ่มโครงการที่มีผลต่อองค์กรในอนาคต 
การโค้ช (Coaching)
ดูแล แนะนำ ให้คำปรึกษา และเล่าประสบการณ์ในการเป็นผู้นำในการริเริ่มสร้างสรรค์แนวคิดใหม่ กระบวนการทำงานใหม่หรือนวัตกรรมต่างๆ รวมถึงสนับสนุนและให้รางวัลกับการทำงานที่ประสบความสำเร็จ
ให้โอกาสและไม่ตำหนิหากความคิดริเริ่มนั้นไม่ประสบความสำเร็จตามที่คาดหมายไว้ 
การฝึกอบรม
การสร้างความคิดสร้างสรรค์ (Creative and Lateral Thinking)', 'ชื่อหลักสูตรการฝึกอบรม: การสร้างความคิดสร้างสรรค์ 
วัตถุประสงค์
เพื่อให้ผู้เข้าอบรมสามารถเข้าใจถึงกรอบแนวคิดการสร้างความคิดสร้างสรรค์ 
เพื่อให้ผู้เข้าอบรมมีเครื่องมือในการบริหารนวัตกรรม
กรอบเนื้อหาของหลักสูตร
กรอบแนวคิดในเรื่องการคิดแบบ Lateral Thinking
แรงจูงใจและอุปสรรคต่อความคิดสร้างสรรค์
เครื่องมือและกระบวนการคิด เช่น Brain Storming Mind Mapping Absence Thinking Assumption Busting ฯลฯ
การใช้ Six Hats ในการคิดสร้างสรรค์มีกิจกรรมต่างๆ เพื่อให้ผู้เข้าอบรมได้เข้าใจถึงกรอบแนวคิดมาใช้
ระยะเวลาของหลักสูตร ไม่น้อยกว่า 2 วัน
แนวทางการประเมินผล
มีการประเมินความเข้าใจของผู้เข้าอบรมก่อนและหลังการฝึกอบรม ขณะเดียวกันในการปฏิบัติงานจริงให้ผู้บังคับบัญชาประเมินว่ามีการนำบทเรียนไปใช้หรือไม่อย่างไร', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
		$cmd = " INSERT INTO PER_DEVELOPE_GUIDE (PD_GUIDE_ID, PD_GUIDE_LEVEL, PD_GUIDE_COMPETENCE, PD_GUIDE_DESCRIPTION1, 
						PD_GUIDE_DESCRIPTION2, UPDATE_USER, UPDATE_DATE) 
						VALUES(130, 5, '315', 'การมอบหมายงานและการหมุนเวียนงาน
ให้เป็นผู้นำในการบริหารการเปลี่ยนแปลงในเชิงนโยบายของโครงการขนาดใหญ่ในองค์กร
ให้วางแผนงานเชิงนโยบายที่จะมีผลกระทบต่อการเปลี่ยนแปลงในภาพรวมขององค์กรและกระทรวงอุตสาหกรรมให้เติบโตอย่างยั่งยืน
มอบหมายให้เป็นที่ปรึกษาในการปฏิบัติงานให้กับหน่วยงานอื่นๆ เพื่อให้สามารถสั่งสมประสบการณ์จนเกิดเป็นความเชี่ยวชาญในงาน
มอบหมายให้ปรับเปลี่ยน (Reshape) หน่วยงานต่างๆ ในองค์กรโดยเป็นผู้นำในโครงการที่มีการบูรณาการในเชิงวิชาชีพ
ให้ทำงานในหน่วยงานผู้ประกอบการในบางเรื่องเฉพาะด้าน จนกลายเป็นผู้นำในสายอาชีพในเรื่องดังกล่าว 
มอบหมายให้วางแผนกลยุทธ์ขององค์กรที่ช่วยแปรวิกฤติให้เป็นโอกาส และเกิดประโยชน์อย่างยั่งยืนแก่องค์กรในระยะยาว', 'การฝึกอบรม
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องการวางกลยุทธ์ภาครัฐ (Strategic Orientation- SO) 
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องวิสัยทัศน์ (visioning-VS)
เช่นเดียวกันกับหัวข้อการฝึกอบรมในกิจกรรมเพื่อการพัฒนาของสมรรถนะ เรื่องศักยภาพเพื่อนำการปรับเปลี่ยน (Change Leadership- CL)', $SESS_USERID, '$UPDATE_DATE') ";
		$db_dpis1->send_cmd($cmd);
		//$db_dpis1->show_error();
		
	}

?>